{"nodes": [{"course_id": "aes487", "reg_prereqs": [], "numCID": 487, "choice_prereqs": [], "course_info": "<p><b>AES 487 Cultures and Politics of Environmental Justice (5) I&amp;S, DIV</b><i> D. PENA</i><br/>Comparative survey of environmental justice movements in the world with focus on critical studies of environmental racism, risk, and sustainable development. Provides theoretical knowledge and research methods incorporating the study of equity and autonomy in environmental impact and risk assessment and other aspects of environmental policy politics. "}, {"course_id": "aes489", "reg_prereqs": [], "numCID": 489, "choice_prereqs": [], "course_info": "<p><b>AES 489 Black Cultural Studies (5) I&amp;S</b><br/>Examines how images of blackness have been (re)constructed through identity formation and entrenched inequality. Topics include black women's bodies, black men's bodies, blackface minstrelsy, black queer studies, black power, and black hybridities. "}, {"course_id": "aes446", "reg_prereqs": [], "numCID": 446, "choice_prereqs": [], "course_info": "<p><b>AES 446 Music in American Cultures (3) VLPA/I&amp;S</b><br/>Compares musical history and experience of selected American cultures that have fed into the American musical mainstream or had significant popularity on its periphery. Case studies may include African Americans, Latino/a Americans, Jewish Americans, Asian Americans, or European Americans. Considerations of social identity as well as musical styles. "}, {"course_id": "aes250", "reg_prereqs": [], "numCID": 250, "choice_prereqs": [], "course_info": "<p><b>AES 250 Race in the American University (5) I&amp;S</b><br/>Racial integration in American institutions of higher education. Entry to, and impact on, American universities by people of color. History of ethnic studies and its relation to other disciplines.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/AES250\" target=\"_blank\">View course details in MyPlan: AES 250</a></p"}, {"course_id": "aes462", "reg_prereqs": [], "numCID": 462, "choice_prereqs": [], "course_info": "<p><b>AES 462 Comparative Race and Ethnic Relations (5) I&amp;S, DIV</b><br/>Race and ethnicity as factors of social differentiation in a number of Western and non-Western societies in Europe, Africa, Asia, and the Americas. "}, {"course_id": "aes461", "reg_prereqs": [], "numCID": 461, "choice_prereqs": [], "course_info": "<p><b>AES 461 Comparative Ethnic Race Relations in the Americas (5) I&amp;S</b><br/>Sketches the ethnoracial systems operating in American society. Studies these systems as systems and examines their institutional and interpersonal dynamics. Compares ethnoracial systems in order to arrive at empirical generalizations about race/ethnorelations in the Americas. "}, {"course_id": "aes211", "reg_prereqs": [], "numCID": 211, "choice_prereqs": [], "course_info": "<p><b>AES 211 Environmental Justice (5) I&amp;S, DIV</b><i> D. PENA</i><br/>Examines introductory studies of environmental racism and ecological injustice in the United States and select areas of the world. Reviews environmental justice theories and methods applied to risk science, ecosystem management, biodiversity conservation, and sustainable development. Includes comparative studies of social movements for \"eco-justice.\" "}, {"course_id": "aes212", "reg_prereqs": [], "numCID": 212, "choice_prereqs": [], "course_info": "<p><b>AES 212 Comparative American Ethnic Literature (5) VLPA/I&amp;S, DIV</b><i> Butler</i><br/>Reviews selected texts by African American, American Indian, Asian American, Chicano/Latino, and Euro American writers.  Includes a comparison of how texts envision and interpret a diverse American culture and social, political relations among peoples of the United States. Explores the power of cultural agency in the creation of America's literature.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/AES212\" target=\"_blank\">View course details in MyPlan: AES 212</a></p"}, {"course_id": "aes335", "reg_prereqs": [], "numCID": 335, "choice_prereqs": [], "course_info": "<p><b>AES 335 History of African Americans and Sports (5) I&amp;S, DIV</b><i> J. WALTER</i><br/>Development of sport in the US and its importance for US culture and society. Covers increased centrality of athletic competition as part of the new leisure time in the late - 19th century, revival of the Olympic movement, racial segregation/integration, today's American notions of celebrity and social style.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/AES335\" target=\"_blank\">View course details in MyPlan: AES 335</a></p"}, {"course_id": "aes333", "reg_prereqs": [], "numCID": 333, "choice_prereqs": [], "course_info": "<p><b>AES 333 Race and Ethnicity in the U.S. Military (5) I&amp;S</b><i> Salas</i><br/>The experiences of racial minorities in the military. Topics include segregation of units, desegregation of military, career limitations and opportunities, minority women, military families, racism, and role of veterans in civil rights struggles after service.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/AES333\" target=\"_blank\">View course details in MyPlan: AES 333</a></p"}, {"course_id": "aes151", "reg_prereqs": [], "numCID": 151, "choice_prereqs": [], "course_info": "<p><b>AES 151 Identities, Cultures, and Power Across American Ethnic Groups (5) I&amp;S, DIV</b><br/>Provides an introduction to the major theories, debates, and issues concerning the study of identities and cultures of American ethnic groups as they are constituted through relationships of power.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/AES151\" target=\"_blank\">View course details in MyPlan: AES 151</a></p"}, {"course_id": "aes330", "reg_prereqs": [], "numCID": 330, "choice_prereqs": [], "course_info": "<p><b>AES 330 Beyond Civil Rights: Law, Culture, and Change (5) I&amp;S</b><br/>Assessment of the contemporary politics of civil rights as shaped by an identity politics that is both significant and passe. "}, {"course_id": "aes490", "reg_prereqs": [], "numCID": 490, "choice_prereqs": [], "course_info": "<p><b>AES 490 Representing Beyond the Binaries: Mixing Race, Gender, and Sexuality in the Media (5) I&amp;S, DIV</b><i> Joeseph</i><br/>Cultural studies approach to examining the mixed formations that race, sexuality, and gender take in the contemporary United States media. Draws upon multi-disciplinary scholarship in examination of the media. "}, {"course_id": "aes496", "reg_prereqs": [], "numCID": 496, "choice_prereqs": [], "course_info": "<p><b>AES 496 Honors Senior Thesis (5-10, max. 10)</b><br/>Supervised individual and independent/tutorial study for AES Departmental Honors students involving research, writing, project completion, and completion of a major 30-page paper or commensurate project. Offered: AWSpS.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/AES496\" target=\"_blank\">View course details in MyPlan: AES 496</a></p"}, {"course_id": "aes494", "reg_prereqs": [], "numCID": 494, "choice_prereqs": [], "course_info": "<p><b>AES 494 Community Practicum and Internship (3-5, max. 10)</b><br/>Faculty supervised practicum and internship experience in variety of settings and agencies, e.g., ethnic specific agencies, government and civic community-based offices. Students contribute skills and knowledge to respective communities and gain experience by working with professionals and community organizers. Credit/no-credit only.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/AES494\" target=\"_blank\">View course details in MyPlan: AES 494</a></p"}, {"course_id": "aes498", "reg_prereqs": [], "numCID": 498, "choice_prereqs": [], "course_info": "<p><b>AES 498 Special Topics in American Ethnic Studies (1-5, max. 15) I&amp;S</b><br/>Designed to provide the student an opportunity to concentrate on one specific aspect of American Ethnic Studies through a comparative, interdisciplinary approach.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/AES498\" target=\"_blank\">View course details in MyPlan: AES 498</a></p"}, {"course_id": "aes499", "reg_prereqs": [], "numCID": 499, "choice_prereqs": [], "course_info": "<p><b>AES 499 Independent Study or Research (1-5, max. 10)</b><br/>Independent readings and/or research under the supervision of a faculty member.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/AES499\" target=\"_blank\">View course details in MyPlan: AES 499</a></p"}, {"course_id": "aes361", "reg_prereqs": [], "numCID": 361, "choice_prereqs": [], "course_info": "<p><b>AES 361 Ethnicity, Business, Unions, and Society (5) I&amp;S</b><i> Scott</i><br/>Interrelationships of ethnicity, business, unions, and the larger society. Examines financial and sociological structure of business and manufacturing sector, how this sector performs, and consequences of performance for selected ethnic groups in United States. "}, {"course_id": "aes450", "reg_prereqs": [], "numCID": 450, "choice_prereqs": [], "course_info": "<p><b>AES 450 American Ethnic Health: Race, Gender, and Status            Groups (5) I&amp;S, DIV</b><i> Kashima</i><br/>Introduces newer social science and health science related work on race, ethnicity, culture, socio-cultural, and environmental issues affecting American racial minorities. Considers differential rates of physical and medical problems such as cardiovascular disease rates, diabetes statistics, low birth weight children, etc. Offered: AWSp.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/AES450\" target=\"_blank\">View course details in MyPlan: AES 450</a></p"}, {"course_id": "aes389", "reg_prereqs": [], "numCID": 389, "choice_prereqs": [], "course_info": "<p><b>AES 389 Race, Gender, and Sexuality in the Media (5) I&amp;S, DIV</b><br/>Introduction to media representations of gender, race, and sexuality. "}, {"course_id": "aes380", "reg_prereqs": [], "numCID": 380, "choice_prereqs": [], "course_info": "<p><b>AES 380 Race, Ethnicity, and United States Public Policy (5) I&amp;S</b><br/>Explores the causes of disproportionate representation for people of color among the country's impoverished population; drawing on analysis of race/ethnicity, poverty, public policy, (including competing theories), public policy approaches, and ethnographic work addressing the causes and perpetuation of poverty in America.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/AES380\" target=\"_blank\">View course details in MyPlan: AES 380</a></p"}, {"course_id": "aes322", "reg_prereqs": ["gwss200"], "numCID": 322, "choice_prereqs": [], "course_info": "<p><b>AES 322 Gender, Race, and Class in Social Stratification (5) I&amp;S, DIV</b><br/>The intersection of race, class, and gender in the lives of women of color in the United States from historical and contemporary perspectives. Topics include racism, classism, sexism, activism, sexuality, and inter-racial dynamics between women of color groups. "}, {"course_id": "aes340", "reg_prereqs": [], "numCID": 340, "choice_prereqs": [], "course_info": "<p><b>AES 340 Race, Ethnicity, and Education (5) I&amp;S, DIV</b><br/>Focuses on critical social and political dimensions of race and ethnicity as they relate to issues and practices of pedagogy and power in American education. Considers schooling as sites at which contemporary politics of diversity play out amidst increasingly diverse demographics of students, teachers, and parents.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/AES340\" target=\"_blank\">View course details in MyPlan: AES 340</a></p"}, {"course_id": "aes150", "reg_prereqs": [], "numCID": 150, "choice_prereqs": [], "course_info": "<p><b>AES 150 In-Justice for All: Intersection of Race, Ethnicity, Class, and Gender in the United States (5) I&amp;S, DIV</b><i> Gamboa, Salas</i><br/>Focusing on pre-Columbus era to 1970, students develop an understanding of how race, ethnicity, nationality, class, and gender impact all Americans - especially those viewed as racial ethnic minorities.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/AES150\" target=\"_blank\">View course details in MyPlan: AES 150</a></p"}, {"course_id": "aes345", "reg_prereqs": [], "numCID": 345, "choice_prereqs": [], "course_info": "<p><b>AES 345 Ethnographies of School Inequalities (5) I&amp;S, DIV</b><i> Bonus</i><br/>Explores various issues and practices of school inequalities through the methods of critical ethnography.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/AES345\" target=\"_blank\">View course details in MyPlan: AES 345</a></p"}], "links": []}