{"nodes": [{"course_info": "<p><b>AMATH 482 Computational Methods for Data Analysis (5)</b><br/>Exploratory and objective data analysis methods applied to the physical, engineering, and biological sciences. Brief review of statistical methods and their computational implementation for studying time series analysis, spectral analysis, filtering methods, principal component analysis, orthogonal mode decomposition, and image processing and compression. ", "course_name": "AMATH 482", "choice_prereqs": [["amath352", "math136", "math308"]], "course_id": "amath482", "numCID": 482, "reg_prereqs": ["amath301"]}, {"course_info": "<p><b>AMATH 490 Special Topics (1-5, max. 15)</b><br/>Topics of current interest in applied mathematics not covered by other undergraduate courses.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/AMATH490\" target=\"_blank\">View course details in MyPlan: AMATH 490</a></p", "course_name": "AMATH 490", "choice_prereqs": [], "course_id": "amath490", "numCID": 490, "reg_prereqs": []}, {"course_info": "<p><b>AMATH 342 Introduction to Neural Coding and Computation (3)</b><br/>Introduces computational neuroscience, grounded in neuronal and synaptic biophysics. Works through mathematical description of how neurons encode information, and how neural activity is produced dynamically. Uses and teaches Matlab as a programming language to implement models of neuronal dynamics and to perform coding analysis. ", "course_name": "AMATH 342", "choice_prereqs": [], "course_id": "amath342", "numCID": 342, "reg_prereqs": ["math125"]}, {"course_info": "<p><b>AMATH 498 Senior Project or Thesis (1-6, max. 6)</b><br/>Intended for Honors students and other advanced undergraduates completing a special project or senior thesis in applied mathematics. Offered: AWSpS.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/AMATH498\" target=\"_blank\">View course details in MyPlan: AMATH 498</a></p", "course_name": "AMATH 498", "choice_prereqs": [], "course_id": "amath498", "numCID": 498, "reg_prereqs": []}, {"course_info": "<p><b>AMATH 301 Beginning Scientific Computing (4) NW</b><br/>Introduction to the use of computers to solve problems arising in the physical, biological, and engineering sciences. Application of mathematical judgment, programming architecture, and flow control in solving scientific problems. Introduction to MATLAB routines for numerical programming, computation, and visualization. ", "course_name": "AMATH 301", "choice_prereqs": [["math125", "qsci292", "math135"]], "course_id": "amath301", "numCID": 301, "reg_prereqs": []}, {"course_info": "<p><b>AMATH 401 Vector Calculus and Complex Variables (4) NW</b><br/>Emphasizes acquisition of solution techniques; illustrates ideas with specific example problems arising in science and engineering. Includes applications of vector differential calculus, complex variables; line-surface integrals; integral theorems; and Taylor and Laurent series, and contour integration. ", "course_name": "AMATH 401", "choice_prereqs": [["math126", "math136"]], "course_id": "amath401", "numCID": 401, "reg_prereqs": []}, {"course_info": "<p><b>AMATH 481 Scientific Computing (5)</b><br/>Project-oriented computational approach to solving problems arising in the physical/engineering sciences, finance/economics, medical, social, and biological sciences. Problems requiring use of advanced MATLAB routines and toolboxes. Covers graphical techniques for data presentation and communication of scientific results. ", "course_name": "AMATH 481", "choice_prereqs": [["amath351", "math307"], ["amath352", "math308"]], "course_id": "amath481", "numCID": 481, "reg_prereqs": ["amath301"]}, {"course_info": "<p><b>AMATH 403 Methods for Partial Differential Equations (4) NW</b><br/>Covers separation of variables, Fourier series and Fourier transforms, Sturm-Liouville theory and special functions, eigenfunction expansions, and Greens functions. ", "course_name": "AMATH 403", "choice_prereqs": [["amath351", "math136", "math307"]], "course_id": "amath403", "numCID": 403, "reg_prereqs": ["amath401"]}, {"course_info": "<p><b>AMATH 402 Introduction to Dynamical Systems and Chaos (4) NW</b><br/>Overview methods describing qualitative behavior of solutions on nonlinear differential equations. Phase space analysis of fixed pointed and periodic orbits. Bifurcation methods. Description of strange attractors and chaos. Introductions to maps. Applications: engineering, physics, chemistry, and biology. ", "course_name": "AMATH 402", "choice_prereqs": [["amath351", "math136", "math307"]], "course_id": "amath402", "numCID": 402, "reg_prereqs": []}, {"course_info": "<p><b>AMATH 383 Introduction to Continuous Mathematical Modeling (3) NW</b><br/>Introductory survey of applied mathematics with emphasis on modeling of physical and biological problems in terms of differential equations. Formulation, solution, and interpretation of the results. ", "course_name": "AMATH 383", "choice_prereqs": [["amath351", "math136", "math307"]], "course_id": "amath383", "numCID": 383, "reg_prereqs": []}, {"course_info": "<p><b>AMATH 423 Mathematical Analysis in Biology and Medicine (3) NW</b><br/>Focuses on developing and analyzing mechanistic, dynamic models of biological systems and processes, to better understand their behavior and function. Applications drawn from many branches of biology and medicine. Provides experiences in applying differential equations, difference equations, and dynamical systems theory to biological problems. ", "course_name": "AMATH 423", "choice_prereqs": [["amath351", "math307", "h/stat390"]], "course_id": "amath423", "numCID": 423, "reg_prereqs": []}, {"course_info": "<p><b>AMATH 422 Computational Modeling of Biological Systems (3) NW</b><br/>Examines fundamental models that arise in biology and their analysis through modern scientific computing. Covers discrete and continuous-time dynamics, in deterministic and stochastic settings, with application from molecular biology to neuroscience to population dynamics; statistical analysis of experimental data; and MATLAB programming from scratch. ", "course_name": "AMATH 422", "choice_prereqs": [["math307", "amath351"]], "course_id": "amath422", "numCID": 422, "reg_prereqs": []}, {"course_info": "<p><b>AMATH 483 High-Performance Scientific Computing (5)</b><br/>Introduction to hardware, software, and programming for large-scale scientific computing. Overview of multicore, cluster, and supercomputer architectures; procedure and object oriented languages; parallel computing paradigms and languages; graphics and visualization of large data sets; validation and verification; and scientific software development. ", "course_name": "AMATH 483", "choice_prereqs": [["cse142", "amath301"]], "course_id": "amath483", "numCID": 483, "reg_prereqs": []}, {"course_info": "<p><b>AMATH 499 Undergraduate Reading and Research (1-6, max. 6)</b><br/>Credit/no-credit only. Offered: AWSpS.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/AMATH499\" target=\"_blank\">View course details in MyPlan: AMATH 499</a></p", "course_name": "AMATH 499", "choice_prereqs": [], "course_id": "amath499", "numCID": 499, "reg_prereqs": []}, {"course_info": "<p><b>AMATH 351 Introduction to Differential Equations and Applications (3) NW</b><br/>Introductory survey of ordinary differential equations; linear and nonlinear equations; Taylor series; and. Laplace transforms. Emphasizes on formulation, solution, and interpretation of results. Examples drawn from physical and biological sciences and engineering. ", "course_name": "AMATH 351", "choice_prereqs": [], "course_id": "amath351", "numCID": 351, "reg_prereqs": ["math125"]}, {"course_info": "<p><b>AMATH 353 Partial Differential Equations and Waves (3) NW</b><br/>Covers traveling waves of linear equations, dispersion relation, stability, superposition and Fourier analysis, d'Alembert solution, standing waves, vibrations and separation of variables, traveling waves of nonlinear equations, conservation laws, characteristics, breaking, shocks, and rarefaction. ", "course_name": "AMATH 353", "choice_prereqs": [["amath351", "math136", "math307"]], "course_id": "amath353", "numCID": 353, "reg_prereqs": []}, {"course_info": "<p><b>AMATH 352 Applied Linear Algebra and Numerical Analysis (3) NW</b><br/>Analysis and application of numerical methods and algorithms to problems in the applied sciences and engineering. Applied linear algebra, including eigenvalue problems. Emphasis on use of conceptual methods in engineering, mathematics, and science. Extensive use of MATLAB package for programming and solution techniques. ", "course_name": "AMATH 352", "choice_prereqs": [["math126", "qsci293"]], "course_id": "amath352", "numCID": 352, "reg_prereqs": []}], "links": [{"source": 4, "target": 0}, {"source": 4, "target": 6}, {"source": 5, "target": 7}]}