{"nodes": [{"course_id": "anth362", "reg_prereqs": [], "numCID": 362, "choice_prereqs": [], "course_info": "<p><b>ANTH 362 Anthropology of Tourism (5) I&amp;S, DIV</b><i> M. KAHN</i><br/>Anthropological approaches to tourism. Debates about cultural encounters and cultural change, authenticity, economic development, social inequalities, identity, gender, ethnicity, nationality, and cultural representation. "}, {"course_id": "anth399", "reg_prereqs": [], "numCID": 399, "choice_prereqs": [], "course_info": "<p><b>ANTH 399 Junior Honors Seminar (5) I&amp;S</b><br/>Teaches skills required to write senior Honors thesis, including evaluation of academic and scientific writing, formulation of problem, collection of bibliographic and other resources, evaluation of research proposals, and research proposal preparation. Final product is a formal thesis prospectus.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH399\" target=\"_blank\">View course details in MyPlan: ANTH 399</a></p"}, {"course_id": "anth403", "reg_prereqs": [], "numCID": 403, "choice_prereqs": [], "course_info": "<p><b>ANTH 403 Qualitative Research Methods in Sociocultural Anthropology (5) I&amp;S</b><i> H. BARKER</i><br/>Introduces qualitative research methods of anthropology, and data generated. Methods covered include interviewing, focus groups, participant-observation, discourse analysis, and use of visual materials. Addresses ethics as relevant to every phase of research. Explores methods through focus on a specific thematic topic, which varies from year to year. Offered: W.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH403\" target=\"_blank\">View course details in MyPlan: ANTH 403</a></p"}, {"course_id": "anth404", "reg_prereqs": [], "numCID": 404, "choice_prereqs": [["ling203"]], "course_info": "<p><b>ANTH 404 South America (5) I&amp;S</b><br/>Survey of anthropological research among the traditional peoples of South America. Historical background and contemporary life of cultural groups of the Amazonian Basin. Transformation of traditional lifestyles through the process of European conquest and the aftermath of colonialism. Detailed study of selected societies. "}, {"course_id": "anth406", "reg_prereqs": [], "numCID": 406, "choice_prereqs": [["anth210", "envir201", "jsis200", "jsis201", "jsis202"]], "course_info": "<p><b>ANTH 406 China's Environment (5) I&amp;S</b><i> S. HARRELL</i><br/>Analysis of contemporary environmental problems in China, including population, food, water supply, pollution, biodiversity, and environmental activism. Combines natural science and social science perspectives. "}, {"course_id": "anth407", "reg_prereqs": [], "numCID": 407, "choice_prereqs": [], "course_info": "<p><b>ANTH 407 Global Futures in East Asia (5) I&amp;S</b><i> A. ANAGNOST</i><br/>Explores interlinked modernity projects in China, Japan, Korea, and Taiwan and how the education of youth figures in projects of national development and international economic competition. "}, {"course_id": "anth314", "reg_prereqs": [], "numCID": 314, "choice_prereqs": [[]], "course_info": "<p><b>ANTH 314 Ethnography, Transnationalism, and Community in Island Southeast Asia/Asian America (5) I&amp;S, DIV</b><i> C. LOWE</i><br/>Ethnographic exploration of the transformative processes of transnationalism in relation to identity and community formation in Southeast Asia and among Southeast Asian Americans. Experiential learning format concentrates on mini-ethnographic projects, field trips, and group presentations. "}, {"course_id": "anth315", "reg_prereqs": [], "numCID": 315, "choice_prereqs": [], "course_info": "<p><b>ANTH 315 Southeast Asian Civilization: Buddhist and Vietnamese (5) I&amp;S, DIV</b><i> C. KEYES</i><br/>Civilizations of Theravada Buddhist societies in Burma, Thailand, Cambodia, and Laos and in Vietnamese societies of Southeast Asia. Culture of tribal peoples who live on peripheries of these societies. Cultural transformations consequent upon the war in Indochina and resettlement of Indochinese refugees in United States. "}, {"course_id": "anth316", "reg_prereqs": [], "numCID": 316, "choice_prereqs": [], "course_info": "<p><b>ANTH 316 Modern South Asia (5) I&amp;S</b><br/>Twentieth-century history and society of Indian subcontinent. Topics include nationalism, rural and urban life, popular culture, gender, and environmental politics. "}, {"course_id": "anth317", "reg_prereqs": [], "numCID": 317, "choice_prereqs": [], "course_info": "<p><b>ANTH 317 Anthropology of Tibetan Civilization (5) I&amp;S</b><br/>Introduces the basic features of Tibetan society and culture, exploring how the global debate over Tibet's past, present, and future relates to contemporary concerns in anthropology, through the examination of Tibetan history, social and political organization, religion, and other cultural themes in both traditional and contemporary contexts.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH317\" target=\"_blank\">View course details in MyPlan: ANTH 317</a></p"}, {"course_id": "anth310", "reg_prereqs": [], "numCID": 310, "choice_prereqs": [], "course_info": "<p><b>ANTH 310 Native North American Societies (5) I&amp;S, DIV</b><i> Smith</i><br/>Traditional cultures of America north of Mexico, emphasizing diversity of North American Indian and Eskimo societies. Origins of Native-American culture areas and language groupings; subsistence systems; levels of social organization; European conquest and colonialism; and description of representative cultures from the ten culture areas.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH310\" target=\"_blank\">View course details in MyPlan: ANTH 310</a></p"}, {"course_id": "anth311", "reg_prereqs": [], "numCID": 311, "choice_prereqs": [], "course_info": "<p><b>ANTH 311 The Cultural Politics of Diet and Nutrition (5) I&amp;S</b><i> A. ANAGNOST</i><br/>Examines current debates within the United States about what dietary guidelines are optimal for human health; how changing conceptions of individual responsibility and political life are framing these debates; how social movements for food sovereignty are changing food practices: and how eaters define their ethics through food. Offered: AWSpS.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH311\" target=\"_blank\">View course details in MyPlan: ANTH 311</a></p"}, {"course_id": "anth312", "reg_prereqs": [], "numCID": 312, "choice_prereqs": [], "course_info": "<p><b>ANTH 312 Pacific Islands Literature and Film (5) VLPA/I&amp;S, DIV</b><br/>Examines the Pacific through a detailed consideration of creative works by contemporary Pacific writers and filmmakers. Topics include cultural identity; colonialism and its effects on Indigenous peoples, land, wellness, family, and community; and the importance of knowing where you come from.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH312\" target=\"_blank\">View course details in MyPlan: ANTH 312</a></p"}, {"course_id": "anth313", "reg_prereqs": [], "numCID": 313, "choice_prereqs": [], "course_info": "<p><b>ANTH 313 Peoples of Africa (5) I&amp;S</b><br/>Survey of the many cultures of pre- and post-colonial sub-Saharan Africa. Appreciation of the adaptability, strength, and creativity of African peoples.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH313\" target=\"_blank\">View course details in MyPlan: ANTH 313</a></p"}, {"course_id": "anth318", "reg_prereqs": [], "numCID": 318, "choice_prereqs": [], "course_info": "<p><b>ANTH 318 Anthropology of Islam and Muslim Societies (3) I&amp;S</b><br/>Examines diverse expression and experiences of Islam from anthropological perspective. Considers Islam as a lived experience by emphasizing everyday lives of Muslims in context through ethnographic accounts. Covers range of issues including identity, rituals, gender, and political Islam. "}, {"course_id": "anth150", "reg_prereqs": [], "numCID": 150, "choice_prereqs": [], "course_info": "<p><b>ANTH 150 Culture and Rights: Exploring the Meaning and Practice of Human Rights (5) I&amp;S, DIV</b><br/>Examines social justice issues with the aim of obtaining deeper understanding of human rights. Analyzes historical and theoretical foundations and introduces international and regional institutions designed to implement and enforce human rights. Case studies in sovereignty, war crimes, ethnic cleansing, genocide, torture, truth commissions, and forgiveness.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH150\" target=\"_blank\">View course details in MyPlan: ANTH 150</a></p"}, {"course_id": "anth491", "reg_prereqs": [], "numCID": 491, "choice_prereqs": [], "course_info": "<p><b>ANTH 491 Honors Colloquium (2, max. 12) I&amp;S</b><br/>Introduction to anthropological research. Students read original articles and papers and discuss them with authors. Research presenters include department faculty, visiting faculty, and advanced graduate students. Credit/no-credit only.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH491\" target=\"_blank\">View course details in MyPlan: ANTH 491</a></p"}, {"course_id": "anth497", "reg_prereqs": [], "numCID": 497, "choice_prereqs": [], "course_info": "<p><b>ANTH 497 Domesticating International Human Rights: Perspectives on U.S. Asylum and Refugee Law (5) I&amp;S, DIV</b><i> A. OSANLOO</i><br/>Examines the creation, production, and proliferation of law and legal categories relating to the status of refugees and asylum-seekers in the United States. Integrates anthropological perspectives of law's ability to create meaning in the examination of deeper implications of asylum and refugee law in American society. "}, {"course_id": "anth495", "reg_prereqs": [], "numCID": 495, "choice_prereqs": [], "course_info": "<p><b>ANTH 495 Advanced Problems in Ethnology (3-5, max. 10) I&amp;S</b><br/>Current problems in ethnology. Seminar format.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH495\" target=\"_blank\">View course details in MyPlan: ANTH 495</a></p"}, {"course_id": "anth499", "reg_prereqs": [], "numCID": 499, "choice_prereqs": [], "course_info": "<p><b>ANTH 499 Undergraduate Research (*, max. 12)</b><br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH499\" target=\"_blank\">View course details in MyPlan: ANTH 499</a></p"}, {"course_id": "anth498", "reg_prereqs": [], "numCID": 498, "choice_prereqs": [], "course_info": "<p><b>ANTH 498 Women's Rights and Politics in Islamic Society (5) I&amp;S, DIV</b><i> A. OSANLOO</i><br/>Human rights theory with women's legal rights and practice within context of the Islamic state. Introduction to debates regarding universality of human rights through examination of women's rights in Muslim context. Considers journalistic notions of homogeneity among Muslims, political nature of the Islamic state, and its mobilization of human rights. "}, {"course_id": "anth435", "reg_prereqs": [], "numCID": 435, "choice_prereqs": [["ling203"]], "course_info": "<p><b>ANTH 435 Economic Anthropology (5) I&amp;S</b><br/>Chief features of nonmonetary and simple monetary economics. Impact of central or metropolitan market economy and industrial technology as peripheral systems, especially of small-scale and limited monetary circulation. Development and application in anthropology of economic concepts, including Marxian. "}, {"course_id": "anth437", "reg_prereqs": [], "numCID": 437, "choice_prereqs": [], "course_info": "<p><b>ANTH 437 Political Anthropology and Social Change (5) I&amp;S</b><br/>Study of politics from different anthropological perspectives, especially processual approaches to political change. Focused examination of cultural aspects of modern state formation in local and regional contexts. Themes: colonialism and nationalism, regime and transitions, local politics and global processes, social construction of bureaucracy. "}, {"course_id": "anth430", "reg_prereqs": [], "numCID": 430, "choice_prereqs": [], "course_info": "<p><b>ANTH 430 The Anthropology of Music (3) VLPA/I&amp;S</b><br/>Analysis of aspects of anthropological thought influential in ethnomusicology. Critical evaluation of dominant theoretical schools and modes of explanation, e.g., evolutionist, diffusionist, historical particularist, structuralist, functionalist, symbolist, and semiotic, through detailed examination of seminal texts. "}, {"course_id": "anth433", "reg_prereqs": [], "numCID": 433, "choice_prereqs": [["ling432"]], "course_info": "<p><b>ANTH 433 Sociolinguistics II (5) VLPA/I&amp;S</b><br/>Examines field methods linguists use in socially oriented studies of language variation and change. Includes language attitudes, study of urban dialects, syntactic variation, sampling and interview design. Discussion of issues related to recording, ethics, and analysis of large bodies of data. "}, {"course_id": "anth432", "reg_prereqs": [], "numCID": 432, "choice_prereqs": [["ling200", "ling400"]], "course_info": "<p><b>ANTH 432 Sociolinguistics I (5) VLPA/I&amp;S, DIV</b><br/>Interrelationships between social and linguistic factors influencing variation in speech production and perception, morphology, syntax, lexicon. Considers contribution of ethnic, regional and socioeconomic group memberships to dialect differentiation and progression of language change. Nonstandard language, diglossia, pidgins, creoles, gender differences, bi- and multilingualism, ethnography of speaking, pragmatics, and language attitudes. "}, {"course_id": "anth439", "reg_prereqs": [], "numCID": 439, "choice_prereqs": [["anth203", "ling200", "ling201", "ling203", "ling400"]], "course_info": "<p><b>ANTH 439 Pidgin and Creole Languages (5) VLPA/I&amp;S</b><br/>Explores aspects of the linguistic structure, history, and social context of pidgin and creole languages. Creolization as one possible outcome of language contact. Examines theories of creole genesis, similarities and differences between creole and non-creole languages. "}, {"course_id": "anth321", "reg_prereqs": [], "numCID": 321, "choice_prereqs": [], "course_info": "<p><b>ANTH 321 Comparative Religion (3/5) I&amp;S</b><br/>Anthropological approaches to religious experience and belief with emphasis on conceptual issues such as ritual, symbolism, identity, ecstatic experience, and revitalization movements in the context of globalization. Also addresses the diversity of religious expression in American culture and how that compares with other societies. "}, {"course_id": "anth323", "reg_prereqs": [], "numCID": 323, "choice_prereqs": [], "course_info": "<p><b>ANTH 323 Human Rights Law in Culture and Practice (5) I&amp;S, DIV</b><i> A. OSANLOO</i><br/>Introduces the complexities of issues surrounding human rights. Examines human rights concerns through critical analyses, taking into account legal, social, economic, and historical variables. "}, {"course_id": "anth322", "reg_prereqs": [], "numCID": 322, "choice_prereqs": [], "course_info": "<p><b>ANTH 322 Comparative Study of Death (5) I&amp;S</b><br/>Death analyzed from a cross-cultural perspective. Topics include funerary practices, concepts of the soul and afterlife, cultural variations in grief, cemeteries as folk art, and medical and ethical issues in comparative context. American death practices compared to those of other cultures. "}, {"course_id": "anth324", "reg_prereqs": [], "numCID": 324, "choice_prereqs": [], "course_info": "<p><b>ANTH 324 Current Issues in Medical Anthropoogy and Global Health (2) I&amp;S</b><br/>Guest speakers showcase local expertise in the field. Speakers share information about the path that led them to research in MAGH, and raise current research questions in their field of expertise. Credit/no-credit only.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH324\" target=\"_blank\">View course details in MyPlan: ANTH 324</a></p"}, {"course_id": "anth328", "reg_prereqs": [], "numCID": 328, "choice_prereqs": [], "course_info": "<p><b>ANTH 328 Gender and Sexuality in China (5) I&amp;S, DIV</b><i> S. WELLAND</i><br/>Explores gender and sexuality in China's process of modernization, form the late Qing dynasty through the building of the Republic, Communist revolution, and post-Mao economic reform. Examines, through historical, anthropological, and cultural studies scholarship, the centrality of these social constructs I terms of family, sate, labor, body, and ethnicity. "}, {"course_id": "anth483", "reg_prereqs": [], "numCID": 483, "choice_prereqs": [], "course_info": "<p><b>ANTH 483 Africa Living with HIV/AIDS (5) I&amp;S</b><i> R. CHAPMAN</i><br/>Examines the epidemiological, historical, political-economic, and social-cultural dimensions of Africa living with HIV/AIDS and the current challenges and debates in international HIV/AIDS policy and programming. Various approaches and analytical models help students grasp the complicated and multiple effects, responses, conditions, and debates surrounding the African HIV/AIDS pandemic.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH483\" target=\"_blank\">View course details in MyPlan: ANTH 483</a></p"}, {"course_id": "anth484", "reg_prereqs": ["gwss200"], "numCID": 484, "choice_prereqs": [], "course_info": "<p><b>ANTH 484 Ideologies and Technologies of Motherhood (5) I&amp;S, DIV</b><br/>Examines how motherhood is culturally constituted, regulated, and managed within various ideological and technological milieus. Uses ethnographies from anthropology and case studies from feminist legal theory. Topics include slave mothers, surrogate mothers, lesbian mothers, transracial mothers, co-mothers, teen mothers. "}, {"course_id": "anth487", "reg_prereqs": [], "numCID": 487, "choice_prereqs": [], "course_info": "<p><b>ANTH 487 Cultures and Politics of Environmental Justice (5) I&amp;S, DIV</b><i> D. PENA</i><br/>Comparative survey of environmental justice movements in the world with focus on critical studies of environmental racism, risk, and sustainable development. Provides theoretical knowledge and research methods incorporating the study of equity and autonomy in environmental impact and risk assessment and other aspects of environmental policy politics. "}, {"course_id": "anth488", "reg_prereqs": [], "numCID": 488, "choice_prereqs": [], "course_info": "<p><b>ANTH 488 Agroecology (5) I&amp;S/NW</b><i> D. PENA</i><br/>Cross-cultural survey of agroecological research methods, theoretical problems, policy issues, and ethical debates. Local knowledge and ethnoscientific bases of alternative agriculture. Comparative political ecology of agroecosystems with a focus on indicators of social equity and ecological sustainability.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH488\" target=\"_blank\">View course details in MyPlan: ANTH 488</a></p"}, {"course_id": "anth489", "reg_prereqs": [], "numCID": 489, "choice_prereqs": [], "course_info": "<p><b>ANTH 489 Anthropology Practicum (2-9, max. 15)</b><br/>Faculty-supervised internships, either on or off campus, in organizations utilizing anthropological skills in nonacademic settings. Settings may include museums, academic journals, social service or other governmental agencies, and private nonprofit service agencies.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH489\" target=\"_blank\">View course details in MyPlan: ANTH 489</a></p"}, {"course_id": "anth423", "reg_prereqs": [], "numCID": 423, "choice_prereqs": [], "course_info": "<p><b>ANTH 423 Traffic Across Cultural Boundaries (5) I&amp;S</b><br/>Focuses on the movement of cultural patterns and processes across boundaries, examining the \"contact zones\" in colonial encounters, moving to borrowing and blendings along ethnic and national borders. Examines border crossing of immigration and diasporas. Ethnographic examples from the Americas and Africa. "}, {"course_id": "anth420", "reg_prereqs": [], "numCID": 420, "choice_prereqs": [], "course_info": "<p><b>ANTH 420 The Social Life of Psychiatry (5) I&amp;S</b><br/>Anthropological perspective on social and cultural aspects of contemporary psychiatry. Explores psychiatry as a social practice, an arena for competing cultural assumptions about mental illness and treatment, and a source of diagnostic categories and interpretive methods that influence larger society. Considers how psychiatry influences and is influenced by the cultural history of Europe and the United States.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH420\" target=\"_blank\">View course details in MyPlan: ANTH 420</a></p"}, {"course_id": "anth421", "reg_prereqs": ["sc202"], "numCID": 421, "choice_prereqs": [["anth321", "sc201"]], "course_info": "<p><b>ANTH 421 Belief, Ritual, and the Structure of Religion (5) I&amp;S</b><br/>Systematic survey of concepts, models, and theories that characterize the anthropological study of religion. Consideration of the human universal basis of religion and of diverse ways in which religions are constructed and related to social experience. "}, {"course_id": "anth427", "reg_prereqs": [], "numCID": 427, "choice_prereqs": [["ling203"]], "course_info": "<p><b>ANTH 427 Anthropology in Urban Settings (3) I&amp;S</b><br/>Cross-cultural examination of theoretical issues in anthropology as studied in urban places. Focuses on ethnic identity and the formation of urban ethnic groups; migration and its rural and urban consequences; family and kinship organization as an adaptation to urban complexity; the nature of urban voluntary associations; law and politics; and the developments in anthropological method. "}, {"course_id": "anth424", "reg_prereqs": [], "numCID": 424, "choice_prereqs": [["ling203"]], "course_info": "<p><b>ANTH 424 Hunter-Gatherer Societies (4) I&amp;S</b><br/>Comparative examination of human foraging societies, emphasizing ethnographic cases and socioecological analysis. Foraging and human evolution; rationality of foraging societies; population and reproductive strategies; variability in social organization and land use; power relations between the sexes; ritual and belief; contemporary status of hunter-gatherer populations. "}, {"course_id": "anth425", "reg_prereqs": [], "numCID": 425, "choice_prereqs": [], "course_info": "<p><b>ANTH 425 Anthropology of the Post-Soviet States (5) I&amp;S</b><i> L. BILANIUK</i><br/>Analysis of Soviet and post-Soviet culture and identity. Historical transformations in Soviet approaches to ethnicity and nationality; contemporary processes of nation building and interethnic conflict. Examination of culture through the intersection of social ritual, government policies, language, economic practices, and daily life. Regional focus varies. "}, {"course_id": "anth428", "reg_prereqs": [], "numCID": 428, "choice_prereqs": [["ling203"]], "course_info": "<p><b>ANTH 428 Anthropological Perspectives on Ethnicity (5) I&amp;S, DIV</b><br/>Anthropological approaches to ethnicity and ethnic group relations with reference to other models including race, caste, class, regional groupings, nations, religion, and stratification. Data drawn from precolonial, colonial, and postcolonial periods. "}, {"course_id": "anth429", "reg_prereqs": [], "numCID": 429, "choice_prereqs": [["ling203"]], "course_info": "<p><b>ANTH 429 Expressive Culture (5) VLPA</b><i> S. WELLAND</i><br/>Anthropological view of one expressive aspect of culture: plastic and graphic arts, myth and folktale, music, dance, humor and tragedy, or play and games. "}, {"course_id": "anth235", "reg_prereqs": [], "numCID": 235, "choice_prereqs": [], "course_info": "<p><b>ANTH 235 Global Feminist Art (5) VLPA/I&amp;S</b><br/>Introduces feminism as a way of thinking about visual art practice in terms of social hierarchy, aesthetic form, and ideology. Explores how feminist artists working in diverse locations and cultural traditions challenge, at the local and global level, artistic conventions and representations of gender, sexuality, race, class, and nationality. "}, {"course_id": "anth233", "reg_prereqs": [], "numCID": 233, "choice_prereqs": [], "course_info": "<p><b>ANTH 233 Introduction to Language and Society (5) VLPA, DIV</b><i> Evans, Wassink</i><br/>Introduces the study of sociolects, the varieties of language that arise from differences in cultural and societal groups, often reflective of power inequalities. Raises awareness of the role that society and the individual play in shaping sociolects via the systematic observation and critical discussion of linguistic phenomena. "}, {"course_id": "anth339", "reg_prereqs": [], "numCID": 339, "choice_prereqs": [], "course_info": "<p><b>ANTH 339 Social Movements in Contemporary India (5) I&amp;S, DIV</b><i> P. RAMAMURTHY</i><br/>Covers issues of social change, economic development, and identity politics in contemporary India studied through environmental and women's movements. Includes critiques of development and conflicts over forests, dams, women's rights, religious community, ethnicity, and citizenship. "}, {"course_id": "anth330", "reg_prereqs": [], "numCID": 330, "choice_prereqs": [], "course_info": "<p><b>ANTH 330 Religion, Identity, and Cultural Pluralism (5) I&amp;S, DIV</b><br/>The role of religion in shaping personal and communal identity in a pluralistic society. Themes include current dimensions of American pluralism, effects of ethnicity, immigration, and electronic communication on building religious communities, and issues of conflict, violence, and reconciliation. "}, {"course_id": "anth358", "reg_prereqs": [], "numCID": 358, "choice_prereqs": [["anth203", "ling203", "psych355"]], "course_info": "<p><b>ANTH 358 Culture and Cognition (5) I&amp;S/NW</b><br/>Surveys anthropological theories and research on the relationship between language, thought, and behavior. Examines the influence of cultural inheritance on perception, classification, inference, and choice. Describes relevant cross-cultural research methods and evaluates theoretical models used by cognitive anthropologists. "}, {"course_id": "anth359", "reg_prereqs": [], "numCID": 359, "choice_prereqs": [], "course_info": "<p><b>ANTH 359 Linguistic Ethnography (5) I&amp;S</b><br/>Language use in cultural contexts. How language reflects world view. Language use in culturally significant settings. Analyzes sets of culturally specific terms in semantic domains. Includes projects demonstrating application of theory and method to data addressing specific problems. Workshop format.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH359\" target=\"_blank\">View course details in MyPlan: ANTH 359</a></p"}, {"course_id": "anth457", "reg_prereqs": [], "numCID": 457, "choice_prereqs": [], "course_info": "<p><b>ANTH 457 Ecological Anthropology (5) I&amp;S</b><br/>Survey of anthropological research on interaction between human societies and their environments. Logic of different subsistence systems; intensification and transformation of subsistence strategies; population regulation; ecological aspects of human nutrition, disease, spatial organization, ethnicity, social stratification, conflict, and cooperation; historical roots of current ecological crisis.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH457\" target=\"_blank\">View course details in MyPlan: ANTH 457</a></p"}, {"course_id": "anth456", "reg_prereqs": [], "numCID": 456, "choice_prereqs": [["ling203"]], "course_info": "<p><b>ANTH 456 Contemporary Ethnography (5) I&amp;S</b><br/>Discusses several contemporary ethnographies. Focuses on what constitutes ethnography and how ethnography is done, as well as the relationship between ethnographic description, methodology, and theory. Covers a range of geographical areas, theoretical perspectives, and literary styles.. "}, {"course_id": "anth455", "reg_prereqs": [], "numCID": 455, "choice_prereqs": [["ling200", "ling201", "h/ling203", "ling400"]], "course_info": "<p><b>ANTH 455 Areal Linguistics (3, max. 6) VLPA/I&amp;S</b><br/>Issues involved in classification of languages. Systems of classification based on structure, word order, areal features. Ways in which languages may be classified for different purposes. Processes such as borrowing, vocabulary specialization, lexical change, and language death and revival. "}, {"course_id": "anth454", "reg_prereqs": [], "numCID": 454, "choice_prereqs": [], "course_info": "<p><b>ANTH 454 Women, Words, Music, and Change (5) VLPA/I&amp;S, DIV</b><br/>Comparative analysis of use of myths, tales, music, and other forms of expressive culture to account for, reinforce, and change women's status and roles. "}, {"course_id": "anth453", "reg_prereqs": [], "numCID": 453, "choice_prereqs": [], "course_info": "<p><b>ANTH 453 Culture, Controversy, and Change: The Case of Female Circumcision (3) I&amp;S</b><i> B. DUNCAN</i><br/>With female circumcision and its surrounding debates as \"a tool to think with,\" develops a number of skills: identifying stakeholders and rhetoric in loaded debates, assessing opposing arguments, critically evaluating scientific evidence, and situating controversial issues in their proper political, historical, social, and cultural contexts.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH453\" target=\"_blank\">View course details in MyPlan: ANTH 453</a></p"}, {"course_id": "anth100", "reg_prereqs": [], "numCID": 100, "choice_prereqs": [], "course_info": "<p><b>ANTH 100 Introduction to Anthropology (5) I&amp;S</b><br/>Introduction to the subfields of archaeology, biocultural anthropology, and sociocultural anthropology through the examination of selected problems in human physical, cultural, and social evolution. Not recommended for students who have had other courses in anthropology, archaeology, or biocultural anthropology.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH100\" target=\"_blank\">View course details in MyPlan: ANTH 100</a></p"}, {"course_id": "anth450", "reg_prereqs": ["ling200"], "numCID": 450, "choice_prereqs": [["ling201", "ling203", "anth203"]], "course_info": "<p><b>ANTH 450 Language and Gender (5) VLPA/I&amp;S, DIV</b><i> L. BILANIUK</i><br/>Survey of the theoretical trends, methods, and research findings on the relationship between language and gender. Focus on power relations in gendered language use. Extensive study of research based on conversational analysis. "}, {"course_id": "anth459", "reg_prereqs": [], "numCID": 459, "choice_prereqs": [], "course_info": "<p><b>ANTH 459 Culture, Ecology, and Politics (5) I&amp;S, DIV</b><i> D. PENA</i><br/>Critical studies of class, gender and race differences in environmental politics. The political-economic dimensions of ecological change. Contemporary environmental movements including the varieties of bioregionalism, deep ecology, ecofeminism, ecosocialism, environmental justice, and social ecology. "}, {"course_id": "anth458", "reg_prereqs": [], "numCID": 458, "choice_prereqs": [["oa201", "archy205"]], "course_info": "<p><b>ANTH 458 Ethnobiology: Plants, Animals, and People (5) I&amp;S</b><i> E. HUNN</i><br/>Culturally mediated relationships between human and natural environment studied in a comparative and evolutionary framework. How do peoples in diverse cultures recognize and name plants and animals and understand their relationship with nature? How is this traditional ecological knowledge applied in people's daily lives? "}, {"course_id": "anth349", "reg_prereqs": [], "numCID": 349, "choice_prereqs": [], "course_info": "<p><b>ANTH 349 Dance/Performance Ethnography (3) VLPA/I&amp;S</b><i> J. MCMAINS</i><br/>Explores theoretical and practical experience in dance and performance ethnography, ethnology, and oral history. Introduces theories and methods of ethnographic fieldwork, ethnographic writing, and ethnologic analysis. Focuses primarily on dance. Also discusses methods and theories applicable to other physical practices such as music, theatre, sports, and performance arts. "}, {"course_id": "anth341", "reg_prereqs": [], "numCID": 341, "choice_prereqs": [], "course_info": "<p><b>ANTH 341 Political Violence and the Post-Colonial State in South Asia (5) I&amp;S, DIV</b><br/>Examines theoretical approaches to the analysis of collective, state, and anti-state violence in post-colonial South Asia through the study of specific cases of political violence in modern India, Pakistan, Sri Lanka, and Nepal. "}, {"course_id": "anth228", "reg_prereqs": [], "numCID": 228, "choice_prereqs": [], "course_info": "<p><b>ANTH 228 Identities: Race, Class, Gender, and Sexuality in Anthropology (5) I&amp;S, DIV</b><br/>An introduction to the study of race, class, gender, and sexuality in anthropology. Through ethnographic and theoretical readings, students are introduced to the concept of identity as intersectional construction and social performance.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH228\" target=\"_blank\">View course details in MyPlan: ANTH 228</a></p"}, {"course_id": "anth345", "reg_prereqs": [], "numCID": 345, "choice_prereqs": [], "course_info": "<p><b>ANTH 345 Women and International Economic Development (5) I&amp;S, DIV</b><i> P. RAMAMURTHY</i><br/>Questions how women are affected by economic development in Third World and celebrates redefinitions of what development means. Introduces theoretical perspectives and methods to interrogate gender and development policies. Assesses current processes of globalization and potential for changing gender and economic inequalities. "}, {"course_id": "anth101", "reg_prereqs": [], "numCID": 101, "choice_prereqs": [], "course_info": "<p><b>ANTH 101 Exploring Sociocultural Anthropology (5) I&amp;S, DIV</b><i> D. HOFFMAN</i><br/>Introduces perspectives from sociocultural anthropology on the diversity and the dynamics of collective human life. Examines how individual lives are shaped by broader social and cultural contexts, how people make meaning, and how power relations work. Introduces ethnography as a method for documenting and understanding social and cultural life.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH101\" target=\"_blank\">View course details in MyPlan: ANTH 101</a></p"}, {"course_id": "anth452", "reg_prereqs": [], "numCID": 452, "choice_prereqs": [], "course_info": "<p><b>ANTH 452 Explorations in Biopower (5) I&amp;S</b><i> S. AMRUTE, A. ANAGNOST, C. LOWE</i><br/>Explores Foucault's concept of biopower - power organized around life - from the perspectives of its theoretical mediations and its anthropological interventions. Looks at specific descriptions of what biopower is and ethnographic extensions of the concept to particular settings and experiences taking place within the modern state.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH452\" target=\"_blank\">View course details in MyPlan: ANTH 452</a></p"}, {"course_id": "anth444", "reg_prereqs": [], "numCID": 444, "choice_prereqs": [], "course_info": "<p><b>ANTH 444 Politics of Representation in Modern China (5) I&amp;S, DIV</b><i> A. ANAGNOST</i><br/>Focuses on issues of representation and power in twentieth century China. Combines substantive information on modern Chinese society and culture with recent debates in social theory and the politics of representation. Major themes include Chinese nationalism, body politics, popular culture, and everyday practice. "}, {"course_id": "anth445", "reg_prereqs": [], "numCID": 445, "choice_prereqs": [["ling203"]], "course_info": "<p><b>ANTH 445 Literature and Society in Southeast Asia (5, max. 10) VLPA/I&amp;S</b><i> C. LOWE</i><br/>Focus on either Vietnam or Thailand. Provides students with opportunity to explore how those living in Southeast Asia have reflected on the radical social changes their societies have undergone through novels, short stories, and poetry. "}, {"course_id": "anth446", "reg_prereqs": [], "numCID": 446, "choice_prereqs": [], "course_info": "<p><b>ANTH 446 Class and Culture in East Asia (5) I&amp;S, DIV</b><br/>Examines the nexus between culture and systems of social stratification/class in East Asia, with an emphasis on Taiwan, Korea, Japan, and China. Topics include class formation, mechanisms of social mobility and reproduction, markers of status and hierarchy, resistance, and the formation of class identity. "}, {"course_id": "anth442", "reg_prereqs": [], "numCID": 442, "choice_prereqs": [], "course_info": "<p><b>ANTH 442 Global Asia (5) I&amp;S, DIV</b><i> S. WELLAND</i><br/>Explores how Asia has been constructed through transnational interactions such as imperialism, anti-colonialism, tourism, diaspora, and global capitalism. Topics include the cultural construction of similarity and difference, politics of representation, and political economy of global circulations of people and things. "}, {"course_id": "anth443", "reg_prereqs": [], "numCID": 443, "choice_prereqs": [], "course_info": "<p><b>ANTH 443 Anthropology of Modern Japan (5) I&amp;S</b><br/>Examines the problem of modernity in Japan since the late nineteenth century, with emphasis on contemporary Japan. Critically addresses previous anthropological work concerning patterns of Japanese \"culture.\" Particular focus on the influence of modern forms of power, media, and exchange in the construction of present-day Japan. "}, {"course_id": "anth448", "reg_prereqs": [], "numCID": 448, "choice_prereqs": [], "course_info": "<p><b>ANTH 448 Modern Korean Society (5) I&amp;S</b><i> Sorensen</i><br/>Social organization and values of twentieth-century Korea. Changes in family and kinship, gender relations, rural society, urban life, education, and industrial organization since 1900. Differences between North and South Korea since 1945. "}, {"course_id": "anth449", "reg_prereqs": [], "numCID": 449, "choice_prereqs": [], "course_info": "<p><b>ANTH 449 Social Transformation of Modern East Asia (5) I&amp;S</b><i> Sorensen</i><br/>Comparative study of social change in China, Japan, Korea, and Vietnam since 1945. Concentration on small-scale social units in rural and urban areas under both communist and capitalist political systems. "}, {"course_id": "anth211", "reg_prereqs": [], "numCID": 211, "choice_prereqs": [], "course_info": "<p><b>ANTH 211 Environmental Justice (5) I&amp;S, DIV</b><i> D. PENA</i><br/>Examines introductory studies of environmental racism and ecological injustice in the United States and select areas of the world. Reviews environmental justice theories and methods applied to risk science, ecosystem management, biodiversity conservation, and sustainable development. Includes comparative studies of social movements for \"eco-justice.\" "}, {"course_id": "anth210", "reg_prereqs": [], "numCID": 210, "choice_prereqs": [], "course_info": "<p><b>ANTH 210 Introduction to Environmental Anthropology (5) I&amp;S/NW</b><i> S. HARRELL, D. PENA</i><br/>Introduction to human/environment interactions from various anthropological perspectives. Intellectual history of anthropological approaches to environment, emphasizing the mutual interconnectedness of people and nature. Survey of evolutionary models; cultural ecology; systems approaches; indigenous knowledge; ethnoecology; nature and the state; political ecology; ecofeminism; and environmentalism.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH210\" target=\"_blank\">View course details in MyPlan: ANTH 210</a></p"}, {"course_id": "anth213", "reg_prereqs": [], "numCID": 213, "choice_prereqs": [], "course_info": "<p><b>ANTH 213 Anthropology and Sport (5) I&amp;S, DIV</b><i> H. BARKER</i><br/>Introduces theories, methods, and findings of sociocultural anthropology through a focus on sport. Considers sport as linked to identities, nationalism, gender, race, class, religion, and other issues. Explores cultural rituals of sport, potentials and obstacles to sport transcending social differences, and sport's role in education, youth development, and community building.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH213\" target=\"_blank\">View course details in MyPlan: ANTH 213</a></p"}, {"course_id": "anth215", "reg_prereqs": [], "numCID": 215, "choice_prereqs": [], "course_info": "<p><b>ANTH 215 Introduction to Medical Anthropology and Global Health (5) I&amp;S, DIV</b><i> R. CHAPMAN</i><br/>Explores influences of global processes on health of U.S. and other societies from a social-justice perspective. Emphasizes inter-relationships between cultural, environmental, social-economic, political, and medical systems that contribute to health status, outcomes, policies, and healthcare delivery. Focuses on health disparities within and between societies and communities around the world.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH215\" target=\"_blank\">View course details in MyPlan: ANTH 215</a></p"}, {"course_id": "anth352", "reg_prereqs": [], "numCID": 352, "choice_prereqs": [], "course_info": "<p><b>ANTH 352 Buddhism and Society: The Theravada Buddhist Tradition in South and Southeast Asia (5) I&amp;S</b><br/>Religious tradition of Theravada Buddhism (as practiced in Sri Lanka, Burma, Thailand, Laos, and Cambodia). Variations in ethical orientations developed through Theravada Buddhist ideas. "}, {"course_id": "anth353", "reg_prereqs": [], "numCID": 353, "choice_prereqs": [], "course_info": "<p><b>ANTH 353 Feminist Anthropology (5) I&amp;S, DIV</b><br/>Explores the history and contemporary practice of feminist ethnography at the interdisciplinary intersection of anthropology and gender studies. Examines how the inclusion of women, as subjects and researchers, has influenced anthropological knowledge production, and how the cross-cultural imperative of anthropology has influenced understandings of gender, sexuality, and race. "}, {"course_id": "anth356", "reg_prereqs": [], "numCID": 356, "choice_prereqs": [], "course_info": "<p><b>ANTH 356 Visual Anthropology (3/5) VLPA/I&amp;S</b><i> S. WELLAND</i><br/>The place of photography and films in ethnography; their use in the documentation and interpretation of cultural and social systems.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH356\" target=\"_blank\">View course details in MyPlan: ANTH 356</a></p"}, {"course_id": "anth357", "reg_prereqs": [], "numCID": 357, "choice_prereqs": [], "course_info": "<p><b>ANTH 357 Peoples and Cultures of Central and Inner Asia (5) I&amp;S</b><br/>Introduces Central and Inner Asia with a multidisciplinary, comparative survey of the cultures and societies of contemporary China's Inner Asia (Mongolia, Xinjiang-Eastern Turkestan, Tibet, and Manchuria), the contemporary Muslim Central Asian republics (Kazakhstan, Kyrgyzstan, Tajikistan, Turkmenistan, and Uzbekistan), and the adjacent areas of Afghanistan and Iran. "}, {"course_id": "anth414", "reg_prereqs": [], "numCID": 414, "choice_prereqs": [], "course_info": "<p><b>ANTH 414 Applied and Public Anthropology (5) I&amp;S</b><i> H. BARKER, R. CHAPMAN</i><br/>Considers the practical application of anthropology's methods and theories to the challenges and research needs of communities and organizations. Concentrates on a specific topic each quarter. Includes a required service-learning component that helps students connect classroom learning beyond the University.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH414\" target=\"_blank\">View course details in MyPlan: ANTH 414</a></p"}, {"course_id": "anth280", "reg_prereqs": [], "numCID": 280, "choice_prereqs": [], "course_info": "<p><b>ANTH 280 Cultures of Global Capital (5) I&amp;S</b><br/>Designed to introduce students to the study of cross-border phenomenon including global capital, migration, international philanthropy, and terrorism from an anthropological perspective. Introduces theories of globalization and the approaches anthropologists have taken in studying patterns of movement and circulation.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH280\" target=\"_blank\">View course details in MyPlan: ANTH 280</a></p"}, {"course_id": "anth306", "reg_prereqs": [], "numCID": 306, "choice_prereqs": [], "course_info": "<p><b>ANTH 306 The Power of Representation: Pacific Islander Voices (5) VLPA/I&amp;S, DIV</b><i> M. KAHN</i><br/>Focuses on how Pacific Islands and Islanders are being represented by Pacific Islander artists, writers, performers, poets, filmmakers, and scholars. By creatively challenging older dominant misrepresentations in ways these individuals are fashioning new identities that transform images and identities, as well as extend the boundaries of \"the Pacific.\"<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH306\" target=\"_blank\">View course details in MyPlan: ANTH 306</a></p"}, {"course_id": "anth289", "reg_prereqs": [], "numCID": 289, "choice_prereqs": [], "course_info": "<p><b>ANTH 289 Identities: Service Learning (3) I&amp;S</b><br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH289\" target=\"_blank\">View course details in MyPlan: ANTH 289</a></p"}, {"course_id": "anth471", "reg_prereqs": [], "numCID": 471, "choice_prereqs": [], "course_info": "<p><b>ANTH 471 Colonialism and Culture (5) I&amp;S, DIV</b><br/>Explores the cultural, political, and historical implications of the power to colonize. Readings include ethnographic, historical, and literary works on colonialism, nationalist responses, and postcolonial positions.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH471\" target=\"_blank\">View course details in MyPlan: ANTH 471</a></p"}, {"course_id": "anth470", "reg_prereqs": ["ling203"], "numCID": 470, "choice_prereqs": [["anth370", "sa370", "hstas454"]], "course_info": "<p><b>ANTH 470 Minority Peoples of China (5) I&amp;S</b><i> S. HARRELL</i><br/>Interaction between China and the peoples of its periphery, including inner Asia, Tibet, northern mainland Southeast Asia, and aboriginal peoples of Taiwan. Emphasis on ethnicity, ethnic group consciousness, and role of the Chinese state. "}, {"course_id": "anth473", "reg_prereqs": [], "numCID": 473, "choice_prereqs": [], "course_info": "<p><b>ANTH 473 Anthropology of Science and Technology (5) I&amp;S/NW</b><i> C. LOWE</i><br/>Introduces the study of science and technology as social and cultural phenomena. Considers both theoretical and methodological questions. Readings include key texts from interdisciplinary field of science studies as well as selected ethnographic texts. Examples taken from U.S. society and other local contexts. "}, {"course_id": "anth472", "reg_prereqs": [], "numCID": 472, "choice_prereqs": [], "course_info": "<p><b>ANTH 472 Case Studies in Medical Anthropology and Global Health (5) I&amp;S</b><br/>Uses multidisciplinary case studies to analyze quantitative parameters of diseases; contrast the description and analytic approaches of health sciences, anthropology, and other social sciences; integrate divers disciplinary perspectives into cohesive information; organize class presentations; and apply critical thinking in approaches to complex health issues. Offered: Sp.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH472\" target=\"_blank\">View course details in MyPlan: ANTH 472</a></p"}, {"course_id": "anth361", "reg_prereqs": [], "numCID": 361, "choice_prereqs": [], "course_info": "<p><b>ANTH 361 Anthropology of Food (5) I&amp;S</b><br/>Explores how foods reproduce social relations, the meanings food acquires within culture, how food systems are intertwined with structures of power and economic inequality, national cuisines and restaurant cultures, the global marketing of foods, controversies surrounding GMO foods, and alternative food communities. "}, {"course_id": "anth360", "reg_prereqs": [], "numCID": 360, "choice_prereqs": [], "course_info": "<p><b>ANTH 360 Anthropology of Popular Culture (5) I&amp;S</b><i> L. BILANIUK</i><br/>Analysis of the forces that shape popular culture. Examination of the local meanings of global trends in music, clothing, and leisure activities through case studies around the world. Students learn ethnographic methods and conduct an original research project.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH360\" target=\"_blank\">View course details in MyPlan: ANTH 360</a></p"}, {"course_id": "anth477", "reg_prereqs": [], "numCID": 477, "choice_prereqs": [], "course_info": "<p><b>ANTH 477 Medicine in America: Conflicts and Contradictions (3) I&amp;S</b><br/>Introduction to the pragmatic and theoretical dilemmas of current biomedical practice with emphasis on social and cultural context. Case studies in technological intervention, risk management, and other health-related issues used to explore connections among patients' experiences, medical practices, and the contemporary social context.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH477\" target=\"_blank\">View course details in MyPlan: ANTH 477</a></p"}, {"course_id": "anth476", "reg_prereqs": [], "numCID": 476, "choice_prereqs": [], "course_info": "<p><b>ANTH 476 Culture, Medicine, and the Body (5) I&amp;S</b><br/>Explores the relationship between the body and society, with emphasis on the role of medicine as a mediator between them. Case study material, primarily from contemporary bio-medicine, as well as critical, postmodern, and feminist approaches to the body introduced within a general comparative and anthropological framework.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH476\" target=\"_blank\">View course details in MyPlan: ANTH 476</a></p"}, {"course_id": "anth479", "reg_prereqs": [], "numCID": 479, "choice_prereqs": [], "course_info": "<p><b>ANTH 479 Advanced Topics in Medical Anthropology (3-5, max. 15)</b><i> R. CHAPMAN, L. RHODES, J. TAYLOR</i><br/>Explores theoretical and ethnographic advanced topics in medical anthropology.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH479\" target=\"_blank\">View course details in MyPlan: ANTH 479</a></p"}, {"course_id": "anth478", "reg_prereqs": [], "numCID": 478, "choice_prereqs": [], "course_info": "<p><b>ANTH 478 Introduction to the Anthropology of Institutions (5) I&amp;S</b><i> L. RHODES</i><br/>Historical, theoretical, and ethnographic perspectives on the study of total institutions, with an emphasis on prisons and psychiatric facilities. Includes issues of subjection and subjectivity, institutional social dynamics, and social justice concerns.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH478\" target=\"_blank\">View course details in MyPlan: ANTH 478</a></p"}, {"course_id": "anth369", "reg_prereqs": [], "numCID": 369, "choice_prereqs": [], "course_info": "<p><b>ANTH 369 Special Problems in Anthropology (3-5, max. 10) I&amp;S</b><br/>Delineation and analysis of a specific problem or related problems in sociocultural anthropology.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH369\" target=\"_blank\">View course details in MyPlan: ANTH 369</a></p"}, {"course_id": "anth368", "reg_prereqs": [], "numCID": 368, "choice_prereqs": [], "course_info": "<p><b>ANTH 368 Mythical Figures and Cultural Formations (3) I&amp;S</b><br/>Anthropological perspective on the social and cultural formation of a variety of mythical figures. Examines their emergence and historical specificity, cultural meaning, and social implications. Emphasizes narrative in considering how contemporary institutions and public perceptions of danger are shaped by notions of \"character\" and the \"monstrous.\"<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH368\" target=\"_blank\">View course details in MyPlan: ANTH 368</a></p"}, {"course_id": "anth208", "reg_prereqs": [], "numCID": 208, "choice_prereqs": [], "course_info": "<p><b>ANTH 208 The Culture Concept (5) I&amp;S</b><br/>History of the culture concept and its use in the field of cultural anthropology. History of its emergence in European colonial expansion and contemporary debates about its place as the central concept defining the field of anthropology.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH208\" target=\"_blank\">View course details in MyPlan: ANTH 208</a></p"}, {"course_id": "anth209", "reg_prereqs": [], "numCID": 209, "choice_prereqs": [], "course_info": "<p><b>ANTH 209 Anthropology through Visual Media (5) VLPA/I&amp;S</b><i> S. WELLAND</i><br/>Theories of culture and cultural variation, as seen and understood through visual media such as films, video, and photography.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH209\" target=\"_blank\">View course details in MyPlan: ANTH 209</a></p"}, {"course_id": "anth206", "reg_prereqs": [], "numCID": 206, "choice_prereqs": [], "course_info": "<p><b>ANTH 206 The Cultural Animal (5) I&amp;S/NW</b><br/>Examination of the interaction between biology and culture in shaping human social behavior. Basic principles of natural selection, gene-environment interaction, cultural transmission, learning, and cultural evolution; application of these to various topics, including gender, violence, politics, kinship, and religion.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH206\" target=\"_blank\">View course details in MyPlan: ANTH 206</a></p"}, {"course_id": "anth207", "reg_prereqs": [], "numCID": 207, "choice_prereqs": [], "course_info": "<p><b>ANTH 207 Class and Culture in America (5) I&amp;S, DIV</b><br/>Anthropological view of the contemporary United States with emphasis on social class. Through ethnographic readings examines education, work, political economy, working class experience and the ideology of the middle class, and relations between class and race, gender, ethnicity, language, place, sexuality, and culture.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH207\" target=\"_blank\">View course details in MyPlan: ANTH 207</a></p"}, {"course_id": "anth204", "reg_prereqs": [], "numCID": 204, "choice_prereqs": [], "course_info": "<p><b>ANTH 204 Reading Ethnography (5) I&amp;S</b><br/>Introduction to the descriptive and analytic literature of cultural anthropology. Extended examination of representative accounts of the lifeway of peoples from selected areas of the world with an emphasis on methods of observation and analysis.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH204\" target=\"_blank\">View course details in MyPlan: ANTH 204</a></p"}, {"course_id": "anth202", "reg_prereqs": [], "numCID": 202, "choice_prereqs": [], "course_info": "<p><b>ANTH 202 Principles of Sociocultural Anthropology (5) I&amp;S</b><br/>Comparison of life ways of various non-Western and Western peoples. Introduction to basic theories and methods used in the field.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH202\" target=\"_blank\">View course details in MyPlan: ANTH 202</a></p"}, {"course_id": "anth203", "reg_prereqs": [], "numCID": 203, "choice_prereqs": [], "course_info": "<p><b>ANTH 203 Introduction to Anthropological Linguistics (5) VLPA/I&amp;S</b><br/>Linguistic methods and theories used within anthropology. Basic structural features of language; human language and animal communication compared; evidence for the innate nature of language. Language and culture: linguistic relativism, ethnography of communication, sociolinguistics. Language and nationalism, language politics in the United States and elsewhere. "}, {"course_id": "anth374", "reg_prereqs": [], "numCID": 374, "choice_prereqs": [], "course_info": "<p><b>ANTH 374 Narrative, Literature, and Medical Anthropology (5) I&amp;S</b><i> J. TAYLOR</i><br/>Introduces anthropological perspectives on the workings of narrative in illness, healing, and medicine. Considers writings in medical anthropology alongside other genres of writing about similar topics. Readings include memoirs and fiction as well as scholarly articles.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH374\" target=\"_blank\">View course details in MyPlan: ANTH 374</a></p"}, {"course_id": "anth375", "reg_prereqs": [], "numCID": 375, "choice_prereqs": [], "course_info": "<p><b>ANTH 375 Comparative Systems of Healing (5) I&amp;S</b><br/>Introduction to the anthropological study of healing. Examines local approaches to healing, considering their similarities and differences, and addresses their place within global systems. Includes anthropological theories of healing.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH375\" target=\"_blank\">View course details in MyPlan: ANTH 375</a></p"}, {"course_id": "anth373", "reg_prereqs": [], "numCID": 373, "choice_prereqs": [], "course_info": "<p><b>ANTH 373 Labor, Identity, and Knowledge in Healthcare (5) I&amp;S</b><i> J. TAYLOR</i><br/>Presents anthropological perspectives on provision of healthcare as a complex social phenomena. Examines division of labor, and how social groups come to occupy particular positions. Considers how knowledge and skills are gained, how they are recognized and valued, and may become sources of identity. "}, {"course_id": "anth370", "reg_prereqs": [], "numCID": 370, "choice_prereqs": [], "course_info": "<p><b>ANTH 370 Han Chinese Society and Culture (5) I&amp;S</b><i> S. HARRELL</i><br/>Themes in the society and culture of the Han Chinese people. Concepts of self; personal interaction; family, gender, and marriage; communities and the state; religion and ritual; class, social categories, and social mobility; culturalism, nationalism, and patriotism. "}, {"course_id": "anth371", "reg_prereqs": [], "numCID": 371, "choice_prereqs": [], "course_info": "<p><b>ANTH 371 Anthropology of Development (5) I&amp;S</b><br/>Development refers to social, economic, cultural, political transformations viewed as progress. Studied from anthropological perspectives. Historical, social context for emergence of ideas of development. Role of development in promoting national cultures. Impact of development on individual citizenship, families, rural-urban relations, workers, business, environment. "}, {"course_id": "anth376", "reg_prereqs": [], "numCID": 376, "choice_prereqs": [], "course_info": "<p><b>ANTH 376 Anthropology of Disability (5) I&amp;S, DIV</b><br/>Introduces anthropological perspectives on disability. Considers disability as produced through the interaction of bodily impairments with social structures, political economies, cultural norms and values, individual and group identities, institutional orders, medical practices, assistive technologies, and other factors. Considers ethnographic studies of disability in international as well as U.S. settings.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH376\" target=\"_blank\">View course details in MyPlan: ANTH 376</a></p"}, {"course_id": "anth377", "reg_prereqs": [], "numCID": 377, "choice_prereqs": [], "course_info": "<p><b>ANTH 377 Anthropology and International Health (5) I&amp;S</b><br/>Explores international health from medical anthropological perspective, focusing on serious health problems facing resource-poor societies around the globe and in the United States. Develops awareness on political, socio-economic, ecological, and cultural complexity of most health problems and anthropology's consequent role in the field of international health.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH377\" target=\"_blank\">View course details in MyPlan: ANTH 377</a></p"}, {"course_id": "anth468", "reg_prereqs": [], "numCID": 468, "choice_prereqs": [], "course_info": "<p><b>ANTH 468 Anthropology of Care (5) I&amp;S</b><i> J. TAYLOR</i><br/>Introduces the anthropology of care, with an emphasis on ethnographic studies of care practices. Considers how care practices generate patterns of relationality and visions of the human. Explores where caring happens, who is involved in care, what counts (or does not count) as deserving of care, and how politics shapes care.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH468\" target=\"_blank\">View course details in MyPlan: ANTH 468</a></p"}, {"course_id": "anth469", "reg_prereqs": [], "numCID": 469, "choice_prereqs": [], "course_info": "<p><b>ANTH 469 Special Studies in Anthropology (3-5, max. 15) I&amp;S</b><br/>Delineation and analysis of a specific problem or related problems in anthropology. Offered occasionally by visitors or resident faculty.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH469\" target=\"_blank\">View course details in MyPlan: ANTH 469</a></p"}, {"course_id": "anth466", "reg_prereqs": [], "numCID": 466, "choice_prereqs": [], "course_info": "<p><b>ANTH 466 Anthropology Honors Thesis ([1-9]-, max. 18) I&amp;S</b><br/>Individual research under the direction of a thesis adviser, culminating in a senior honors thesis. Open only to upper-class students in departmental honors program.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH466\" target=\"_blank\">View course details in MyPlan: ANTH 466</a></p"}, {"course_id": "anth467", "reg_prereqs": [], "numCID": 467, "choice_prereqs": [], "course_info": "<p><b>ANTH 467 Anthropology of Education (5) I&amp;S, DIV</b><br/>Uses a wide range of social theory and philosophy to investigate mechanisms which reproduce inequality and asymmetry in American education.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH467\" target=\"_blank\">View course details in MyPlan: ANTH 467</a></p"}, {"course_id": "anth464", "reg_prereqs": [], "numCID": 464, "choice_prereqs": [["ling200", "ling201", "h/ling203", "ling400"]], "course_info": "<p><b>ANTH 464 Language Politics and Cultural Identity (3) VLPA/I&amp;S</b><i> L. BILANIUK</i><br/>Theories and case studies of the power of language and how it is manipulated. Multilingualism, diglossia. Role of language and linguistics in nationalism. Standardization, educational policy, language and ethnicity. World languages, language death and revival. "}, {"course_id": "anth465", "reg_prereqs": [], "numCID": 465, "choice_prereqs": [], "course_info": "<p><b>ANTH 465 Critical Anthropology of Mass Culture (5) I&amp;S</b><br/>Critical overview of theories of mass culture and their relationship to current anthropological practice. Analyses of the historical interconnections among capitalism and commodity fetishism, modernity and representation, and media and consumption.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH465\" target=\"_blank\">View course details in MyPlan: ANTH 465</a></p"}, {"course_id": "anth378", "reg_prereqs": [], "numCID": 378, "choice_prereqs": [], "course_info": "<p><b>ANTH 378 Sustainability, Resilience, and Society (5)</b><i> S. HARRELL</i><br/>Introduction to concepts of sustainability and resilience and their relevance to environment and society in the current Anthropocene era. Understanding sustainability and resilience through ecological footprints, lessons from small-scale societies, case studies of resource management, theory of common property regimes, philosophies of environmental stewardship, and implications of climate change.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH378\" target=\"_blank\">View course details in MyPlan: ANTH 378</a></p"}, {"course_id": "anth460", "reg_prereqs": [], "numCID": 460, "choice_prereqs": [], "course_info": "<p><b>ANTH 460 History of Anthropology (5) I&amp;S</b><br/>Sources and development of leading concepts, issues, and approaches in anthropology. Findings of anthropology in relation to scientific and humanistic implications and to practical application. Main contributors to field; their work and influence. Past, present, and future perspectives, including anthropology of modern life.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH460\" target=\"_blank\">View course details in MyPlan: ANTH 460</a></p"}, {"course_id": "anth461", "reg_prereqs": [], "numCID": 461, "choice_prereqs": [], "course_info": "<p><b>ANTH 461 Historical Ecology (5) I&amp;S/NW</b><i> J. FITZHUGH, S. HARRELL</i><br/>Explores a global range of case studies in the historical dimension of the environment, human adaptation, and cultural change. Investigates the co-evolution of environment and culture in archaeological and historical contexts. Develops a better understanding of modern human-environmental dynamics as historically situated. In<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH461\" target=\"_blank\">View course details in MyPlan: ANTH 461</a></p"}, {"course_id": "anth463", "reg_prereqs": [], "numCID": 463, "choice_prereqs": [], "course_info": "<p><b>ANTH 463 Critiques of Contemporary Capitalism (5) I&amp;S</b><br/>Karl Marx inaugurated radical reworkings of both social theory and political action. Begins with some of his seminal writings, then considers the Frankfurt School, British labor theory, and postcolonial theory. Uses these readings to understand economy and subjectivity produced through the aporias of late capitalism. .<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH463\" target=\"_blank\">View course details in MyPlan: ANTH 463</a></p"}, {"course_id": "anth419", "reg_prereqs": [], "numCID": 419, "choice_prereqs": [], "course_info": "<p><b>ANTH 419 Collective Memory and Violence (5) I&amp;S</b><br/>Present perspectives on cultural aspects of collective memory and relationship to violence. Explores how memories shape meaning of identity and community and influence contemporary conflict. Considers representations of the past in relation to collective violence, suffering, and trauma, including genocide. Considers relationship between memory and potential for justice and peace.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH419\" target=\"_blank\">View course details in MyPlan: ANTH 419</a></p"}, {"course_id": "anth418", "reg_prereqs": [], "numCID": 418, "choice_prereqs": [["ling203"]], "course_info": "<p><b>ANTH 418 Indian Heritage of Mexico and Central America (5) I&amp;S, DIV</b><br/>Indian civilizations of Mexico and Guatemala, their origins and ecological foundations. Contemporary communities of Mexico and Guatemala, focusing on creative adaptation of pre-Columbian traditions to modern national realities. "}, {"course_id": "anth413", "reg_prereqs": [], "numCID": 413, "choice_prereqs": [], "course_info": "<p><b>ANTH 413 Anthropology of the Modern Middle East and North Africa (5) I&amp;S</b><br/>Presents an anthropological perspective on social/cultural aspects of contemporary Middle East and North Africa. Explores how anthropologists examine key issues in region including identity, politics, economics, religion, and conflict. Considers how ethnographic representations challenge assumptions about people's politics of region and elucidate contemporary manifestations of local, national, regional, and global power.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH413\" target=\"_blank\">View course details in MyPlan: ANTH 413</a></p"}, {"course_id": "anth412", "reg_prereqs": [], "numCID": 412, "choice_prereqs": [], "course_info": "<p><b>ANTH 412 South Asian Social Structure (5) I&amp;S, DIV</b><br/>Examines caste, class, and community in modern India. Transitions from colonial typology to analysis of social change, diversity, stability, and caste hierarchy in rural society. Current debates on class and community in Indian society, rural and urban, explored through themes of identity, structure, and mobility. "}, {"course_id": "anth411", "reg_prereqs": [], "numCID": 411, "choice_prereqs": [], "course_info": "<p><b>ANTH 411 The Culture and Politics of Food: Study Abroad in Italy (8-12) I&amp;S</b><br/>Study Abroad program at the UW Rome Center focusing on the organization, politics, economy, and culture of the local food system at increasing scales of analysis: the city of Rome, the region of Lazio, the nation of Italy, the European Union, and the world.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH411\" target=\"_blank\">View course details in MyPlan: ANTH 411</a></p"}, {"course_id": "anth410", "reg_prereqs": [], "numCID": 410, "choice_prereqs": [], "course_info": "<p><b>ANTH 410 Growing Stuff: Ecology, Economy, and Culture of Resource-Production Ecosystems (5) I&amp;S</b><i> S. HARRELL</i><br/>Examines the connections between ecological, economic, and cultural aspects of local ecosystems that produce natural resources, through three case studies involving reading, writing, class discussion, and three required Saturday or weekend field trips. Case studies may include forest products, seafood, dairy products, biofuels, orchard crops, or others. "}, {"course_id": "anth416", "reg_prereqs": [], "numCID": 416, "choice_prereqs": [], "course_info": "<p><b>ANTH 416 Comparative Social Movements: Mexico and the United States (5) I&amp;S, DIV</b><i> D. PENA</i><br/>Historical, ethnographic, and theoretical perspectives in the study of Mexican-origin communities in social movements in Mexico and the United States with a focus on workers, immigrants, peasants, women, indigenous peoples, and students as forces of collective mobilization and social, cultural, and political change. "}, {"course_id": "anth380", "reg_prereqs": [], "numCID": 380, "choice_prereqs": [], "course_info": "<p><b>ANTH 380 Subject, Person, Place: Introduction to Social Theory (3) I&amp;S</b><br/>Introduces contemporary critical thinkers in anthropology. Includes works on governmentality and discipline; politics and bare life; race and recognition; gender and embodiment; and capitalism and subjectivity. Develops an understanding of how contemporary theory frames anthropology and skills in critical spoken and written analysis.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH380\" target=\"_blank\">View course details in MyPlan: ANTH 380</a></p"}, {"course_id": "anth307", "reg_prereqs": [], "numCID": 307, "choice_prereqs": [], "course_info": "<p><b>ANTH 307 U.S. Pacific Islander Contemporary Culture (5) I&amp;S, DIV</b><br/>Examines United States Pacific Islander culture as informed by Pacific history, social and cultural organization. Emphasis on understanding contemporary experience in the United States and other diaspora communities. Major themes include post-colonialism, migration, family, religion, politics, gender, education, and transnational identify. "}, {"course_id": "anth269", "reg_prereqs": [], "numCID": 269, "choice_prereqs": [], "course_info": "<p><b>ANTH 269 Special Topics in Anthropology (3-5, max. 10) I&amp;S</b><br/>Delineation and analysis of a specific problem or related problems in anthropology.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH269\" target=\"_blank\">View course details in MyPlan: ANTH 269</a></p"}, {"course_id": "anth305", "reg_prereqs": [], "numCID": 305, "choice_prereqs": [], "course_info": "<p><b>ANTH 305 Anthropology of the Body (5) I&amp;S</b><br/>Surveys classic anthropological literature examining the relationship between culture and the body. Examines Euroamerican body culture historically. Explores how the body is represented in mass media and the effects this has on everyday body ideologies.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH305\" target=\"_blank\">View course details in MyPlan: ANTH 305</a></p"}, {"course_id": "anth301", "reg_prereqs": [], "numCID": 301, "choice_prereqs": [], "course_info": "<p><b>ANTH 301 Human Nature and Culture (3) I&amp;S</b><br/>Comparison of various anthropological perspectives on the sources of variation in customs, values, and beliefs of human groups, including non-Western peoples and contemporary Americans.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH301\" target=\"_blank\">View course details in MyPlan: ANTH 301</a></p"}, {"course_id": "anth308", "reg_prereqs": [], "numCID": 308, "choice_prereqs": [], "course_info": "<p><b>ANTH 308 The Anthropology of Gender, Women's Health, and Reproduction (5) I&amp;S, DIV</b><br/>Examines anthropological approaches to improving women's health by surveying women's health history, status, and participation in healthcare. Analyzes a range of health issues, including reproductive healthcare problems, women's body images and sexuality, current health policies, as related to daily structures and relationships of gender, race/ethnicity, class.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH308\" target=\"_blank\">View course details in MyPlan: ANTH 308</a></p"}, {"course_id": "anth475", "reg_prereqs": [], "numCID": 475, "choice_prereqs": [], "course_info": "<p><b>ANTH 475 Perspectives in Medical Anthropology (5) I&amp;S</b><i> J. TAYLOR</i><br/>Introduction to medical anthropology. Explores the relationships among culture, society, and medicine. Examples from Western medicine as well as from other medical systems, incorporating both interpretive and critical approaches. "}, {"course_id": "anth474", "reg_prereqs": [], "numCID": 474, "choice_prereqs": [], "course_info": "<p><b>ANTH 474 Social Difference and Medical Knowledge (5) I&amp;S, DIV</b><i> J. TAYLOR</i><br/>Explores relations between medical and social categories: how social differences become medicalized; how medical conditions become associated with stigmatized social groups; and how categories become sources of identity and bases for political action. Considers classifications (race, gender, sexuality, disability) and how each has shaped and/or been shaped by medical science/practice.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/ANTH474\" target=\"_blank\">View course details in MyPlan: ANTH 474</a></p"}], "links": []}