{"nodes": [{"course_info": "<p><b>ANTH 484 Ideologies and Technologies of Motherhood (5) I&amp;S, DIV</b><br/>Examines how motherhood is culturally constituted, regulated, and managed within various ideological and technological milieus. Uses ethnographies from anthropology and case studies from feminist legal theory. Topics include slave mothers, surrogate mothers, lesbian mothers, transracial mothers, co-mothers, teen mothers. ", "course_name": "ANTH 484", "choice_prereqs": [], "course_id": "anth484", "numCID": 484, "reg_prereqs": ["gwss200"], "is_prereq_for": []}, {"course_info": "<p><b>ANTH 421 Belief, Ritual, and the Structure of Religion (5) I&amp;S</b><br/>Systematic survey of concepts, models, and theories that characterize the anthropological study of religion. Consideration of the human universal basis of religion and of diverse ways in which religions are constructed and related to social experience. ", "course_name": "ANTH 421", "choice_prereqs": [["anth321", "sc201"]], "course_id": "anth421", "numCID": 421, "reg_prereqs": ["sc202"], "is_prereq_for": []}, {"course_info": "<p><b>ANTH 450 Language and Gender (5) VLPA/I&amp;S, DIV</b><i> L. BILANIUK</i><br/>Survey of the theoretical trends, methods, and research findings on the relationship between language and gender. Focus on power relations in gendered language use. Extensive study of research based on conversational analysis. ", "course_name": "ANTH 450", "choice_prereqs": [["ling201", "ling203", "anth203"]], "course_id": "anth450", "numCID": 450, "reg_prereqs": ["ling200"], "is_prereq_for": []}, {"course_info": "<p><b>ANTH 470 Minority Peoples of China (5) I&amp;S</b><i> S. HARRELL</i><br/>Interaction between China and the peoples of its periphery, including inner Asia, Tibet, northern mainland Southeast Asia, and aboriginal peoples of Taiwan. Emphasis on ethnicity, ethnic group consciousness, and role of the Chinese state. ", "course_name": "ANTH 470", "choice_prereqs": [["anth370", "sa370", "hstas454"]], "course_id": "anth470", "numCID": 470, "reg_prereqs": ["ling203"], "is_prereq_for": []}], "links": []}