{"nodes": [{"course_id": "cfrm461", "reg_prereqs": [], "numCID": 461, "choice_prereqs": [], "course_info": "<p><b>CFRM 461 Probability and Statistics for Computational Finance (3)</b><br/>Covers basic concepts and methods of probability and statistical analysis and modeling for computational and quantitative finance. Coverage is carefully aligned with leading problems concerning prices and returns of individual assets and portfolios of assets. Key applications include financial risk management and portfolio performance analysis.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/CFRM461\" target=\"_blank\">View course details in MyPlan: CFRM 461</a></p"}, {"course_id": "cfrm460", "reg_prereqs": [], "numCID": 460, "choice_prereqs": [], "course_info": "<p><b>CFRM 460 Mathematical Methods for Quantitative Finance (3) NW, QSR</b><br/>Covers selected mathematical methods needed to begin a master's program in quantitative finance. Topics include applications of calculus, linear algebra, and constrained optimization methods to fixed income, portfolio optimization, futures, options, and risk management.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/CFRM460\" target=\"_blank\">View course details in MyPlan: CFRM 460</a></p"}, {"course_id": "cfrm463", "reg_prereqs": [], "numCID": 463, "choice_prereqs": [], "course_info": "<p><b>CFRM 463 R Programming for Quantitative Finance (1)</b><br/>Introduction to R Programming language for applications in quantitative finance. Intended for students with no prior exposure to R and prepares them with the computing skills needed to progress effectively in an MS degree program in computational finance.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/CFRM463\" target=\"_blank\">View course details in MyPlan: CFRM 463</a></p"}, {"course_id": "cfrm462", "reg_prereqs": [], "numCID": 462, "choice_prereqs": [], "course_info": "<p><b>CFRM 462 Introduction to Computational Finance and Financial Econometrics (5)</b><i> Zivot</i><br/>Covers probability models, data analysis, quantitative, and statistical methods using applications in finance, and introduction to and use of the R programming system for data analysis and statistical modeling. Offered: AS.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/CFRM462\" target=\"_blank\">View course details in MyPlan: CFRM 462</a></p"}], "links": []}