{"nodes": [{"course_id": "chem223", "reg_prereqs": [], "numCID": 223, "choice_prereqs": [["chem152", "chem155"]], "course_info": "<p><b>CHEM 223 Organic Chemistry - Short Program (4) NW</b><br/>First of a two-quarter lecture series in organic chemistry, for those who elect not to complete the CHEM 237, CHEM 238, CHEM 239 sequence. Introduction to structure, nomenclature, properties, and reactions of the main functional families of organic compounds. Stereochemistry and spectroscopy. No more than 5 credits can be counted toward graduation from the following course group: CHEM 221, CHEM 223, CHEM 237, CHEM 335. "}, {"course_id": "chem220", "reg_prereqs": [], "numCID": 220, "choice_prereqs": [["chem120", "chem142"]], "course_info": "<p><b>CHEM 220 Principles of Chemistry II (5) NW</b><br/>Second course in a three-quarter overview of general chemistry, organic chemistry, and biochemistry. Not for students majoring in biochemistry, chemistry, or engineering. Introduction to organic chemistry including organic compounds, , functional groups, aromaticity, and stereochemistry. "}, {"course_id": "chem221", "reg_prereqs": ["chem220"], "numCID": 221, "choice_prereqs": [], "course_info": "<p><b>CHEM 221 Principles of Chemistry III (5) NW</b><br/>Third course in a three-quarter overview of general chemistry, organic chemistry, and biochemistry. Not for students majoring in biochemistry, chemistry, or engineering. Introduction to biochemistry including biomolecular structure, proteins, nucleic acids, biochemical cycles, and cellular energetics. Only 5 credits can be counted toward graduation from the following: CHEM 221, CHEM 223, CHEM 237, CHEM 335. "}, {"course_id": "chem224", "reg_prereqs": ["chem223"], "numCID": 224, "choice_prereqs": [], "course_info": "<p><b>CHEM 224 Organic Chemistry - Short Program (4) NW</b><br/>Continuation of CHEM 223. Structure, nomenclature, properties, and reactions of aldehydes, ketones, carboxylic acid derivatives, amines, carbohydrates, lipids, amino acids, peptides, proteins, and nucleic acids. No laboratory accompanies this course, but CHEM 241 laboratory may be taken concurrently. No more than 4 credits can be counted toward graduation from the following course group: CHEM 224, CHEM 239, CHEM 337. "}, {"course_id": "chem120", "reg_prereqs": [], "numCID": 120, "choice_prereqs": [], "course_info": "<p><b>CHEM 120 Principles of Chemistry I (5) NW, QSR</b><br/>First course in a three-quarter overview of general chemistry, organic chemistry, and biochemistry. Not for students majoring in biochemistry, chemistry, or engineering. Includes matter and energy, chemical nomenclature, chemical reactions, stoichiometry, modern atomic theory, chemical bonding. Laboratory. Only 5 credits can be counted toward graduation from the following: CHEM 120, CHEM 142, CHEM 145. Offered: AS.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/CHEM120\" target=\"_blank\">View course details in MyPlan: CHEM 120</a></p"}, {"course_id": "chem475", "reg_prereqs": [], "numCID": 475, "choice_prereqs": [["chem155", "chem162"], ["math126", "math136"], ["phys116", "phys123"]], "course_info": "<p><b>CHEM 475 Honors Physical Chemistry (3) NW</b><br/>Introduction to quantum chemistry, spectroscopy. Theory of quantum mechanics applied more rigorously than in CHEM 455. Application of quantum mechanics to electronic structure of atoms and molecules. Computer software used to solve problems. "}, {"course_id": "chem455", "reg_prereqs": [], "numCID": 455, "choice_prereqs": [["chem155", "chem162"], ["math126", "math136"], ["phys116", "phys123"]], "course_info": "<p><b>CHEM 455 Physical Chemistry (3) NW</b><br/>Introduction to quantum chemistry and spectroscopy. Theory of quantum mechanics presented at an elementary level and applied to the electronic structure of atoms and molecules and to molecular spectra. "}, {"course_id": "chem239", "reg_prereqs": [], "numCID": 239, "choice_prereqs": [["chem238", "chem336"]], "course_info": "<p><b>CHEM 239 Organic Chemistry (3) NW</b><br/>Third course for students planning to take three quarters of organic chemistry. Polyfunctional compounds and natural products, lipids, carbohydrates, amino acids, proteins, and nucleic acids. Includes introduction to membranes, enzyme mechanisms, prosthetic groups, macromolecular conformations and supramolecular architecture. No more than 4 credits can be counted toward graduation from the following course groups: CHEM 224, CHEM 239, CHEM 337. "}, {"course_id": "chem457", "reg_prereqs": [], "numCID": 457, "choice_prereqs": [["chem455", "chem475"], ["chem456", "me326"]], "course_info": "<p><b>CHEM 457 Physical Chemistry (3) NW</b><br/>Introduction to statistical mechanics, kinetic theory, and chemical kinetics. "}, {"course_id": "chem416", "reg_prereqs": [], "numCID": 416, "choice_prereqs": [["chem165", "chem312"], ["chem453", "chem455", "chem475"]], "course_info": "<p><b>CHEM 416 Transition Metals (3) NW</b><br/>Survey of selected key topics in the chemistry of the transition metals, including emphasis on the structure, bonding, and reactivity of major classes of compounds. "}, {"course_id": "chem241", "reg_prereqs": [], "numCID": 241, "choice_prereqs": [["chem223", "chem237", "chem335"], ["chem224", "chem238", "chem336"]], "course_info": "<p><b>CHEM 241 Organic Chemistry Laboratory (3) NW</b><br/>Introduction to organic laboratory techniques. Preparation of representative compounds. Designed to be taken with CHEM 224 or CHEM 238. No more than the number of credits indicated can be counted toward graduation from the following course group: CHEM 241, CHEM 346 (3 credits). "}, {"course_id": "chem242", "reg_prereqs": [], "numCID": 242, "choice_prereqs": [["chem241", "chem346"], ["chem224", "chem238", "chem336"], ["chem224", "chem239", "chem337"]], "course_info": "<p><b>CHEM 242 Organic Chemistry Laboratory (3) NW</b><br/>Preparations and qualitative organic analysis. Designed to be taken with 239. No more than the number of credits indicated can be counted toward graduation from the following course group: CHEM 242, CHEM 347 (3 credits). "}, {"course_id": "chem452", "reg_prereqs": [], "numCID": 452, "choice_prereqs": [["chem155", "chem162"], ["math125", "math134"], ["phys115", "phys122"]], "course_info": "<p><b>CHEM 452 Physical Chemistry for Biochemists I (3) NW</b><br/>General equilibrium thermodynamics emphasizing biochemical applications: ligand binding, biological oxidation-reduction reactions, membranes, active transport, colligative properties, and surface tension. No more than the number of credits indicated can be counted toward graduation from the following: 452, 456 (3 credits). "}, {"course_id": "chem419", "reg_prereqs": ["chem416"], "numCID": 419, "choice_prereqs": [["chem224", "chem239", "chem337"]], "course_info": "<p><b>CHEM 419 Bioinorganic Chemistry (3) NW</b><br/>Description of transition metal-containing systems found in biology. Structural and electronic properties and reactivity of metalloproteins, metalloenzymes, and metallocofactors. Methods used to probe and model metal sites by spectroscopic and synthetic techniques. "}, {"course_id": "chem418", "reg_prereqs": [], "numCID": 418, "choice_prereqs": [["chem453", "chem455", "chem475"]], "course_info": "<p><b>CHEM 418 Nuclear Chemistry (3) NW</b><br/>Natural radioactivity, nuclear systematics and reactions, radioactive decay processes, stellar nucleosynthesis, applications of radioactivity. "}, {"course_id": "chem145", "reg_prereqs": [], "numCID": 145, "choice_prereqs": [["math124", "math134"], []], "course_info": "<p><b>CHEM 145 Honors General Chemistry (5) NW, QSR</b><br/>CHEM 145 and CHEM 155 cover material in CHEM 142, CHEM 152, and CHEM 162. Includes laboratory. No more than the number of credits indicated can be counted toward graduation from the following course groups: CHEM 142, CHEM145 (5 credits); CHEM 145, CHEM 155, CHEM 162 (10 credits). "}, {"course_id": "chem162", "reg_prereqs": ["chem152"], "numCID": 162, "choice_prereqs": [], "course_info": "<p><b>CHEM 162 General Chemistry (5) NW, QSR</b><br/>Molecular bonding theories, liquids, solids, solutions, and introduction to organic and transition metal chemistry. Includes laboratory. No more than 5 credits can be counted toward graduate from the following course group: CHEM 162, CHEM 165. "}, {"course_id": "chem165", "reg_prereqs": ["chem155"], "numCID": 165, "choice_prereqs": [], "course_info": "<p><b>CHEM 165 Honors General Chemistry (5) NW, QSR</b><br/>Introduction to systematic inorganic chemistry: representative elements, metals, and nonmetals. Includes coordination complexes, geochemistry, and metallurgy. Additional material on environmental applications of basic chemistry presented. Includes laboratory. No more than the number of credits indicated can be counted toward graduation from the following course groups: CHEM 162, CHEM 165 (5 credits); CHEM 165, CHEM 312 (5 credits). "}, {"course_id": "chem142", "reg_prereqs": [], "numCID": 142, "choice_prereqs": [], "course_info": "<p><b>CHEM 142 General Chemistry (5) NW, QSR</b><br/>For science and engineering majors. Atomic nature of matter, quantum mechanics, ionic and covalent bonding, molecular geometry, stoichiometry, solution stoichiometry, kinetics, and gas laws. Includes laboratory. Cannot be taken for credit if CHEM 120 already taken. Recommended: high school chemistry; placement into MATH 120 or higher. Offered: AWSpS.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/CHEM142\" target=\"_blank\">View course details in MyPlan: CHEM 142</a></p"}, {"course_id": "chem410", "reg_prereqs": ["chem418"], "numCID": 410, "choice_prereqs": [], "course_info": "<p><b>CHEM 410 Radiochemistry Laboratory (2) NW</b><br/>Introductory general service course for students planning further work in nuclear or tracer applications. Safety procedures, detection and measurement of nuclear radiation, radiochemical and tracer techniques. "}, {"course_id": "chem434", "reg_prereqs": [], "numCID": 434, "choice_prereqs": [["chem239", "chem337"]], "course_info": "<p><b>CHEM 434 Polymer Chemistry (3)</b><br/>Focuses on fundamental and applied aspects of polymer synthesis including classic methods and mechanisms for macromolecular synthesis and contemporary breakthroughs in the field. "}, {"course_id": "chem432", "reg_prereqs": ["chem239", "chem347"], "numCID": 432, "choice_prereqs": [["chem242", "chem337"]], "course_info": "<p><b>CHEM 432 Advanced Bio-Organic Chemistry (3) NW</b><br/>Chemical biology. Application of chemical methods to the study of biological processes that occur in cells. "}, {"course_id": "chem417", "reg_prereqs": ["chem416"], "numCID": 417, "choice_prereqs": [["chem224", "chem239", "chem337"]], "course_info": "<p><b>CHEM 417 Organometallic Chemistry (3) NW</b><br/>Chemistry of the metal-carbon bond for both main group and transition metals. Structure and reactivity with applications to organic synthesis and catalysis. "}, {"course_id": "chem430", "reg_prereqs": [], "numCID": 430, "choice_prereqs": [["chem239", "chem337"]], "course_info": "<p><b>CHEM 430 Advanced Physical Organic Chemistry (3) NW</b><br/>Fundamental aspects of organic structures and transformations. Structure and basicity of carbanions, substitution reactions, elimination reactions, nucleophilic addition and addition/elimination reactions, condensation reactions, structure and rearrangements of carbocation's, electrophilic addition, electrophilic substitutions, and neighboring group efforts. "}, {"course_id": "chem491", "reg_prereqs": [], "numCID": 491, "choice_prereqs": [], "course_info": "<p><b>CHEM 491 Study Abroad - Advanced Chemistry (1-15, max. 15) NW</b><br/>For students in the UW study abroad program. Content varies and is individually evaluated. Credit does not apply to major degree requirements without departmental approval.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/CHEM491\" target=\"_blank\">View course details in MyPlan: CHEM 491</a></p"}, {"course_id": "chem321", "reg_prereqs": [], "numCID": 321, "choice_prereqs": [["chem155", "chem162", "chem164"]], "course_info": "<p><b>CHEM 321 Quantitative Analysis (5) NW</b><br/>Introduction to chemical analysis, including gravimetric, volumetric, spectrophotometric, and potentiometric analyses. Laboratory computer use included. "}, {"course_id": "chem499", "reg_prereqs": [], "numCID": 499, "choice_prereqs": [], "course_info": "<p><b>CHEM 499 Undergraduate Research and Report Writing (*, max. 12)</b><br/>Research in chemistry and/or study in the chemical literature. Credit/no-credit only. Offered: AWSpS.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/CHEM499\" target=\"_blank\">View course details in MyPlan: CHEM 499</a></p"}, {"course_id": "chem347", "reg_prereqs": ["chem336", "chem346", "chem337"], "numCID": 347, "choice_prereqs": [], "course_info": "<p><b>CHEM 347 Organic and Qualitative Organic Honors Laboratory (3) NW</b><br/>Continuation of CHEM 346. To accompany CHEM 337. No more than the number of credits indicated can be counted toward graduation from the following course group: CHEM 242, CHEM 347 (3 credits). "}, {"course_id": "chem190", "reg_prereqs": [], "numCID": 190, "choice_prereqs": [], "course_info": "<p><b>CHEM 190 Freshman Discovery Seminar in Chemistry (5) NW</b><br/>Introduces incoming freshman to research basics and scholarly inquiry skills used in the study of chemistry.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/CHEM190\" target=\"_blank\">View course details in MyPlan: CHEM 190</a></p"}, {"course_id": "chem317", "reg_prereqs": [], "numCID": 317, "choice_prereqs": [["chem165", "chem312"], ["chem242", "chem347"]], "course_info": "<p><b>CHEM 317 Inorganic Chemistry Laboratory (4) NW</b><br/>Experimental exploration of the periodic table. Techniques of preparation and characterization of inorganic compounds. Handling of air-sensitive materials and gases. "}, {"course_id": "chem346", "reg_prereqs": ["chem335", "chem336"], "numCID": 346, "choice_prereqs": [], "course_info": "<p><b>CHEM 346 Organic Chemistry Honors Laboratory (3) NW</b><br/>To accompany CHEM 336. No more than the number of credits indicated can be counted toward graduation from the following course group: CHEM 241, CHEM 346 (3 credits). "}, {"course_id": "chem312", "reg_prereqs": [], "numCID": 312, "choice_prereqs": [["chem155", "chem162"], ["chem224", "chem238", "chem336"]], "course_info": "<p><b>CHEM 312 Inorganic Chemistry (3) NW</b><br/>The periodic table: chemistry of representative and transition elements. Aqueous chemistry, solid state chemistry, and everyday aspects of inorganic chemistry emphasized. Not intended for students who have completed CHEM 165. No more than the number of credits indicated can be counted toward graduation from the following course group: CHEM 165, CHEM 312 (5 credits). "}, {"course_id": "chem238", "reg_prereqs": [], "numCID": 238, "choice_prereqs": [["chem237", "chem335"]], "course_info": "<p><b>CHEM 238 Organic Chemistry (4) NW</b><br/>Second course for students planning to take three quarters of organic chemistry. Further discussion of physical properties and transformations of organic molecules, especially aromatic and carbonyl compounds. No more than the number of credits indicated can be counted toward graduation from the following course groups: CHEM 238, CHEM 336 (4 credits). "}, {"course_id": "chem198", "reg_prereqs": [], "numCID": 198, "choice_prereqs": [], "course_info": "<p><b>CHEM 198 Tutorial Study (2, max. 6) NW</b><br/>Credit/no-credit only.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/CHEM198\" target=\"_blank\">View course details in MyPlan: CHEM 198</a></p"}, {"course_id": "chem199", "reg_prereqs": [], "numCID": 199, "choice_prereqs": [], "course_info": "<p><b>CHEM 199 Special Problems (1-6, max. 6)</b><br/>Research in chemistry. Credit/no-credit only. Offered: AWSpS.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/CHEM199\" target=\"_blank\">View course details in MyPlan: CHEM 199</a></p"}, {"course_id": "chem237", "reg_prereqs": [], "numCID": 237, "choice_prereqs": [["chem155", "chem162"]], "course_info": "<p><b>CHEM 237 Organic Chemistry (4) NW</b><br/>First course for students planning to take three quarters of organic chemistry. Structure, nomenclature, reactions, and synthesis of the main types of organic compounds. No organic laboratory accompanies this course. No more than 5 credits can be counted toward graduation from the following course groups: CHEM 221, CHEM 223, CHEM 237, CHEM 335. "}, {"course_id": "chem453", "reg_prereqs": [], "numCID": 453, "choice_prereqs": [["chem452", "chem456"], ["math126", "math135"], ["phys116", "phys123"]], "course_info": "<p><b>CHEM 453 Physical Chemistry for Biochemists II (3) NW</b><br/>Continuation of CHEM 452. Includes transport properties, enzyme kinetics, introduction to quantum mechanics, spectroscopy, and classical statistical mechanics. "}, {"course_id": "chem460", "reg_prereqs": [], "numCID": 460, "choice_prereqs": [["chem224", "chem239", "chem337"]], "course_info": "<p><b>CHEM 460 Spectroscopic Molecular Identification (3) NW</b><br/>Basic theory of spectral techniques - infrared and ultraviolet/visible spectroscopy, NMR, and mass spectrometry - with emphasis on spectral interpretation skills needed for the elucidation of structure, conformation, and dynamics in organic and biological chemistry. "}, {"course_id": "chem461", "reg_prereqs": [], "numCID": 461, "choice_prereqs": [["chem453", "chem455", "chem456", "chem456", "chem475"]], "course_info": "<p><b>CHEM 461 Physical Chemistry Laboratory (3) NW</b><br/>Physical measurements in chemistry. Vacuum techniques, calorimetry, spectroscopic methods, electrical measurements. "}, {"course_id": "chem431", "reg_prereqs": ["chem430"], "numCID": 431, "choice_prereqs": [], "course_info": "<p><b>CHEM 431 Advanced Synthetic Organic Chemistry (3) NW</b><br/>Synthetic organic chemistry. Discussion of practical methods for the synthesis of complex organic molecules with an emphasis on strategy and the control of stereochemistry. "}, {"course_id": "chem463", "reg_prereqs": ["chem460"], "numCID": 463, "choice_prereqs": [], "course_info": "<p><b>CHEM 463 Spectroscopic Techniques for Structural Identification (2) NW</b><br/>Laboratory techniques of spectroscopic analysis for structural determination using UV, IR, NMR, mass spectroscopy. "}, {"course_id": "chem464", "reg_prereqs": [], "numCID": 464, "choice_prereqs": [["chem453", "chem455", "chem475"], ["math136", "math307", "math308"]], "course_info": "<p><b>CHEM 464 Computers in Data Acquisition and Analysis (3) NW</b><br/>Introduction to use of the computer in the chemistry laboratory. Principles of microcomputers and their use for such problems as data acquisition, noise reduction, and instrument control. "}, {"course_id": "chem465", "reg_prereqs": [], "numCID": 465, "choice_prereqs": [["chem455", "chem475"]], "course_info": "<p><b>CHEM 465 Computations in Chemistry (3) NW</b><br/>Computer calculations on color graphics workstations applied to problems in chemistry. Numerical methods and algorithms for calculating classical dynamics, quantum wavefunctions, wavepacket propagation, chemical kinetics. Use of computer programs for calculating electronic wavefunctions, molecular conformations, simulations of liquids and solids. "}, {"course_id": "chem335", "reg_prereqs": [], "numCID": 335, "choice_prereqs": [["chem155", "chem162"]], "course_info": "<p><b>CHEM 335 Honors Organic Chemistry (4) NW</b><br/>For chemistry majors and otherwise qualified students planning three or more quarters of organic chemistry. Structure, nomenclature, reactions, and synthesis of organic compounds. Theory and mechanism of organic reactions. Studies of biomolecules. No organic laboratory accompanies this course. No more than 5 credits can be counted toward graduation from the following course group: CHEM 221, CHEM 223, CHEM 237, CHEM 335. "}, {"course_id": "chem336", "reg_prereqs": ["chem335"], "numCID": 336, "choice_prereqs": [], "course_info": "<p><b>CHEM 336 Honors Organic Chemistry (4) NW</b><br/>For chemistry majors and otherwise qualified students planning three or more quarters of organic chemistry. Structure, nomenclature, reactions, and synthesis of organic compounds. Theory and mechanism of organic reactions. Studies of biomolecules. No more than 4 credits can be counted toward graduation from the following course groups: CHEM 238, CHEM 336. "}, {"course_id": "chem337", "reg_prereqs": ["chem336"], "numCID": 337, "choice_prereqs": [], "course_info": "<p><b>CHEM 337 Honors Organic Chemistry (4) NW</b><br/>Chemistry majors and other students planning three or more quarters of organic chemistry. Structure, nomenclature, reactions, and synthesis of organic compounds. Theory and mechanism of organic reactions. Biomolecules. Introduction to membranes, enzyme mechanisms, prosthetic groups, macromolecular conformations, and supramolecular architecture. No more than 4 credits can be counted toward graduation from the following courses: CHEM 239, CHEM 337. "}, {"course_id": "chem155", "reg_prereqs": ["chem145"], "numCID": 155, "choice_prereqs": [], "course_info": "<p><b>CHEM 155 Honors General Chemistry (5) NW, QSR</b><br/>Continuation of CHEM 145. Includes laboratory. Together CHEM 145 and CHEM 155 cover material in CHEM 142, CHEM 152, and CHEM 162. No more than the number of credits indicated can be counted toward graduation from the following course groups: CHEM 152 or CHEM 155 (5 credits); CHEM 145, CHEM 155, CHEM 162 (10 credits). "}, {"course_id": "chem299", "reg_prereqs": [], "numCID": 299, "choice_prereqs": [], "course_info": "<p><b>CHEM 299 Special Problems and Report Writing (1-6, max. 6)</b><br/>Research in chemistry and/or study in the chemical literature. Requires writing a scientific report. Credit/no-credit only. Offered: AWSpS.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/CHEM299\" target=\"_blank\">View course details in MyPlan: CHEM 299</a></p"}, {"course_id": "chem428", "reg_prereqs": [], "numCID": 428, "choice_prereqs": [["bioc405", "bioc440"]], "course_info": "<p><b>CHEM 428 Bioinstrumental Analysis (3) NW</b><br/>Modern instrumental methods of bioanalysis of DNA and proteins, including agarose gel electrophoresis, PCR, Sanger sequencing for nucleic acid analysis and ELISA, SDS-PAGE, and LC/MS-MS analysis of proteins. Mass analysis, separation sciences, and bioinformatics tools. Includes laboratory. No credit allowed if BIOC 426 taken. "}, {"course_id": "chem429", "reg_prereqs": [], "numCID": 429, "choice_prereqs": [["chem224", "chem239", "chem337"], ["chem241", "chem321", "chem346"]], "course_info": "<p><b>CHEM 429 Chemical Separation Techniques (3) NW</b><br/>Introduction to modern separation techniques such as gas chromatography, high-performance liquid chromatography, electrophoresis, and field flow fractionation. "}, {"course_id": "chem152", "reg_prereqs": [], "numCID": 152, "choice_prereqs": [["chem142", "chem145"]], "course_info": "<p><b>CHEM 152 General Chemistry (5) NW, QSR</b><br/>Gas phase and aqueous equilibria, thermochemistry, thermodynamics, and electrochemistry. Includes laboratory. No more than 5 credits can be counted toward graduation from the following course group: CHEM 152, CHEM 155. "}, {"course_id": "chem399", "reg_prereqs": [], "numCID": 399, "choice_prereqs": [], "course_info": "<p><b>CHEM 399 Undergraduate Research (*, max. 12)</b><br/>Research in chemistry. Credit/no-credit only. Offered: AWSpS.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/CHEM399\" target=\"_blank\">View course details in MyPlan: CHEM 399</a></p"}, {"course_id": "chem110", "reg_prereqs": [], "numCID": 110, "choice_prereqs": [], "course_info": "<p><b>CHEM 110 Introduction to General Chemistry (3-5) NW</b><br/>Introduction to general chemistry with an emphasis on developing problem solving skills. Covers basic concepts of chemistry along with the mathematics required for quantitative problem solving. For students without high school chemistry or with limited mathematics background. Successful completion of CHEM 110 prepares students to enroll in CHEM 142. Credit/no-credit only. Offered: A.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/CHEM110\" target=\"_blank\">View course details in MyPlan: CHEM 110</a></p"}, {"course_id": "chem291", "reg_prereqs": [], "numCID": 291, "choice_prereqs": [], "course_info": "<p><b>CHEM 291 Study Abroad - Chemistry (1-15, max. 15) NW</b><br/>For student in the UW study abroad program. Content varies and is individually evaluated. Credit does not apply to major degree requirements without departmental approval.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/CHEM291\" target=\"_blank\">View course details in MyPlan: CHEM 291</a></p"}, {"course_id": "chem462", "reg_prereqs": ["chem460"], "numCID": 462, "choice_prereqs": [["chem242", "chem347"]], "course_info": "<p><b>CHEM 462 Techniques of Synthetic Organic Chemistry (2-3) NW</b><br/>Laboratory techniques of synthetic organic chemistry. Vacuum distillation, multistep synthesis, air sensitive reagents, photochemistry, chromatography, and separation techniques. "}, {"course_id": "chem456", "reg_prereqs": [], "numCID": 456, "choice_prereqs": [["chem155", "chem162"], ["math126", "math136"], ["phys116", "phys123"]], "course_info": "<p><b>CHEM 456 Physical Chemistry (3) NW</b><br/>Chemical thermodynamics. Laws of thermodynamics presented with applications to phase equilibria, chemical equilibria, and solutions. No more than the number of credits indicated can be counted toward graduation from the following course group: CHEM 452, CHEM 456 (3 credits). "}, {"course_id": "chem436", "reg_prereqs": [], "numCID": 436, "choice_prereqs": [["chem224", "chem239", "chem335"], ["bioc405", "bioc440"]], "course_info": "<p><b>CHEM 436 Chemical Biology (3) NW</b><br/>Mechanistic enzymology and chemical biology. Topics include protein structure and function, how enzymes work as catalysts, kinetic methods, functional assays, and applications to current research. "}, {"course_id": "chem486", "reg_prereqs": ["chem455"], "numCID": 486, "choice_prereqs": [], "course_info": "<p><b>CHEM 486 Electronic Dynamics in Organic and Inorganic Materials (3) NW</b><br/>Energy and charge transfer; exciton migration and charge transport; photophysical dynamics in optoelectronic and kinetic processes in electrochemical energy conversion. "}, {"course_id": "chem484", "reg_prereqs": [], "numCID": 484, "choice_prereqs": [["chem453", "chem455"]], "course_info": "<p><b>CHEM 484 Electronic and Optoelectronic Polymers (3) NW</b><br/>Covers the chemistry, physics, materials science, and applications of semiconducting and metallic conjugated polymers. Examines the structural origins of the diverse electronic and optoelectronic properties of conjugated polymers. Exemplifies applications by light-emitting diodes, lasers, solar cells, thin film transistors, electrochromic devices, biosensors, and batteries. "}, {"course_id": "chem485", "reg_prereqs": ["chem455"], "numCID": 485, "choice_prereqs": [], "course_info": "<p><b>CHEM 485 Electronic Structure and Application of Materials (3) NW</b><br/>Introduction to electronic structure theory of solids from a chemical perspective, including band theory and the free electron model, with an emphasis in the second half of the quarter on modern trends in research in inorganic materials in the bulk and on the nanometer scale. "}, {"course_id": "chem426", "reg_prereqs": ["chem321"], "numCID": 426, "choice_prereqs": [], "course_info": "<p><b>CHEM 426 Instrumental Analysis (3) NW</b><br/>Introduction to modern instrumental methods of chemical analysis, including chromatography, optical and mass spectroscopy, electrochemistry and flow injection analysis. Basic concepts of transducers, spectrometers, mass analysis, separation sciences, and computerized data acquisition and reduction. Includes laboratory. "}, {"course_id": "chem458", "reg_prereqs": [], "numCID": 458, "choice_prereqs": [], "course_info": "<p><b>CHEM 458 Air Pollution Chemistry (4) NW</b><br/>Global atmosphere as a chemical system emphasizing physical factors and chemical processes that give rise to elevated surface ozone, particulate matter, and air toxics; international issues of air pollution transport and changing tropospheric background composition; and regulatory control strategies and challenges. Aimed at science and engineering majors. "}], "links": [{"source": 1, "target": 2}, {"source": 0, "target": 3}, {"source": 9, "target": 13}, {"source": 50, "target": 16}, {"source": 46, "target": 17}, {"source": 14, "target": 19}, {"source": 7, "target": 21}, {"source": 27, "target": 21}, {"source": 9, "target": 22}, {"source": 44, "target": 27}, {"source": 30, "target": 27}, {"source": 45, "target": 27}, {"source": 43, "target": 30}, {"source": 44, "target": 30}, {"source": 23, "target": 39}, {"source": 37, "target": 40}, {"source": 43, "target": 44}, {"source": 44, "target": 45}, {"source": 15, "target": 46}, {"source": 37, "target": 54}, {"source": 6, "target": 57}, {"source": 6, "target": 59}, {"source": 25, "target": 60}]}