{"nodes": [{"course_info": "<p><b>CSE 481 Capstone Software Design (5, max. 15)</b><br/>Students work in teams to design and implement a software project involving multiple areas of the CSE curriculum. Emphasis is placed on the development process itself, rather than on the product. ", "course_name": "CSE 481", "choice_prereqs": [["cse331", "cse352"]], "course_id": "cse481", "numCID": 481, "reg_prereqs": ["cse332", "cse351"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 467 Advanced Digital Design (4)</b><br/>Advanced techniques in the design of digital systems. Hardware description languages, combinational and sequential logic synthesis and optimization methods, partitioning, mapping to regular structures. Emphasis on reconfigurable logic as an implementation medium. Memory system design. Digital communication including serial/parallel and synchronous/asynchronous methods. ", "course_name": "CSE 467", "choice_prereqs": [], "course_id": "cse467", "numCID": 467, "reg_prereqs": ["cse352", "cse332"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 460 Animation Capstone (5)</b><br/>Apply the knowledge gained in previous animation courses to produce a short animated film. Topics include scene planning, digital cinematography, creature and hard surface modeling, animatics and basics of character animation, and rendering techniques. ", "course_name": "CSE 460", "choice_prereqs": [], "course_id": "cse460", "numCID": 460, "reg_prereqs": ["cse458", "cse459"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 341 Programming Languages (4)</b><br/>Basic concepts of programming languages, including abstraction mechanisms, static and dynamic typing, scope, syntax vs. semantics, first-class function closures, and algebraic datatypes. Detailed study of functional programming and other paradigms. No credit if CSE 413 has been taken. ", "course_name": "CSE 341", "choice_prereqs": [], "course_id": "cse341", "numCID": 341, "reg_prereqs": ["cse143"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 344 Introduction to Data Management (4)</b><br/>Introduces database management systems and writing applications that use such systems; data models (e.g., relational, semi-structured), query languages (e.g., SQL, XQuery), language bindings, conceptual modeling, transactions, security, database tuning, data warehousing, parallelism, and web-data management. ", "course_name": "CSE 344", "choice_prereqs": [], "course_id": "cse344", "numCID": 344, "reg_prereqs": ["cse311"], "is_prereq_for": ["cse444"]}, {"course_info": "<p><b>CSE 142 Computer Programming I (4) NW, QSR</b><br/>Basic programming-in-the-small abilities and concepts including procedural programming (methods, parameters, return, values), basic control structures (sequence, if/else, for loop, while loop), file processing, arrays, and an introduction to defining objects. Intended for students without prior programming experience. Offered: AWSpS.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/CSE142\" target=\"_blank\">View course details in MyPlan: CSE 142</a></p", "course_name": "CSE 142", "choice_prereqs": [], "course_id": "cse142", "numCID": 142, "reg_prereqs": [], "is_prereq_for": ["cse143"]}, {"course_info": "<p><b>CSE 143 Computer Programming II (5) NW, QSR</b><br/>Continuation of CSE 142. Concepts of data abstraction and encapsulation including stacks, queues, linked lists, binary trees, recursion, instruction to complexity and use of predefined collection classes. ", "course_name": "CSE 143", "choice_prereqs": [], "course_id": "cse143", "numCID": 143, "reg_prereqs": ["cse142"], "is_prereq_for": ["cse469", "cse341", "cse414", "cse391", "cse474", "cse311", "cse374", "cse373", "cse331", "cse351"]}, {"course_info": "<p><b>CSE 312 Foundations of Computing II (4) QSR</b><br/>Examines fundamentals of enumeration and discrete probability; applications of randomness to computing; polynomial-time versus NP; and NP-completeness. ", "course_name": "CSE 312", "choice_prereqs": [], "course_id": "cse312", "numCID": 312, "reg_prereqs": ["cse311", "cse332"], "is_prereq_for": ["cse431", "cse421", "cse427", "cse428"]}, {"course_info": "<p><b>CSE 454 Advanced Internet and Web Services (5)</b><br/>Design of Internet search engines, including spider architecture, inverted indices, frequency rankings, latent semantic indexing, hyperlink analysis, and refinement interfaces. Construction of scalable and secure web services. Datamining webserver logs to provide personalized and user-targeted services. Large project. ", "course_name": "CSE 454", "choice_prereqs": [["cse331", "cse352"]], "course_id": "cse454", "numCID": 454, "reg_prereqs": ["cse332", "cse351"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 333 Systems Programming (4)</b><br/>Includes substantial programming experience in languages that expose machine characteristics and low-level data representation (e.g., C and C++); explicit memory management; modern libraries and language features; interacting with operating-system services; introduction to concurrent programming. ", "course_name": "CSE 333", "choice_prereqs": [], "course_id": "cse333", "numCID": 333, "reg_prereqs": ["cse351"], "is_prereq_for": ["cse457", "cse451", "cse455"]}, {"course_info": "<p><b>CSE 369 Introduction to Digital Design (2)</b><br/>Introduces the implementation, specification, and simulation of digital logic. Boolean algebra; combinational circuits including arithmetic circuits and regular structures; sequential circuits including finite-state-machines; and use of field-programmable gate arrays (FPGAs). Emphasizes simulation, high-level specification, and automatic synthesis techniques. No credit if EE 271 has been taken. ", "course_name": "CSE 369", "choice_prereqs": [], "course_id": "cse369", "numCID": 369, "reg_prereqs": ["cse311"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 332 Data Structures and Parallelism (4)</b><br/>Covers abstract data types and structures including dictionaries, balanced trees, hash tables, priority queues, and graphs; sorting; asymptotic analysis; fundamental graph algorithms including graph search, shortest path, and minimum spanning trees; multithreading and parallel algorithms; P and NP complexity classes. No credit if CSE 373 has been taken. ", "course_name": "CSE 332", "choice_prereqs": [], "course_id": "cse332", "numCID": 332, "reg_prereqs": ["cse311"], "is_prereq_for": ["cse481", "cse467", "cse457", "cse484", "cse473", "cse312", "cse451", "cse454", "cse455", "cse421", "cse446", "cse444", "cse442", "cse427", "cse440", "cse403", "cse428", "cse401"]}, {"course_info": "<p><b>CSE 484 Computer Security (4)</b><br/>Foundations of modern computer security, including software security, operating system security, network security, applied cryptography, human factors, authentication, anonymity, and web security. ", "course_name": "CSE 484", "choice_prereqs": [], "course_id": "cse484", "numCID": 484, "reg_prereqs": ["cse332", "cse351"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 352 Hardware Design and Implementation (4)</b><br/>Covers digital circuit design, processor design, and systems integration and embedded-systems issues. Includes substantial hardware laboratory. ", "course_name": "CSE 352", "choice_prereqs": [], "course_id": "cse352", "numCID": 352, "reg_prereqs": ["cse311", "cse351"], "is_prereq_for": ["cse467"]}, {"course_info": "<p><b>CSE 431 Introduction to Theory of Computation (3)</b><br/>Models of computation, computable and noncomputable functions, space and time complexity, tractable and intractable functions. ", "course_name": "CSE 431", "choice_prereqs": [], "course_id": "cse431", "numCID": 431, "reg_prereqs": ["cse312"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 351 The Hardware/Software Interface (4)</b><br/>Examines key computational abstraction levels below modern high-level languages; number representation, assembly language, introduction to C, memory management, the operating-system process model, high-level machine architecture including the memory hierarchy, and how high-level languages are implemented. ", "course_name": "CSE 351", "choice_prereqs": [], "course_id": "cse351", "numCID": 351, "reg_prereqs": ["cse143"], "is_prereq_for": ["cse481", "cse484", "cse451", "cse454", "cse470", "cse333", "cse352", "cse401"]}, {"course_info": "<p><b>CSE 473 Introduction to Artificial Intelligence (3)</b><br/>Principal ideas and developments in artificial intelligence: Problem solving and search, game playing, knowledge representation and reasoning, uncertainty, machine learning, natural language processing. Not open for credit to students who have completed CSE 415. ", "course_name": "CSE 473", "choice_prereqs": [], "course_id": "cse473", "numCID": 473, "reg_prereqs": ["cse332"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 414 Introduction to Database Systems (4)</b><br/>Introduces database management systems and writing applications that use such systems; data models, query languages, transactions, database tuning, data warehousing, and parallelism. Intended for non-majors. Not open for credit to students who have completed CSE 344. ", "course_name": "CSE 414", "choice_prereqs": [], "course_id": "cse414", "numCID": 414, "reg_prereqs": ["cse143"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 415 Introduction to Artificial Intelligence (3) NW</b><br/>Principles and programming techniques of artificial intelligence: LISP, symbol manipulation, knowledge representation, logical and probabilistic reasoning, learning, language understanding, vision, expert systems, and social issues. Intended for non-majors. Not open for credit to students who have completed CSE 473. ", "course_name": "CSE 415", "choice_prereqs": [], "course_id": "cse415", "numCID": 415, "reg_prereqs": ["cse373"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 469 Computer Architecture I (5)</b><br/>Introduction to computer architecture. Assembly and machine language, microprocessor organization including control and datapath. Computer arithmetic. Memory systems and caching. Performance modeling of microprocessors. ", "course_name": "CSE 469", "choice_prereqs": [["ee271", "cse369"]], "course_id": "cse469", "numCID": 469, "reg_prereqs": ["cse143"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 410 Computer Systems (3)</b><br/>Structure and components of hardware and software systems. Machine organization, including central processor and input-output architectures; assembly language programming; operating systems, including process, storage, and file management. Intended for non-majors. No credit to students who have completed CSE 351 or CSE 451. ", "course_name": "CSE 410", "choice_prereqs": [], "course_id": "cse410", "numCID": 410, "reg_prereqs": ["cse373"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 452 Introduction to Distributed Systems (4)</b><br/>Covers abstractions and implementation techniques in the construction of distributed systems, including cloud computing, distributed storage systems, and distributed caches. ", "course_name": "CSE 452", "choice_prereqs": [], "course_id": "cse452", "numCID": 452, "reg_prereqs": ["cse451"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 413 Programming Languages and Their Implementation (3)</b><br/>Basic concepts and implementation strategies for modern functional and object-oriented programming languages such as Scheme and Java. Intended for non-majors. No credit to students who have completed CSE 341 or CSE 401. ", "course_name": "CSE 413", "choice_prereqs": [], "course_id": "cse413", "numCID": 413, "reg_prereqs": ["cse373"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 458 Computer Animation (5)</b><br/>Introduction to basic principles of computer generated animation. Focus on the modeling and lighting of animated characters. Students from art, CSE, and music team up on projects to be built on commercially-available modeling and lighting packages. ", "course_name": "CSE 458", "choice_prereqs": [], "course_id": "cse458", "numCID": 458, "reg_prereqs": ["cse457"], "is_prereq_for": ["cse459", "cse460"]}, {"course_info": "<p><b>CSE 459 Pre-Production for Collaborative Animation (5)</b><br/>Pre-production of collaboratively designed animated shorts. In-depth analysis of classical and computer generated works. Character design and pre-planning, model sheets, character rigging, storyreel and animatics, character motion, design for multiple characters, and principles of animation as applied to character motion and effects. ", "course_name": "CSE 459", "choice_prereqs": [], "course_id": "cse459", "numCID": 459, "reg_prereqs": ["cse458"], "is_prereq_for": ["cse460"]}, {"course_info": "<p><b>CSE 311 Foundations of Computing I (4) QSR</b><br/>Examines fundamentals of logic, set theory, induction, and algebraic structures with applications to computing; finite state machines; and limits of computability. ", "course_name": "CSE 311", "choice_prereqs": [["math126", "math136"]], "course_id": "cse311", "numCID": 311, "reg_prereqs": ["cse143"], "is_prereq_for": ["cse344", "cse369", "cse312", "cse332", "cse352"]}, {"course_info": "<p><b>CSE 451 Introduction to Operating Systems (4)</b><br/>Principles of operating systems. Process management, memory management, auxiliary storage management, resource allocation. No credit to students who have completed CSE 410 or E E 474. ", "course_name": "CSE 451", "choice_prereqs": [], "course_id": "cse451", "numCID": 451, "reg_prereqs": ["cse351", "cse332", "cse333"], "is_prereq_for": ["cse452"]}, {"course_info": "<p><b>CSE 474 Introduction to Embedded Systems (4)</b><br/>Introduces the specification, design, development, and test of real time embedded system software. Use of a modern embedded microcomputer or microcontroller as a target environment for a series of laboratory projects and a comprehensive final project. ", "course_name": "CSE 474", "choice_prereqs": [], "course_id": "cse474", "numCID": 474, "reg_prereqs": ["cse143"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 457 Computer Graphics (4)</b><br/>Introduction to computer image synthesis, modeling, and animation. Topics may include visual perception, displays and framebuffers, image processing, affine and projective transformations, hierarchical modeling, hidden surface elimination, shading, ray-tracing, anti-aliasing, texture mapping, curves, surfaces, particle systems, dynamics, character animation, and animation principles. ", "course_name": "CSE 457", "choice_prereqs": [], "course_id": "cse457", "numCID": 457, "reg_prereqs": ["cse333", "cse332"], "is_prereq_for": ["cse458"]}, {"course_info": "<p><b>CSE 374 Intermediate Programming Concepts and Tools (3)</b><br/>Covers key software development concepts and tools not in introductory courses. Concepts of lower-level programming (C/C++) and explicit memory management; techniques and tools for individual and group software development; design, implementation, and testing strategies. Intended for non-majors. Cannot be taken for credit if credit received for CSE 333. ", "course_name": "CSE 374", "choice_prereqs": [], "course_id": "cse374", "numCID": 374, "reg_prereqs": ["cse143"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 470 Computer Architecture II (4)</b><br/>Advanced computer architecture. Performance evaluation and energy efficiency. Instruction set architectures. Instruction-level parallelism. Modern microprocessor micro-architecture. Thread-level parallelism. Cache coherency and memory consistency in shared-memory multiprocessors. Memory hierarchy. GPU architecture. Warehouse-scale computing. Trends in computer design. ", "course_name": "CSE 470", "choice_prereqs": [["cse469", "ee469", "ee471"]], "course_id": "cse470", "numCID": 470, "reg_prereqs": ["cse351"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 373 Data Structures and Algorithms (3)</b><br/>Fundamental algorithms and data structures for implementation. Techniques for solving problems by programming. Linked lists, stacks, queues, directed graphs. Trees: representations, traversals. Searching (hashing, binary search trees, multiway trees). Garbage collection, memory management. Internal and external sorting. Intended for non-majors. Not open for credit to students who have completed CSE 332. ", "course_name": "CSE 373", "choice_prereqs": [], "course_id": "cse373", "numCID": 373, "reg_prereqs": ["cse143"], "is_prereq_for": ["cse415", "cse410", "cse413", "cse417"]}, {"course_info": "<p><b>CSE 331 Software Design and Implementation (4)</b><br/>Explores concepts and techniques for design and construction of reliable and maintainable software systems in modern high-level languages: specifications; program structure and design; program-correctness approaches, including testing; and event-driven programming (e.g., graphical user interface). ", "course_name": "CSE 331", "choice_prereqs": [], "course_id": "cse331", "numCID": 331, "reg_prereqs": ["cse143"], "is_prereq_for": ["cse403", "cse428"]}, {"course_info": "<p><b>CSE 455 Computer Vision (4)</b><br/>Introduction to image analysis and interpreting the 3D world from image data. Topics may include segmentation, motion estimation, image mosaics, 3D-shape reconstruction, object recognition, and image retrieval. ", "course_name": "CSE 455", "choice_prereqs": [], "course_id": "cse455", "numCID": 455, "reg_prereqs": ["cse333", "cse332"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 391 System and Software Tools (1)</b><br/>Introduction to tools commonly used in software development. Topics include using a command-line interface, writing scripts for file and string manipulation, managing user permissions, manipulating text with regular expressions, using build-management tools, and using version-control systems. ", "course_name": "CSE 391", "choice_prereqs": [], "course_id": "cse391", "numCID": 391, "reg_prereqs": ["cse143"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 427 Computational Biology (3)</b><br/>Algorithmic and analytic techniques underlying analysis of large-scale biological data sets such as DNA, RNA, and protein sequences or structures, expression and proteomic profiling. Hands-on experience with databases, analysis tools, and genome markers. Applications such as sequence alignment, BLAST, phylogenetics, and Markov models. ", "course_name": "CSE 427", "choice_prereqs": [], "course_id": "cse427", "numCID": 427, "reg_prereqs": ["cse312", "cse332"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 417 Algorithms and Computational Complexity (3)</b><br/>Design and analysis of algorithms and data structures. Efficient algorithms for manipulating graphs and strings. Fast Fourier Transform. Models of computation, including Turing machines. Time and space complexity. NP-complete problems and undecidable problems. Intended for non-majors. ", "course_name": "CSE 417", "choice_prereqs": [], "course_id": "cse417", "numCID": 417, "reg_prereqs": ["cse373"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 421 Introduction to Algorithms (3)</b><br/>Techniques for design of efficient algorithms. Methods for showing lower bounds on computational complexity. Particular algorithms for sorting, searching, set manipulation, arithmetic, graph problems, pattern matching. ", "course_name": "CSE 421", "choice_prereqs": [], "course_id": "cse421", "numCID": 421, "reg_prereqs": ["cse312", "cse332"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 446 Machine Learning (4)</b><br/>Methods for designing systems that learn from data and improve with experience. Supervised learning and predictive modeling: decision trees, rule induction, nearest neighbors, Bayesian methods, neural networks, support vector machines, and model ensembles. Unsupervised learning and clustering. ", "course_name": "CSE 446", "choice_prereqs": [["stat390", "stat391", "cse312"]], "course_id": "cse446", "numCID": 446, "reg_prereqs": ["cse332"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 444 Database Systems Internals (4)</b><br/>The relational data model and the SQL query language. Conceptual modeling: entity/relationships, normal forms. XML, XPath, and XQuery. Transactions: recovery and concurrency control. Implementation of a database system. A medium sized project using a rational database backend. ", "course_name": "CSE 444", "choice_prereqs": [], "course_id": "cse444", "numCID": 444, "reg_prereqs": ["cse332", "cse344"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 442 Data Visualization (4)</b><br/>Techniques for creating effective visualizations of data based on principles from graphic design, perceptual psychology, and statistics. Topics include visual encoding models, exploratory data analysis, visualization software, interaction techniques, graphical perception, color, animation, high-dimensional data, cartography, network visualization, and text visualization. ", "course_name": "CSE 442", "choice_prereqs": [], "course_id": "cse442", "numCID": 442, "reg_prereqs": ["cse332"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 441 Advanced HCI: Advanced User Interface Design, Prototyping, and Evaluation (5)</b><br/>Human-Computer Interaction (HCI) theory and techniques. Advanced methods for designing, prototyping, and evaluating user interfaces to computing applications. Novel interface technology, advanced interface design methods, and prototyping tools. ", "course_name": "CSE 441", "choice_prereqs": [], "course_id": "cse441", "numCID": 441, "reg_prereqs": ["cse440"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 440 Introduction to HCI: User Interface Design, Prototyping, and Evaluation (5)</b><br/>Human-Computer Interaction (HCI) theory and techniques. Methods for designing, prototyping, and evaluating user interfaces to computing applications. Human capabilities, interface technology, interface design methods, and interface evaluation tools and techniques. ", "course_name": "CSE 440", "choice_prereqs": [], "course_id": "cse440", "numCID": 440, "reg_prereqs": ["cse332"], "is_prereq_for": ["cse441"]}, {"course_info": "<p><b>CSE 403 Software Engineering (4)</b><br/>Fundamentals of software engineering using a group project as the basic vehicle. Topics covered include the software crisis, managing complexity, requirements specification, architectural and detailed design, testing and analysis, software process, and tools and environments. ", "course_name": "CSE 403", "choice_prereqs": [], "course_id": "cse403", "numCID": 403, "reg_prereqs": ["cse331", "cse332"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 428 Computational Biology Capstone (5)</b><br/>Designs and implements a software tool or software analysis for an important problem in computational molecular biology. ", "course_name": "CSE 428", "choice_prereqs": [], "course_id": "cse428", "numCID": 428, "reg_prereqs": ["cse312", "cse331", "cse332"], "is_prereq_for": []}, {"course_info": "<p><b>CSE 401 Introduction to Compiler Construction (4)</b><br/>Fundamentals of compilers and interpreters; symbol tables; lexical analysis, syntax analysis, semantic analysis, code generation, and optimizations for general purpose programming languages. No credit to students who have taken CSE 413. ", "course_name": "CSE 401", "choice_prereqs": [], "course_id": "cse401", "numCID": 401, "reg_prereqs": ["cse332", "cse351"], "is_prereq_for": []}], "links": [{"source": 11, "target": 0}, {"source": 15, "target": 0}, {"source": 13, "target": 1}, {"source": 11, "target": 1}, {"source": 23, "target": 2}, {"source": 24, "target": 2}, {"source": 6, "target": 3}, {"source": 25, "target": 4}, {"source": 5, "target": 6}, {"source": 25, "target": 7}, {"source": 11, "target": 7}, {"source": 11, "target": 8}, {"source": 15, "target": 8}, {"source": 15, "target": 9}, {"source": 25, "target": 10}, {"source": 25, "target": 11}, {"source": 11, "target": 12}, {"source": 15, "target": 12}, {"source": 25, "target": 13}, {"source": 15, "target": 13}, {"source": 7, "target": 14}, {"source": 6, "target": 15}, {"source": 11, "target": 16}, {"source": 6, "target": 17}, {"source": 31, "target": 18}, {"source": 6, "target": 19}, {"source": 31, "target": 20}, {"source": 26, "target": 21}, {"source": 31, "target": 22}, {"source": 28, "target": 23}, {"source": 23, "target": 24}, {"source": 6, "target": 25}, {"source": 15, "target": 26}, {"source": 11, "target": 26}, {"source": 9, "target": 26}, {"source": 6, "target": 27}, {"source": 9, "target": 28}, {"source": 11, "target": 28}, {"source": 6, "target": 29}, {"source": 15, "target": 30}, {"source": 6, "target": 31}, {"source": 6, "target": 32}, {"source": 9, "target": 33}, {"source": 11, "target": 33}, {"source": 6, "target": 34}, {"source": 7, "target": 35}, {"source": 11, "target": 35}, {"source": 31, "target": 36}, {"source": 7, "target": 37}, {"source": 11, "target": 37}, {"source": 11, "target": 38}, {"source": 11, "target": 39}, {"source": 4, "target": 39}, {"source": 11, "target": 40}, {"source": 42, "target": 41}, {"source": 11, "target": 42}, {"source": 32, "target": 43}, {"source": 11, "target": 43}, {"source": 7, "target": 44}, {"source": 32, "target": 44}, {"source": 11, "target": 44}, {"source": 11, "target": 45}, {"source": 15, "target": 45}]}