{"nodes": [{"course_info": "<p><b>GWSS 357 Psychobiology of Women (5) NW, DIV</b><i> Kenney</i><br/>Physiological and psychological aspects of women's lives; determinants of biological sex; physiological and psychological events of puberty; menopause; sexuality; contraception, pregnancy, childbirth, and lactation; role of culture in determining psychological response to physiological events. ", "course_name": "GWSS 357", "choice_prereqs": [], "course_id": "gwss357", "numCID": 357, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 235 Global Feminist Art (5) VLPA/I&amp;S</b><br/>Introduces feminism as a way of thinking about visual art practice in terms of social hierarchy, aesthetic form, and ideology. Explores how feminist artists working in diverse locations and cultural traditions challenge, at the local and global level, artistic conventions and representations of gender, sexuality, race, class, and nationality. ", "course_name": "GWSS 235", "choice_prereqs": [], "course_id": "gwss235", "numCID": 235, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 355 Men and Masculinity (5) I&amp;S</b><br/>Critical study of systematic responses of men to feminist movements, including conservative, pro-feminist, men's rights, mythopoetic, and religious responses. How men of color and gay men view these various men's movements and their issues. Special attention given to philosophical problems such as nature of oppression, human nature, justice, and masculinity.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS355\" target=\"_blank\">View course details in MyPlan: GWSS 355</a></p", "course_name": "GWSS 355", "choice_prereqs": [], "course_id": "gwss355", "numCID": 355, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 466 Gender and Architecture (3) VLPA/I&amp;S</b><br/>Examines gender in the experience, practice, and theory of architecture and urban space with a focus on modern typologies: skyscraper, home, convent, bachelor pad, street, and closet. Draws from architectural and art history, social studies, design practice and theory, comparative literature, film studies, and queer theory. ", "course_name": "GWSS 466", "choice_prereqs": [], "course_id": "gwss466", "numCID": 466, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 353 Feminist Anthropology (5) I&amp;S, DIV</b><br/>Explores the history and contemporary practice of feminist ethnography at the interdisciplinary intersection of anthropology and gender studies. Examines how the inclusion of women, as subjects and researchers, has influenced anthropological knowledge production, and how the cross-cultural imperative of anthropology has influenced understandings of gender, sexuality, and race. ", "course_name": "GWSS 353", "choice_prereqs": [], "course_id": "gwss353", "numCID": 353, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 374 Introduction to Transgender Studies (5) I&amp;S, DIV</b><i> A. SWARR</i><br/>What does it mean to look beyond a simplistic binary of \"man\" and \"woman\"? With definitions of sex and gender as a starting point, we blur these contested categories, complicating them with sexuality, race, class, ability, history, and location.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS374\" target=\"_blank\">View course details in MyPlan: GWSS 374</a></p", "course_name": "GWSS 374", "choice_prereqs": [], "course_id": "gwss374", "numCID": 374, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 351 Women of Color as Cross-Cultural Artists (5) VLPA/I&amp;S, DIV</b><i> Habell-Pallan</i><br/>Provides a historical context for artistic forms produced by racialized women. Examines the cultural production of Chicanas and Latinas in relation to that of Native American, African American, East and South Asian American , and Arab American women as well as those women of mixed heritage in the U.S.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS351\" target=\"_blank\">View course details in MyPlan: GWSS 351</a></p", "course_name": "GWSS 351", "choice_prereqs": [], "course_id": "gwss351", "numCID": 351, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 350 Women in Law and Literature (5) VLPA/I&amp;S, DIV</b><br/>Representations of women in American law and literature. Considers how women's political status and social roles have influenced legal and literary accounts of their behavior. Examines how legal cases and issues involving women are represented in literary texts and also how law can influence literary expression. ", "course_name": "GWSS 350", "choice_prereqs": [], "course_id": "gwss350", "numCID": 350, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 313 Women in Politics (5) I&amp;S, DIV</b><br/>Theoretical, historical, and empirical studies of women's participation in political and social movements. Women's diverse efforts to improve their political, social, and economic status. Policy issues of particular concern to women. Women's political experiences in household, local, regional, national, and international arenas. ", "course_name": "GWSS 313", "choice_prereqs": [], "course_id": "gwss313", "numCID": 313, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 486 Representing Beyond the Binaries: Mixing Race, Gender, and Sexuality in the Media (5) I&amp;S, DIV</b><i> Joeseph</i><br/>Cultural studies approach to examining the mixed formations that race, sexuality, and gender take in the contemporary United States media. Draws upon multi-disciplinary scholarship in examination of the media. ", "course_name": "GWSS 486", "choice_prereqs": [], "course_id": "gwss486", "numCID": 486, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 485 Issues for Ethnic Minorities and Women In Science and Engineering (3/5) I&amp;S</b><br/>Addresses issues faced by women and ethnic minorities in physical sciences and engineering. Focuses on participation, barriers to participation, and solutions to those issues for women and ethnic minorities in physical sciences and engineering. ", "course_name": "GWSS 485", "choice_prereqs": [], "course_id": "gwss485", "numCID": 485, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 310 Women and the Law (5) I&amp;S, DIV</b><br/>Examines how law addresses women, how the courts have made attempts to address women of color, poor women, lesbians, and women with disabilities. Topics include constitutional construction of equality, employment discrimination, reproductive rights, regulation of sexuality, families and motherhood, sexual harassment, violence against women, and international women and human rights.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS310\" target=\"_blank\">View course details in MyPlan: GWSS 310</a></p", "course_name": "GWSS 310", "choice_prereqs": [], "course_id": "gwss310", "numCID": 310, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 483 Topics in U.S. Women's History (5, max. 10) I&amp;S</b><br/>Selected topics in United States women's history from the nineteenth and twentieth centuries. ", "course_name": "GWSS 483", "choice_prereqs": [["gwss200", "gwss283", "gwss383"]], "course_id": "gwss483", "numCID": 483, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 468 Latin American Women (5) VLPA/I&amp;S, DIV</b><br/>The elaboration of discourses of identity in relation to gender, ethnicity, social class, and nationality, by women writers from South America, Mexico, Central America, and the Caribbean. Testimonial literature, literature and resistance, women's experimental fiction. ", "course_name": "GWSS 468", "choice_prereqs": [["span303", "span316"], ["span321"]], "course_id": "gwss468", "numCID": 468, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 333 Gender and Globalization: Theory and Process (5) I&amp;S, DIV</b><i> Ramamurthy</i><br/>Theoretical, historical, and empirical analysis of how current processes of globalization are transforming the actual conditions of women's lives, labor, gender ideologies, and politics in complex and contradictory ways. Topics include feminist exploration of colonialism, capitalism, economic restructuring policies, resistance in consumer and environmental movements. ", "course_name": "GWSS 333", "choice_prereqs": [], "course_id": "gwss333", "numCID": 333, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 405 Comparative Women's Movements and Activism (5) I&amp;S</b><br/>Comparative cultural, national, and historical study of women's movements and activisms. Critically analyzes multiple arenas of women's movements and resistance. Topics include feminist anti-racism, pre-nationalism and nationalism, economics, electoral politics, women's and human rights, and international/transnational feminisms. ", "course_name": "GWSS 405", "choice_prereqs": [["gwss305", "soc364"]], "course_id": "gwss405", "numCID": 405, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 251 Introduction to Gender and Popular Culture (5) VLPA/I&amp;S</b><i> Habell-Pallan</i><br/>Introduction to critical examination of gender, race/ethnicity, and sexuality in music, film, television, and the internet. Explores cultural meanings and social uses of popular culture by various communities in local and global contexts. Analysis of commercial and independent pop culture. Examination of popular culture forms varies depending on instructor.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS251\" target=\"_blank\">View course details in MyPlan: GWSS 251</a></p", "course_name": "GWSS 251", "choice_prereqs": [], "course_id": "gwss251", "numCID": 251, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 427 Women and Violence (5) I&amp;S, DIV</b><i> Ginorio</i><br/>Multi-disciplinary explorations of the continuum of violence which affects women's lives, ranging from experience in personal settings (family violence) to cultural or state policies (prisons, wars). Violence against women explored in the context of societal, political, and state violence.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS427\" target=\"_blank\">View course details in MyPlan: GWSS 427</a></p", "course_name": "GWSS 427", "choice_prereqs": [], "course_id": "gwss427", "numCID": 427, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 442 Images of Natives in the Cinema and Popular Cultures (5) VLPA/I&amp;S, DIV</b><i> D. HART, L. ROSS</i><br/>Cultural examination of images of Native people in cinema and popular culture based on social science writings and films by or about Natives in the United States and Canada. ", "course_name": "GWSS 442", "choice_prereqs": [], "course_id": "gwss442", "numCID": 442, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 429 Scandinavian Women Writers in English Translation (5) VLPA, DIV</b><br/>Selected works by major Scandinavian women writers from mid-nineteenth-century bourgeois realism to the present with focus on feminist issues in literary criticism. ", "course_name": "GWSS 429", "choice_prereqs": [], "course_id": "gwss429", "numCID": 429, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 428 Feminist Understanding of Victims (5) I&amp;S, DIV</b><br/>Explores the meanings of the term \"victim\" within popular, religious, psycho-social, and feminist discourses and the implications these have for victims, people and institutions that serve victims, and scholars who are concerned with these questions. Examines the tensions between activist and academic understandings of the impact of \"backlash\". ", "course_name": "GWSS 428", "choice_prereqs": [["gwss200"]], "course_id": "gwss428", "numCID": 428, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 440 Reading Native American Women's Lives (5, max. 10) I&amp;S, DIV</b><br/>Seminar based on social science writings, autobiographies, biographies, and fiction written by, with, or about indigenous women of the United States and Canada. ", "course_name": "GWSS 440", "choice_prereqs": [], "course_id": "gwss440", "numCID": 440, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 447 Economics of Gender (5) I&amp;S, DIV</b><br/>Microeconomic analysis of the sources of gender differences in earnings, labor force participation, occupational choice, education, and consumption. Economic theories of discrimination, human capital, fertility, and intrahousehold resource allocation. Economics of the family in developed and developing countries. ", "course_name": "GWSS 447", "choice_prereqs": [], "course_id": "gwss447", "numCID": 447, "reg_prereqs": ["econ300"]}, {"course_info": "<p><b>GWSS 446 Global Asia (5) I&amp;S, DIV</b><i> S. WELLAND</i><br/>Explores how Asia has been constructed through transnational interactions such as imperialism, anti-colonialism, tourism, diaspora, and global capitalism. Topics include the cultural construction of similarity and difference, politics of representation, and political economy of global circulations of people and things. ", "course_name": "GWSS 446", "choice_prereqs": [], "course_id": "gwss446", "numCID": 446, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 444 Criminality and \"Deviance\" in Native Communities (5)</b><i> L. ROSS</i><br/>Seminar based on social science writings and biographies written by and about incarcerated Natives and \"deviance\" in Native communities in the United States and Canada. ", "course_name": "GWSS 444", "choice_prereqs": [], "course_id": "gwss444", "numCID": 444, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 383 Social History of American Women to 1890 (5) I&amp;S, DIV</b><i> Yee</i><br/>A multi-racial, multicultural study of women in the United States from the seventeenth century to 1890 emphasizing women's unpaid work, participation in the paid labor force, charitable and reform activities, and nineteenth century social movements. Uses primary materials such as diaries, letters, speeches, and artifacts. ", "course_name": "GWSS 383", "choice_prereqs": [], "course_id": "gwss383", "numCID": 383, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 384 Social History of American Women in the Twentieth Century (5) I&amp;S</b><br/>Analyzes major themes in the history of women in North America from 1890 through the 1990s. Themes include family and community formation, social activism, education, paid and unpaid labor patterns, war, migration, and changing conceptions of womanhood and femininity in the twentieth century. ", "course_name": "GWSS 384", "choice_prereqs": [], "course_id": "gwss384", "numCID": 384, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 385 Women and Activism in the U.S., 1820-1990s (5) I&amp;S</b><br/>Analyzes how U.S. social reform movements between the 1820s and the 1990s shaped discourses of gender, race, class, nation, and citizenship. Social movements include temperance, anti-prostitution, prision reform, dress reform, reproductive rights, eugenics, suffrage/anti-suffrage, abolitionism, labor, the \"mothers' movement,\" civil rights, QBLTQ movement and dis/abilities, and evangelicalism.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS385\" target=\"_blank\">View course details in MyPlan: GWSS 385</a></p", "course_name": "GWSS 385", "choice_prereqs": [], "course_id": "gwss385", "numCID": 385, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 323 History of Racial Formation in the United States: 1800-1990 (5) I&amp;S</b><i> Yee</i><br/>Traces the development of the concept of race in the United States from the nineteenth century to the late twentieth century. Specific topics include paid and unpaid labor, media, reproduction, migration, social activism, and the processes of identity and community formation.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS323\" target=\"_blank\">View course details in MyPlan: GWSS 323</a></p", "course_name": "GWSS 323", "choice_prereqs": [], "course_id": "gwss323", "numCID": 323, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 389 Race, Gender, and Sexuality in the Media (5) I&amp;S, DIV</b><br/>Introduction to media representations of gender, race, and sexuality. ", "course_name": "GWSS 389", "choice_prereqs": [], "course_id": "gwss389", "numCID": 389, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 488 Women and/in Science (5) I&amp;S, DIV</b><i> Ginorio</i><br/>Explores science as a method of inquiry and as a profession while also expanding knowledge about women through the use of biographies of women scientists, discipline-based and feminist critiques, and the psycho-social concept of socially defined identities.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS488\" target=\"_blank\">View course details in MyPlan: GWSS 488</a></p", "course_name": "GWSS 488", "choice_prereqs": [], "course_id": "gwss488", "numCID": 488, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 244 Indigenous Feminisms (5) I&amp;S, DIV</b><i> Ross</i><br/>Reconceptualizes and examines the formation of feminisms within a transnational indigenous framework. Topics include indigenous knowledge production, sovereignty, analyses of genders and sexualities, violence, poverty, the politics of reproduction, cultural identities, media, and environmental and social justice.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS244\" target=\"_blank\">View course details in MyPlan: GWSS 244</a></p", "course_name": "GWSS 244", "choice_prereqs": [], "course_id": "gwss244", "numCID": 244, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 321 History of African American Women and the Feminist Movement (5) I&amp;S, DIV</b><br/>\"Feminist Movement\" from early nineteenth century to present. Treats relationship between black and white women in their struggle for independence, at times together and at times apart. Discusses the reasons, process, and results of collaboration as well as opposition. Examines recent and contemporary attempts at cooperation. ", "course_name": "GWSS 321", "choice_prereqs": [], "course_id": "gwss321", "numCID": 321, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 241 Hip Hop and Indie Rock (5) VLPA/I&amp;S</b><i> Habell-Pallan</i><br/>Introduction to pop music studies. Examines how archives, oral histories, and new media transform stories about music. Traces rhythms, tempos, and genres including blues, gospel, estilo bravio, punk, son jarocho, and disco that influence hip hop and indie rock, contextualizing their relation to gender, race/ethnicity, class, locality, and nation. Offered: Sp.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS241\" target=\"_blank\">View course details in MyPlan: GWSS 241</a></p", "course_name": "GWSS 241", "choice_prereqs": [], "course_id": "gwss241", "numCID": 241, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 262 Gender and Sport (5) I&amp;S, DIV</b><br/>Considers the relationship between sports and society. Focuses on how sports shape cultural ideas of masculinity and femininity. Examines how assumptions about professional and amateur athletes reflect and challenge social norms about gender, sexuality, race, and class. Other topics include student athletes, the business of sport, and non-normative athletic bodies. Offered: ASp.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS262\" target=\"_blank\">View course details in MyPlan: GWSS 262</a></p", "course_name": "GWSS 262", "choice_prereqs": [], "course_id": "gwss262", "numCID": 262, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 328 Gender and Sexuality in China (5) I&amp;S, DIV</b><i> S. WELLAND</i><br/>Explores gender and sexuality in China's process of modernization, form the late Qing dynasty through the building of the Republic, Communist revolution, and post-Mao economic reform. Examines, through historical, anthropological, and cultural studies scholarship, the centrality of these social constructs I terms of family, sate, labor, body, and ethnicity. ", "course_name": "GWSS 328", "choice_prereqs": [], "course_id": "gwss328", "numCID": 328, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 302 Research Methods in Women Studies (5) I&amp;S</b><br/>Explores appropriate research methodologies for interdisciplinary work in women studies. Examines current debates and issues in feminist methodologies and critiques of methodology. Use of historical documents and theoretical texts. Computer applications in research in women studies. ", "course_name": "GWSS 302", "choice_prereqs": [["gwss200", "gwss206"]], "course_id": "gwss302", "numCID": 302, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 489 Black Cultural Studies (5) I&amp;S</b><br/>Examines how images of blackness have been (re)constructed through identity formation and entrenched inequality. Topics include black women's bodies, black men's bodies, blackface minstrelsy, black queer studies, black power, and black hybridities. ", "course_name": "GWSS 489", "choice_prereqs": [], "course_id": "gwss489", "numCID": 489, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 345 Women and International Economic Development (5) I&amp;S, DIV</b><i> P. RAMAMURTHY</i><br/>Questions how women are affected by economic development in Third World and celebrates redefinitions of what development means. Introduces theoretical perspectives and methods to interrogate gender and development policies. Assesses current processes of globalization and potential for changing gender and economic inequalities. ", "course_name": "GWSS 345", "choice_prereqs": [], "course_id": "gwss345", "numCID": 345, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 476 Women and the City (5) I&amp;S, DIV</b><i> England</i><br/>Explores the reciprocal relations between gender relations, the layout of cities, and the activities of urban residents. Topics include: feminist theory and geography (women, gender, and the organization of space); women and urban poverty, housing and homelessness; gender roles and labor patterns; geographies of childcare; and women and urban politics. ", "course_name": "GWSS 476", "choice_prereqs": [], "course_id": "gwss476", "numCID": 476, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 499 Undergraduate Research (1-5, max. 10)</b><br/>Independent study and research supervised by a faculty member with appropriate academic interest. ", "course_name": "GWSS 499", "choice_prereqs": [], "course_id": "gwss499", "numCID": 499, "reg_prereqs": ["gwss200", "gwss300"]}, {"course_info": "<p><b>GWSS 474 Trans/Gender Queries (5) I&amp;S, DIV</b><i> Swarr</i><br/>Writings by and about people who fall outside common conceptions of \"women\" and \"men.\" Looks beyond this dualism in contemporary and historical global concepts, locating the emerging field of transgender studies in feminist studies and asking what the category \"transgender\" enables and obscures.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS474\" target=\"_blank\">View course details in MyPlan: GWSS 474</a></p", "course_name": "GWSS 474", "choice_prereqs": [], "course_id": "gwss474", "numCID": 474, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 206 Philosophy of Feminism (5) I&amp;S, DIV</b><br/>Philosophical analysis of the concepts and assumptions central to feminism. Theoretical positions within the feminist movement; view of the ideal society, goals and strategies of the movement, intersections of the sex-gender system with other systems of oppression. ", "course_name": "GWSS 206", "choice_prereqs": [], "course_id": "gwss206", "numCID": 206, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 300 Gender, Race, and Class in Social Stratification (5) I&amp;S, DIV</b><br/>The intersection of race, class, and gender in the lives of women of color in the United States from historical and contemporary perspectives. Topics include racism, classism, sexism, activism, sexuality, and inter-racial dynamics between women of color groups. ", "course_name": "GWSS 300", "choice_prereqs": [], "course_id": "gwss300", "numCID": 300, "reg_prereqs": ["gwss200"]}, {"course_info": "<p><b>GWSS 495 Tutoring Women Studies (5)</b><br/>Students train to serve as tutors in designated courses. Facilitate weekly group discussions, assist with writing assignments, explain course materials. ", "course_name": "GWSS 495", "choice_prereqs": [], "course_id": "gwss495", "numCID": 495, "reg_prereqs": ["gwss200", "gwss300"]}, {"course_info": "<p><b>GWSS 496 Global Feminisms: International and Indigenous Communities (5-12, max. 24) I&amp;S</b><br/>Participation in academic study abroad programs related to Gender, Women, and Sexuality Studies, emphasizing globalization and study in international contexts or indigenous communities within the United States. ", "course_name": "GWSS 496", "choice_prereqs": [], "course_id": "gwss496", "numCID": 496, "reg_prereqs": ["gwss200", "gwss300"]}, {"course_info": "<p><b>GWSS 497 Fieldwork in Women Studies (1-15, max. 15)</b><br/>Internship in local feminist-oriented agencies or projects. Includes a seminar component linking internship to scholarly literature and small group discussion. Supports in-depth exploration of social issues and skill development. ", "course_name": "GWSS 497", "choice_prereqs": [], "course_id": "gwss497", "numCID": 497, "reg_prereqs": ["gwss200", "gwss300"]}, {"course_info": "<p><b>GWSS 490 Special Topics in Women Studies (2-5, max. 15) I&amp;S</b><br/>Exploration of specific problems and issues relevant to the study of women. Offered by visiting or resident faculty members. Primarily for upper-division and graduate students.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS490\" target=\"_blank\">View course details in MyPlan: GWSS 490</a></p", "course_name": "GWSS 490", "choice_prereqs": [], "course_id": "gwss490", "numCID": 490, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 305 Feminism in an International Context (5) I&amp;S</b><br/>Women and feminism from global theoretical perspectives. Critical theoretical ways of thinking about feminism. How women are differently situated throughout the world. How they are represented affects women's agency. Focus on how race and gender affect one another. Representations of and by women throughout the world.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS305\" target=\"_blank\">View course details in MyPlan: GWSS 305</a></p", "course_name": "GWSS 305", "choice_prereqs": [], "course_id": "gwss305", "numCID": 305, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 493 Senior Thesis (2-5, max. 15) I&amp;S</b><br/>Students conceptualize a topic, conduct primary and secondary research, and write a major paper or project that engages methodologies and theories in interdisciplinary women's studies. Students work independently with a faculty member.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS493\" target=\"_blank\">View course details in MyPlan: GWSS 493</a></p", "course_name": "GWSS 493", "choice_prereqs": [], "course_id": "gwss493", "numCID": 493, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 458 Ideologies and Technologies of Motherhood (5) I&amp;S, DIV</b><br/>Examines how motherhood is culturally constituted, regulated, and managed within various ideological and technological milieus. Uses ethnographies from anthropology and case studies from feminist legal theory. Topics include slave mothers, surrogate mothers, lesbian mothers, transracial mothers, co-mothers, teen mothers. ", "course_name": "GWSS 458", "choice_prereqs": [], "course_id": "gwss458", "numCID": 458, "reg_prereqs": ["gwss200"]}, {"course_info": "<p><b>GWSS 459 Gender Histories of Modern China, Eighteenth to Twentieth Centuries (5) I&amp;S</b><br/>Emergence of modernist social, political, intellectual gender formations in social activism, revolutionary writing, scientific ideologies, economic globalization. Stresses gender difference in colonial modernity, revolutionary movement, communism, post-socialist market society. Relates modern Chinese women to global flows, new division of labor, local and regional experience. ", "course_name": "GWSS 459", "choice_prereqs": [], "course_id": "gwss459", "numCID": 459, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 464 Queer Desires (5) I&amp;S, DIV</b><i> Swarr</i><br/>Explores desire and the politics of sexuality as gendered, raced, classed, and transnational processes. Intimacies and globalization, normality and abnormality, and power and relationships are sites of inquiry into the constitution of \"queerness.\" Students interrogate queer and sexuality studies, using varied media - films, activist writings, and scholarly articles.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS464\" target=\"_blank\">View course details in MyPlan: GWSS 464</a></p", "course_name": "GWSS 464", "choice_prereqs": [], "course_id": "gwss464", "numCID": 464, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 438 Jewish Women in Contemporary America (5) I&amp;S, DIV</b><i> Friedman</i><br/>Examines how Jewish women's identities are socially constructed and transformed in contemporary America, using social histories, memoirs, and ethnographies to analyze scholars' approaches to Jewish women's lives. Topics include the role of social class, religion, migration, the Holocaust, and race relations in Jewish women's lives. ", "course_name": "GWSS 438", "choice_prereqs": [], "course_id": "gwss438", "numCID": 438, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 462 Isak Dinesen and Karen Blixen (5) VLPA</b><br/>The fiction of Isak Dinesen (pseudonym for Karen Blixen) reevaluated in light of current issues in literary criticism, particularly feminist criticism. Close readings of selected tales, essays, and criticism. ", "course_name": "GWSS 462", "choice_prereqs": [], "course_id": "gwss462", "numCID": 462, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 450 Language and Gender (5) VLPA/I&amp;S, DIV</b><i> L. BILANIUK</i><br/>Survey of the theoretical trends, methods, and research findings on the relationship between language and gender. Focus on power relations in gendered language use. Extensive study of research based on conversational analysis. ", "course_name": "GWSS 450", "choice_prereqs": [["ling201", "ling203", "anth203"]], "course_id": "gwss450", "numCID": 450, "reg_prereqs": ["ling200"]}, {"course_info": "<p><b>GWSS 451 Latina Cultural Production (5) VLPA/I&amp;S</b><br/>Explores the expressive culture of Chicana/Mexican American/Latina women in the United States. Cultural and artistic practices in home and in literary, music, film, spoken word, performing and visual arts. Focuses on how Chicana/Latina writers and artists re-envision traditional iconography.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS451\" target=\"_blank\">View course details in MyPlan: GWSS 451</a></p", "course_name": "GWSS 451", "choice_prereqs": [], "course_id": "gwss451", "numCID": 451, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 200 Introduction to Women Studies (5) I&amp;S, DIV</b><br/>Feminist analysis of the construction and enforcement of gender differences and gender inequalities in various contexts. Emphasis on the intersection of race, class, sexuality, and nationality in the lives of women. Topics include feminist theory, motherhood, popular culture, sexual autonomy, racism, and activism in the United States, Asia, Latin America. Offered: AWSpS.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS200\" target=\"_blank\">View course details in MyPlan: GWSS 200</a></p", "course_name": "GWSS 200", "choice_prereqs": [], "course_id": "gwss200", "numCID": 200, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 435 Gender and Spirituality (5) I&amp;S</b><br/>Exploration of ways in which gender informs spiritual teachings and practices of different groups in ancient and contemporary times, with particular attention to the relationship between spiritual beliefs and the construction of social, psychological, and political realities.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS435\" target=\"_blank\">View course details in MyPlan: GWSS 435</a></p", "course_name": "GWSS 435", "choice_prereqs": [], "course_id": "gwss435", "numCID": 435, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 454 Women, Words, Music, and Change (5) VLPA/I&amp;S, DIV</b><br/>Comparative analysis of use of myths, tales, music, and other forms of expressive culture to account for, reinforce, and change women's status and roles. ", "course_name": "GWSS 454", "choice_prereqs": [], "course_id": "gwss454", "numCID": 454, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 455 Contemporary Feminist Theory (5) I&amp;S, DIV</b><br/>Raises the question of how political contexts condition the way some ideas become theory. Emphasizes the present crises in thinking about a transnational feminism. ", "course_name": "GWSS 455", "choice_prereqs": [], "course_id": "gwss455", "numCID": 455, "reg_prereqs": ["gwss200"]}, {"course_info": "<p><b>GWSS 456 Feminism, Racism, and Anti-Racism (5) I&amp;S, DIV</b><br/>Examines meaning of racism and feminism in women's lives in an international context. Building upon an analysis of racial hierarchies and institutionalized racism, explores strategies used by women engaged in feminist and anti-racist activism. ", "course_name": "GWSS 456", "choice_prereqs": [], "course_id": "gwss456", "numCID": 456, "reg_prereqs": ["gwss200"]}, {"course_info": "<p><b>GWSS 457 Women in China to 1800 (5) I&amp;S, DIV</b><br/>Gender in Chinese culture, women's situations in the patrilineal family system, and the ways women's situations changed as other dimensions of China's political system, economy, and culture changed from early times through the nineteenth century. ", "course_name": "GWSS 457", "choice_prereqs": [], "course_id": "gwss457", "numCID": 457, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 392 Asian American and Pacific Islander Women (5) I&amp;S, DIV</b><br/>Explores the intersection of race, ethnicity, gender, class, and sexuality in the lives of Asian American and Pacific Islander women. Examines how forces such as immigration, colonialism, sovereignty, labor, family, gender roles and relations, community, war, homeland politics, transnationalism, and social movements shaped and were shaped by these women. ", "course_name": "GWSS 392", "choice_prereqs": [], "course_id": "gwss392", "numCID": 392, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 390 Intermediate Topics in Gender, Women, and Sexuality Studies (5, max. 15) I&amp;S</b><br/>Exploration of various topics and issues relevant to the study of gender, women, and sexuality.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS390\" target=\"_blank\">View course details in MyPlan: GWSS 390</a></p", "course_name": "GWSS 390", "choice_prereqs": [], "course_id": "gwss390", "numCID": 390, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 290 Special Topics in Women Studies (2-5, max. 15) I&amp;S</b><br/>Exploration of specific problems and issues relevant to the study of women. Offered by visiting or resident faculty members.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS290\" target=\"_blank\">View course details in MyPlan: GWSS 290</a></p", "course_name": "GWSS 290", "choice_prereqs": [], "course_id": "gwss290", "numCID": 290, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 494 Women Studies Capstone (5) I&amp;S</b><br/>Provides graduating seniors with the opportunity to demonstrate facility with writing, critical thinking, documentation of scholarly work, research/gathering of information, and the ability to disseminate ideas to intended audiences via the creation of a capstone project. ", "course_name": "GWSS 494", "choice_prereqs": [], "course_id": "gwss494", "numCID": 494, "reg_prereqs": ["gwss200", "gwss300"]}, {"course_info": "<p><b>GWSS 299 Women Studies Colloquium (2) I&amp;S</b><br/>Introduces the discipline of Gender, Women, and Sexuality Studies to new and potential majors and minors. Credit/no-credit only.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS299\" target=\"_blank\">View course details in MyPlan: GWSS 299</a></p", "course_name": "GWSS 299", "choice_prereqs": [], "course_id": "gwss299", "numCID": 299, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 334 Gender, Sex, and Religion (5) I&amp;S, DIV</b><i> M. AHUVIA</i><br/>The Bible and its interpreters invented the gender categories and hierarchies that readers take for granted. Employs academic approaches that illuminate the construction of those categories and explores the debates within Judaism and Christianity as well as within academia today about gender, sex, sexuality, and religion. ", "course_name": "GWSS 334", "choice_prereqs": [], "course_id": "gwss334", "numCID": 334, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 417 The Politics of Talent Development (5) I&amp;S</b><br/>Investigation of the psychological, cultural, socioeconomic, and political factors that enhance or inhibit the development of exceptional ability, focusing principally, but not exclusively, on women and girls. Pays special attention to issues of race, class, gender, geography, and an individual's orientation to the mainstream of her culture.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS417\" target=\"_blank\">View course details in MyPlan: GWSS 417</a></p", "course_name": "GWSS 417", "choice_prereqs": [], "course_id": "gwss417", "numCID": 417, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 256 Feminist Exploration Series (2-5, max. 6) I&amp;S</b><br/>Explores special topics developed and presented by an upper division Gender, Women, and Sexuality Studies major under the supervision of a faculty member. ", "course_name": "GWSS 256", "choice_prereqs": [], "course_id": "gwss256", "numCID": 256, "reg_prereqs": ["gwss200"]}, {"course_info": "<p><b>GWSS 257 Psychology of Gender (5) I&amp;S, DIV</b><i> Kenney</i><br/>Major psychological theories of gender-role development; biological and environmental influences that determine and maintain gender differences in behavior; roles in children and adults; topics include aggression, cognitive abilities, achievement motivation, affiliation. ", "course_name": "GWSS 257", "choice_prereqs": [], "course_id": "gwss257", "numCID": 257, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 487 Advanced Psychobiology of Women (5) I&amp;S/NW</b><br/>Intensive reading on current issues relevant to women's psychology and physiology. ", "course_name": "GWSS 487", "choice_prereqs": [["psych357", "gwss357"]], "course_id": "gwss487", "numCID": 487, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 255 Masculinities: Contestation, Circulation, and Transformation (5) I&amp;S, DIV</b><br/>Looks at different ways that masculinity is understood and represented historically and contemporarily. While primarily U.S. based, also attends to how different styles of masculinity travel via immigration and media. Explores the relationship between men, masculinity, and other social movements (e.g. anti-violence, gay rights).<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/GWSS255\" target=\"_blank\">View course details in MyPlan: GWSS 255</a></p", "course_name": "GWSS 255", "choice_prereqs": [], "course_id": "gwss255", "numCID": 255, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 453 Lesbian Lives and Culture (5) I&amp;S</b><br/>An exploration and overview of lesbianism in historical, social, cultural, and interpersonal contexts. ", "course_name": "GWSS 453", "choice_prereqs": [["gwss200", "gwss206"]], "course_id": "gwss453", "numCID": 453, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 339 Social Movements in Contemporary India (5) I&amp;S, DIV</b><i> P. RAMAMURTHY</i><br/>Covers issues of social change, economic development, and identity politics in contemporary India studied through environmental and women's movements. Includes critiques of development and conflicts over forests, dams, women's rights, religious community, ethnicity, and citizenship. ", "course_name": "GWSS 339", "choice_prereqs": [], "course_id": "gwss339", "numCID": 339, "reg_prereqs": []}, {"course_info": "<p><b>GWSS 341 Native Women in the Americas (5) I&amp;S</b><br/>Historiography, sociology, biography, autobiography, and fiction about native women in the United States and Canada. ", "course_name": "GWSS 341", "choice_prereqs": [], "course_id": "gwss341", "numCID": 341, "reg_prereqs": []}], "links": [{"source": 57, "target": 40}, {"source": 43, "target": 40}, {"source": 57, "target": 43}, {"source": 57, "target": 44}, {"source": 43, "target": 44}, {"source": 57, "target": 45}, {"source": 43, "target": 45}, {"source": 57, "target": 46}, {"source": 43, "target": 46}, {"source": 57, "target": 50}, {"source": 57, "target": 60}, {"source": 57, "target": 61}, {"source": 57, "target": 66}, {"source": 43, "target": 66}, {"source": 57, "target": 70}]}