{"nodes": [{"course_id": "indo113", "reg_prereqs": ["indo112"], "numCID": 113, "choice_prereqs": [], "course_info": "<p><b>INDO 113 Elementary Indonesian (5)</b><br/>Introduction to modern standard Indonesian. Emphasis on grammar and conversational drills. Practice with basic phonological, morphological, and syntactic structures. Third in a sequence of three. "}, {"course_id": "indo112", "reg_prereqs": ["indo111"], "numCID": 112, "choice_prereqs": [], "course_info": "<p><b>INDO 112 Elementary Indonesian (5)</b><br/>Introduction to modern standard Indonesian. Emphasis on grammar and conversational drills. Practice with basic phonological, morphological, and syntactic structures. Second in a sequence of three. "}, {"course_id": "indo111", "reg_prereqs": [], "numCID": 111, "choice_prereqs": [], "course_info": "<p><b>INDO 111 Elementary Indonesian (5)</b><br/>Introduction to modern standard Indonesian. Emphasis on grammar and conversational drills. Practice with basic phonological, morphological, and syntactic structures. First in a sequence of three. Offered: A.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/INDO111\" target=\"_blank\">View course details in MyPlan: INDO 111</a></p"}, {"course_id": "indo499", "reg_prereqs": [], "numCID": 499, "choice_prereqs": [], "course_info": "<p><b>INDO 499 Undergraduate Research (3-5, max. 15)</b><br/>Primarily for Southeast Asian studies majors. Offered: AWSpS.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/INDO499\" target=\"_blank\">View course details in MyPlan: INDO 499</a></p"}, {"course_id": "indo311", "reg_prereqs": ["indo213"], "numCID": 311, "choice_prereqs": [], "course_info": "<p><b>INDO 311 Advanced Indonesian (5) VLPA</b><br/>Expanding vocabulary; preparing for research work using original sources; improving reading fluency in modern standard written Indonesian using novels, short stories, newspapers, and other authentic materials. Conversation practice centers on discussion of readings. Writing compositions. First in a sequence of three. "}, {"course_id": "indo313", "reg_prereqs": ["indo312"], "numCID": 313, "choice_prereqs": [], "course_info": "<p><b>INDO 313 Advanced Indonesian (5) VLPA</b><br/>Expanding vocabulary; preparing for research work using original sources; improving reading fluency in modern standard written Indonesian using novels, short stories, newspapers, and other authentic materials. Conversation practice centers on discussion of readings. Writing compositions. Third in a sequence of three. "}, {"course_id": "indo312", "reg_prereqs": ["indo311"], "numCID": 312, "choice_prereqs": [], "course_info": "<p><b>INDO 312 Advanced Indonesian (5) VLPA</b><br/>Expanding vocabulary; preparing for research work using original sources; improving reading fluency in modern standard written Indonesian using novels, short stories, newspapers, and other authentic materials. Conversation practice centers on discussion of readings. Writing compositions. Second in a sequence of three. "}, {"course_id": "indo211", "reg_prereqs": ["indo113"], "numCID": 211, "choice_prereqs": [], "course_info": "<p><b>INDO 211 Intermediate Indonesian (5) VLPA</b><br/>Review/expansion of fundamental grammatical patterns: morphological and syntactic structures, development of conversational skills, reading some literary and cultural materials, writing compositions. First in a sequence of three. "}, {"course_id": "indo212", "reg_prereqs": ["indo211"], "numCID": 212, "choice_prereqs": [], "course_info": "<p><b>INDO 212 Intermediate Indonesian (5) VLPA</b><br/>Review/expansion of fundamental grammatical patterns: morphological and syntactic structures, development of conversational skills, reading some literary and cultural materials, writing compositions. Second in a sequence of three. "}, {"course_id": "indo213", "reg_prereqs": ["indo212"], "numCID": 213, "choice_prereqs": [], "course_info": "<p><b>INDO 213 Intermediate Indonesian (5) VLPA</b><br/>Review/expansion of fundamental grammatical patterns: morphological and syntactic structures, development of conversational skills, reading some literary and cultural materials, writing compositions. Third in a sequence of three. "}], "links": [{"source": 1, "target": 0}, {"source": 2, "target": 1}, {"source": 9, "target": 4}, {"source": 6, "target": 5}, {"source": 4, "target": 6}, {"source": 0, "target": 7}, {"source": 7, "target": 8}, {"source": 8, "target": 9}]}