{"nodes": [{"course_info": "<p><b>KYRGYZ 101 Elementary Kyrgyz (5)</b><br/>Emphasizes the four basic language skills: listening, speaking, reading, and writing in Kyrgyz. Focuses on exchanging real-life information in the context of the native-speaking environment and understanding Kyrgyz language through the cultural contexts. First in a sequence of three.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/KYRGYZ101\" target=\"_blank\">View course details in MyPlan: KYRGYZ 101</a></p", "course_name": "KYRGYZ 101", "choice_prereqs": [], "course_id": "kyrgyz101", "numCID": 101, "reg_prereqs": [], "is_prereq_for": ["kyrgyz102"]}, {"course_info": "<p><b>KYRGYZ 102 Elementary Kyrgyz (5)</b><br/>Emphasizes the four basic language skills: listening, speaking, reading, and writing in Kyrgyz. Focuses on exchanging real-life information in the context of the native-speaking environment and understanding Kyrgyz language through the cultural contexts.  Second in a sequence of three. ", "course_name": "KYRGYZ 102", "choice_prereqs": [], "course_id": "kyrgyz102", "numCID": 102, "reg_prereqs": ["kyrgyz101"], "is_prereq_for": ["kyrgyz103"]}, {"course_info": "<p><b>KYRGYZ 103 Elementary Kyrgyz (5)</b><br/>Emphasizes the four basic language skills: listening, speaking, reading, and writing in Kyrgyz. Focuses on exchanging real-life information in the context of the native-speaking environment and understanding Kyrgyz language through the cultural contexts.  Third in a sequence of three. ", "course_name": "KYRGYZ 103", "choice_prereqs": [], "course_id": "kyrgyz103", "numCID": 103, "reg_prereqs": ["kyrgyz102"], "is_prereq_for": ["kyrgyz201"]}, {"course_info": "<p><b>KYRGYZ 203 Intermediate Kyrgyz (5) VLPA</b><br/>Designed to strengthen and develop further skills in listening, speaking, reading, and writing and to deepen an understanding of the cultural context of Kyrgyz. Emphasis on the expansion and refinement of linguistic and communicative skills learned in elementary Kyrgyz.  Third in a sequence of three. ", "course_name": "KYRGYZ 203", "choice_prereqs": [], "course_id": "kyrgyz203", "numCID": 203, "reg_prereqs": ["kyrgyz202"], "is_prereq_for": []}, {"course_info": "<p><b>KYRGYZ 202 Intermediate Kyrgyz (5) VLPA</b><br/>Designed to strengthen and develop further skills in listening, speaking, reading, and writing and to deepen an understanding of the cultural context of Kyrgyz. Emphasis on the expansion and refinement of linguistic and communicative skills learned in elementary Kyrgyz.  Second in a sequence of three. ", "course_name": "KYRGYZ 202", "choice_prereqs": [], "course_id": "kyrgyz202", "numCID": 202, "reg_prereqs": ["kyrgyz201"], "is_prereq_for": ["kyrgyz203"]}, {"course_info": "<p><b>KYRGYZ 201 Intermediate Kyrgyz (5) VLPA</b><br/>Designed to strengthen and develop further skills in listening, speaking, reading, and writing and to deepen an understanding of the cultural context of Kyrgyz. Emphasis on the expansion and refinement of linguistic and communicative skills learned in elementary Kyrgyz.  First in a sequence of three. ", "course_name": "KYRGYZ 201", "choice_prereqs": [], "course_id": "kyrgyz201", "numCID": 201, "reg_prereqs": ["kyrgyz103"], "is_prereq_for": ["kyrgyz202"]}], "links": [{"source": 0, "target": 1}, {"source": 1, "target": 2}, {"source": 4, "target": 3}, {"source": 5, "target": 4}, {"source": 2, "target": 5}]}