{"nodes": [{"course_id": "lsj467", "reg_prereqs": [], "numCID": 467, "choice_prereqs": [], "course_info": "<p><b>LSJ 467 Law, Justice, and the Environment (5) I&amp;S</b><i> S. HERBERT</i><br/>Examines the role law plays in shaping environmental policy. Challenges student to understand how environmental concerns are translated into legal discourse, and covers several typical issues that emerge in environmental law. Centers on active discussions. "}, {"course_id": "lsj469", "reg_prereqs": [], "numCID": 469, "choice_prereqs": [], "course_info": "<p><b>LSJ 469 Law and Rights in Authoritarian Regimes (5) I&amp;S</b><i> S. WHITING</i><br/>Explores role of law and courts and nature of rights in authoritarian regimes. Questions addressed include why authoritarian regimes promote \"rule-of-law\", who is empowered by law, and the political consequences of \"rule-of-law' promotion. "}, {"course_id": "lsj331", "reg_prereqs": [], "numCID": 331, "choice_prereqs": [], "course_info": "<p><b>LSJ 331 The Politics of Race and Ethnicity in the United States (5) I&amp;S, DIV</b><i> M. FRANCIS</i><br/>Introduction to the history and development of racial hierarchy, focusing on how race and ethnicity shape political institutions (e.g., the Constitution, political parties, voting systems). Examination of political relationships between Whites, African Americans, Latinos, and Asian Americans. Case studies of minority representation and the politics of welfare, crime, immigration, and terrorism. "}, {"course_id": "lsj330", "reg_prereqs": [], "numCID": 330, "choice_prereqs": [], "course_info": "<p><b>LSJ 330 Beyond Civil Rights: Law, Culture, and Change (5) I&amp;S</b><br/>Assessment of the contemporary politics of civil rights as shaped by an identity politics that is both significant and passe. "}, {"course_id": "lsj332", "reg_prereqs": [], "numCID": 332, "choice_prereqs": [], "course_info": "<p><b>LSJ 332 Disability and Society (5) I&amp;S</b><br/>Concentrates on contemporary issues in disability studies, focusing on the thematic frameworks of rights, identities, values, and science/medicine. "}, {"course_id": "lsj428", "reg_prereqs": [], "numCID": 428, "choice_prereqs": [], "course_info": "<p><b>LSJ 428 Women's Rights in an Integrated Europe (5) I&amp;S</b><br/>Examines the transformation in women's rights policy within the European community from the late 1950s through the present. Focuses on the legal rules and bodies that govern not only these policy domains, but also their evolution and impacts. "}, {"course_id": "lsj425", "reg_prereqs": [], "numCID": 425, "choice_prereqs": [], "course_info": "<p><b>LSJ 425 Domesticating International Human Rights: Perspectives on U.S. Asylum and Refugee Law (5) I&amp;S, DIV</b><i> A. OSANLOO</i><br/>Examines the creation, production, and proliferation of law and legal categories relating to the status of refugees and asylum-seekers in the United States. Integrates anthropological perspectives of law's ability to create meaning in the examination of deeper implications of asylum and refugee law in American society. "}, {"course_id": "lsj426", "reg_prereqs": [], "numCID": 426, "choice_prereqs": [["lsj320", "ls368", "lsj321", "anth323", "lsj322", "sa324", "phil338"]], "course_info": "<p><b>LSJ 426 Reconciliation: The Politics of Forgiveness in a Global Age (5) I&amp;S, DIV</b><i> A. OSANLOO</i><br/>Draws on history of post-World War II conflict. Analyzes international mechanisms for reconciliation alongside philosophical and moral consideration. Combines occidental moral philosophies of secular human rights rooted with local knowledge and value systems. Surveys faith-based epistemologies underlying reconciliation processes. "}, {"course_id": "lsj421", "reg_prereqs": [], "numCID": 421, "choice_prereqs": [], "course_info": "<p><b>LSJ 421 Women's Rights and Politics in Islamic Society (5) I&amp;S, DIV</b><i> A. OSANLOO</i><br/>Human rights theory with women's legal rights and practice within context of the Islamic state. Introduction to debates regarding universality of human rights through examination of women's rights in Muslim context. Considers journalistic notions of homogeneity among Muslims, political nature of the Islamic state, and its mobilization of human rights. "}, {"course_id": "lsj420", "reg_prereqs": [], "numCID": 420, "choice_prereqs": [], "course_info": "<p><b>LSJ 420 The Politics of Rights (5) I&amp;S</b><i> M. McCann</i><br/>Examines rights in practical and social interaction, rights as social conventions, relations of rights practices to official state policies, disputing practices, interest formation, and identity construction at individual and group levels. Explores how rights practices figure into the constellation of contested power relations within modern societies.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ420\" target=\"_blank\">View course details in MyPlan: LSJ 420</a></p"}, {"course_id": "lsj422", "reg_prereqs": [], "numCID": 422, "choice_prereqs": [], "course_info": "<p><b>LSJ 422 Immigrants, Labor, and Legality (5) I&amp;S, DIV</b><i> C. PINEDO-TURNOVSKY</i><br/>Provides sociological examination of working immigrants in the United States. Focuses on how immigration and labor legislation shape context of working, worker identity, and rights. Topics include federal and state legislation, employee classification, division of labor, skilled/unskilled, flexibility, legal status, organizing, and relationship to race and gender ideology in shaping contexts of working and rights.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ422\" target=\"_blank\">View course details in MyPlan: LSJ 422</a></p"}, {"course_id": "lsj401", "reg_prereqs": [], "numCID": 401, "choice_prereqs": [], "course_info": "<p><b>LSJ 401 Field Experience in Law, Societies, and Justice (5)</b><i> S. HERBERT</i><br/>Participant observation in a public or private agency relevant to the study of law, justice, human rights, or court systems.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ401\" target=\"_blank\">View course details in MyPlan: LSJ 401</a></p"}, {"course_id": "lsj489", "reg_prereqs": [], "numCID": 489, "choice_prereqs": [], "course_info": "<p><b>LSJ 489 Honors in Law, Societies, and Justice (-[1-5], max. 5) I&amp;S</b><br/>Thesis research honors option. Second of a two-course hyphenated sequence. To be completed with LSJ 488.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ489\" target=\"_blank\">View course details in MyPlan: LSJ 489</a></p"}, {"course_id": "lsj200", "reg_prereqs": [], "numCID": 200, "choice_prereqs": [], "course_info": "<p><b>LSJ 200 Introduction to Law, Societies, and Justice (5) I&amp;S</b><i> K. BECKETT, S. HERBERT</i><br/>Explores the central role of law in social processes; investigates the primary types of legal regimes and compares them across different national and international contexts; contrasts legal with non-legal forms of social ordering; investigates the structure and practice of human rights law.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ200\" target=\"_blank\">View course details in MyPlan: LSJ 200</a></p"}, {"course_id": "lsj480", "reg_prereqs": [], "numCID": 480, "choice_prereqs": [], "course_info": "<p><b>LSJ 480 Policing Modern Society (5) I&amp;S</b><i> J. WENDER</i><br/>Explores institution and practices of police in context of the rise of modern society, and considers the expanding presence of the police in everyday modern life. Topics include: history of policing, changing roles of police, police reform, and ethical dilemmas intrinsic to the police function.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ480\" target=\"_blank\">View course details in MyPlan: LSJ 480</a></p"}, {"course_id": "lsj363", "reg_prereqs": [], "numCID": 363, "choice_prereqs": [], "course_info": "<p><b>LSJ 363 Law in Society (5) I&amp;S</b><br/>Inquiry into how law matters in social practice. Examines general theories of law, the workings of legal institutions, and the character of legally constituted practices and relationships in diverse terrains of social life. Instructor: McCann. "}, {"course_id": "lsj360", "reg_prereqs": [], "numCID": 360, "choice_prereqs": [], "course_info": "<p><b>LSJ 360 Introduction to United States Constitutional Law (5) I&amp;S</b><i> G. LOVELL</i><br/>Growth and development of the United States Constitution as reflected in decisions of the Supreme Court; political, social, and economic effects. "}, {"course_id": "lsj361", "reg_prereqs": [], "numCID": 361, "choice_prereqs": [], "course_info": "<p><b>LSJ 361 United States Courts and Civil Liberty (5) I&amp;S</b><i> G. LOVELL</i><br/>Cases and literature bearing on protection of constitutionally guaranteed private rights, with particular reference to the period since 1937. "}, {"course_id": "lsj366", "reg_prereqs": [], "numCID": 366, "choice_prereqs": [], "course_info": "<p><b>LSJ 366 Comparative Law and Legal Cultures (5) I&amp;S</b><i> G. BARZILAI</i><br/>Explores global issues of comparative law, societies, politics, courts, and cultures. Introduces theories and methods of comparing legal settings internationally and understating diverse responses to law. Covers what is comparative law; families of law; history of comparative law; judicial review; legal cultures; rights consciousness; and regulation. Can not be taken for credit if student has already taken LSJ/POL S 367. "}, {"course_id": "lsj367", "reg_prereqs": [], "numCID": 367, "choice_prereqs": [], "course_info": "<p><b>LSJ 367 Comparative Law and Courts (5) I&amp;S</b><i> R. CICHOWSKI</i><br/>Introduction to comparative judicial politics, focusing on the relationship between law and politics in cross-national perspective, as well as on the functioning of supranational and international legal entities in the international system. May not be taken for credit if student has taken LSJ/JSIS B 366. "}, {"course_id": "lsj327", "reg_prereqs": [], "numCID": 327, "choice_prereqs": [], "course_info": "<p><b>LSJ 327 Women's Rights as Human Rights (5) I&amp;S, DIV</b><i> R. CICHOWSKI</i><br/>Women's rights in comparative perspective, focusing on varying settings that alter the meaning and practical application. Domestic level: areas including abortion politics to trafficking in women. International level: areas including equality claims before European supranational judicial bodies, rape as war crime in international law. "}, {"course_id": "lsj476", "reg_prereqs": [], "numCID": 476, "choice_prereqs": [], "course_info": "<p><b>LSJ 476 Miscarriages of Justice (5) I&amp;S</b><br/>Examines legal and social factors that shape criminal case outcomes, analyzing how one type of miscarriage of justice - wrongful conviction - occurs. How can cases of wrongful conviction be explained? Why are some people, against whom there is only weak evidence, convicted-and sometimes even executed? "}, {"course_id": "lsj474", "reg_prereqs": [], "numCID": 474, "choice_prereqs": [], "course_info": "<p><b>LSJ 474 Geography and the Law (5) I&amp;S</b><i> S. HERBERT</i><br/>Examines the relationship between geography, law, and socio-legal analysis; reviews significant instances where law and geography intersect, such as the regulation of public space, the regulation of borders and mobility, and disputes over property and land use. "}, {"course_id": "lsj329", "reg_prereqs": [], "numCID": 329, "choice_prereqs": [], "course_info": "<p><b>LSJ 329 Immigration, Citizenship, and Rights (5) I&amp;S, DIV</b><i> C. PINEDO-TURNOVSKY</i><br/>A sociological examination of citizenship. Focus on how immigration law and polices shape divers meanings, practices, and statues, of citizenship in varied context, Topics include migration theories, state control, stage of legal status, relationship to race and gender ideology, as well as labor and civil society, in shaping membership and rights.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ329\" target=\"_blank\">View course details in MyPlan: LSJ 329</a></p"}, {"course_id": "lsj301", "reg_prereqs": [], "numCID": 301, "choice_prereqs": [], "course_info": "<p><b>LSJ 301 Internship (1-5, max. 5)</b><br/>Participation in an approved internship. Credit/no-credit only.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ301\" target=\"_blank\">View course details in MyPlan: LSJ 301</a></p"}, {"course_id": "lsj456", "reg_prereqs": [], "numCID": 456, "choice_prereqs": [], "course_info": "<p><b>LSJ 456 Institutional Failure (5) I&amp;S</b><i> R. THORPE</i><br/>Examines why political institutions fail to achieve their goals or operate in a manner they were originally intended to, and the consequences of these failures. Topics include the national security establishment, the drug war, concentrated poverty, mass incarceration, and inner-city schools. "}, {"course_id": "lsj376", "reg_prereqs": [], "numCID": 376, "choice_prereqs": [], "course_info": "<p><b>LSJ 376 Drugs and Society (5) I&amp;S</b><i> K. BECKETT, J. WENDER</i><br/>Explores the questions of drug use and abuse, social and political factors that shape response to their use, and the social conditions under which drug use is likely to have adverse consequences. Also covers U.S. drug control policy, the political economy of legal and illegal drugs, and political aspects of drug use. "}, {"course_id": "lsj322", "reg_prereqs": [], "numCID": 322, "choice_prereqs": [], "course_info": "<p><b>LSJ 322 Human Rights in Latin America (5) I&amp;S, DIV</b><i> A. GODOY</i><br/>Overview of human rights issues and their recent evolution in Latin American history; military dictatorships; contemporary challenges in the region's democracies. Human rights concerns in relation to broader sociopolitical context. "}, {"course_id": "lsj320", "reg_prereqs": [], "numCID": 320, "choice_prereqs": [], "course_info": "<p><b>LSJ 320 The Politics and Law of International Human Rights (5) I&amp;S, DIV</b><i> J. MAYERFELD</i><br/>Studies the international human rights movement in its legal and political context. Focuses on institutions which influence, enable, and constrain the international promotion of human rights. "}, {"course_id": "lsj321", "reg_prereqs": [], "numCID": 321, "choice_prereqs": [], "course_info": "<p><b>LSJ 321 Human Rights Law in Culture and Practice (5) I&amp;S, DIV</b><i> A. OSANLOO</i><br/>Introduces the complexities of issues surrounding human rights. Examines human rights concerns through critical analyses, taking into account legal, social, economic, and historical variables. "}, {"course_id": "lsj380", "reg_prereqs": [], "numCID": 380, "choice_prereqs": [], "course_info": "<p><b>LSJ 380 Contemporary Issues in Comparative Legal Institutions (5, max. 10) I&amp;S</b><br/>Covers theoretical, empirical, and comparative aspects of such topics as socio-legal concepts, justice, legal policies, and the institutions of law.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ380\" target=\"_blank\">View course details in MyPlan: LSJ 380</a></p"}, {"course_id": "lsj381", "reg_prereqs": [], "numCID": 381, "choice_prereqs": [], "course_info": "<p><b>LSJ 381 Contemporary Issues in Rights (5, max. 10) I&amp;S</b><br/>Studies the theoretical, empirical, and comparative aspects of such topics as human rights, civil rights, and legal change.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ381\" target=\"_blank\">View course details in MyPlan: LSJ 381</a></p"}, {"course_id": "lsj438", "reg_prereqs": [], "numCID": 438, "choice_prereqs": [], "course_info": "<p><b>LSJ 438 Human Rights &amp; Internatioanl Development (5) I&amp;S, DIV</b><i> S. MEYERS</i><br/>Focuses on recent theoretical debates and innovations in the practice of applying human rights principles to international development. Uses case studies of groups historically marginalized in development policies, such as persons with disabilities, indigenous peoples, and older persons to understand the usefulness of course concepts.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ438\" target=\"_blank\">View course details in MyPlan: LSJ 438</a></p"}, {"course_id": "lsj437", "reg_prereqs": [], "numCID": 437, "choice_prereqs": [], "course_info": "<p><b>LSJ 437 Crime, Law, and Mental Illness (5) I&amp;S, DIV</b><br/>Explores experiences of those with mental illness in the criminal justice system and involuntary civil commitment system. Emphasis on societal responses including the emergence of therapeutic courts and specialized police training. Examines how courts, legislature, and communities balance public safety and civil liberties. "}, {"course_id": "lsj434", "reg_prereqs": [], "numCID": 434, "choice_prereqs": [], "course_info": "<p><b>LSJ 434 Civil and Human Rights Law for Disabled People (5) I&amp;S, DIV</b><i> Brown</i><br/>Expands knowledge of civil and human rights for disabled people. Examines the American perspective (ADA) as well as various international models including the United Nations' International Human Rights treaties as they relate to disabled people. "}, {"course_id": "lsj444", "reg_prereqs": [], "numCID": 444, "choice_prereqs": [], "course_info": "<p><b>LSJ 444 Ethics in Law and Justice (5) I&amp;S</b><br/>Applies ethical theories, research, and practice to the law and justice system, with the goals of: (1) analyzing the moral dimensions of criminal law; (2) studying ethical issues in law enforcement, adjudications, and corrections; and (3) examining a variety of controversial ethical issues associated with the justice system.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ444\" target=\"_blank\">View course details in MyPlan: LSJ 444</a></p"}, {"course_id": "lsj433", "reg_prereqs": [], "numCID": 433, "choice_prereqs": [], "course_info": "<p><b>LSJ 433 Disability Law, Policy, and the Community I&amp;S (5) I&amp;S, DIV</b><br/>Addresses the history of legal rights of disabled people, U. S. disability policy, and the role of community activism and other forces in policy development and systems change. Introduces the existing social service system that affects disabled people. "}, {"course_id": "lsj430", "reg_prereqs": [], "numCID": 430, "choice_prereqs": [["d/lsj230", "sst332", "sst433", "sst434"]], "course_info": "<p><b>LSJ 430 Topics in Disability Studies (1-5, max. 15) I&amp;S</b><br/>Theoretical, critical, analytical, or comparative examination of an issue or issues in Disability Studies. Topics vary. "}, {"course_id": "lsj490", "reg_prereqs": [], "numCID": 490, "choice_prereqs": [], "course_info": "<p><b>LSJ 490 Special Topics in Comparative Legal Institutions (1-5, max. 15) I&amp;S</b><br/>Focused, comparative examination of legal institutions.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ490\" target=\"_blank\">View course details in MyPlan: LSJ 490</a></p"}, {"course_id": "lsj491", "reg_prereqs": [], "numCID": 491, "choice_prereqs": [], "course_info": "<p><b>LSJ 491 Special Topics in Rights (1-5, max. 15) I&amp;S</b><br/>Focused, comparative examination of topics in rights.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ491\" target=\"_blank\">View course details in MyPlan: LSJ 491</a></p"}, {"course_id": "lsj495", "reg_prereqs": [], "numCID": 495, "choice_prereqs": [], "course_info": "<p><b>LSJ 495 Study Abroad-Law, Societies, and Justice (3-5, max. 15) I&amp;S</b><br/>Comparative studies abroad of legal institutions, rights, and justice as related to national settings. Specific course content determined by faculty member.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ495\" target=\"_blank\">View course details in MyPlan: LSJ 495</a></p"}, {"course_id": "lsj499", "reg_prereqs": [], "numCID": 499, "choice_prereqs": [], "course_info": "<p><b>LSJ 499 Readings in Law, Societies, and Justice (1-5, max. 10)</b><br/>Individual readings in law, societies, and justice.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ499\" target=\"_blank\">View course details in MyPlan: LSJ 499</a></p"}, {"course_id": "lsj488", "reg_prereqs": [], "numCID": 488, "choice_prereqs": [], "course_info": "<p><b>LSJ 488 Honors in Law, Societies, and Justice (5-)</b><br/>First of a two-course hyphenated sequence. To be completed with LSJ 489.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ488\" target=\"_blank\">View course details in MyPlan: LSJ 488</a></p"}, {"course_id": "lsj370", "reg_prereqs": [], "numCID": 370, "choice_prereqs": [], "course_info": "<p><b>LSJ 370 Privacy (5) I&amp;S</b><i> S. Pekkanen</i><br/>Explores how individuals, corporations, and governments respond to privacy challenges in the digital age. Examines evolution of the idea of privacy using case studies of actual privacy policies, legal cases, and real-world situations. Covers legal, political, and social facets of this fundamental human issue. "}, {"course_id": "lsj375", "reg_prereqs": [], "numCID": 375, "choice_prereqs": [], "course_info": "<p><b>LSJ 375 Crime, Politics, and Justice (5) I&amp;S</b><i> J. WENDER</i><br/>Reviews the major components - police, courts, and corrections - of the U.S. criminal justice system; investigates critical factors that shape criminal procedure; considers the relationship between criminal procedure and wider concerns of justice.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ375\" target=\"_blank\">View course details in MyPlan: LSJ 375</a></p"}, {"course_id": "lsj377", "reg_prereqs": [], "numCID": 377, "choice_prereqs": [], "course_info": "<p><b>LSJ 377 Punishment: Theory and Practice (5) I&amp;S</b><br/>Examines the philosophical reasoning that underlies punishment practices such as sentencing, imprisonment, or capital punishment. Considers policy issues in these areas in light of theories about morality and human nature. Helps students learn how to analyze punishment policies from ethical and philosophical perspectives.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ377\" target=\"_blank\">View course details in MyPlan: LSJ 377</a></p"}, {"course_id": "lsj310", "reg_prereqs": [], "numCID": 310, "choice_prereqs": [], "course_info": "<p><b>LSJ 310 Research in Law, Societies, and Justice (1-5, max. 15) I&amp;S</b><br/>Supervised introductory individual and/or seminar-based research on some aspect of society and justice.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/LSJ310\" target=\"_blank\">View course details in MyPlan: LSJ 310</a></p"}, {"course_id": "lsj378", "reg_prereqs": [], "numCID": 378, "choice_prereqs": [], "course_info": "<p><b>LSJ 378 Policing the City (5) I&amp;S</b><i> S. HERBERT</i><br/>Investigates how and why formal and informal order is established in urban areas, how this order produces advantages and disadvantages, and possibilities of alternative visions of order. Topics include formal means of control (zoning, laws, policing, building codes) and informal means of control (gossip, ostracism, peer pressure, local politics). "}, {"course_id": "lsj230", "reg_prereqs": [], "numCID": 230, "choice_prereqs": [], "course_info": "<p><b>LSJ 230 Introduction to Disability Studies (5) I&amp;S, DIV</b><i> J. WOIAK</i><br/>Introduces the field of disability studies. Focuses on the theoretical questions of how society predominantly understands disability and the social justice consequences. Examines biological, social, cultural, political, and economic determinants in the framing of disability. "}], "links": []}