{"nodes": [{"course_id": "nbio405", "reg_prereqs": ["amath342"], "numCID": 405, "choice_prereqs": [], "course_info": "<p><b>NBIO 405 Neural Computation and Engineering Laboratory (3) NW</b><i> L. JOHNSON DYHR</i><br/>Introduces neural recording and quantitative analysis techniques to students with a background in quantitative methods. "}, {"course_id": "nbio404", "reg_prereqs": [], "numCID": 404, "choice_prereqs": [["nbio401"]], "course_info": "<p><b>NBIO 404 Neuropharmacology (3) NW</b><br/>Actions of drugs on the brain at clinical, cellular, and molecular levels. Therapeutic use of drugs in treatment of neurological and psychiatric diseases. Abuse of drugs and the mechanisms of addiction, tolerance, and withdrawal. "}, {"course_id": "nbio403", "reg_prereqs": [], "numCID": 403, "choice_prereqs": [["nbio401"]], "course_info": "<p><b>NBIO 403 Systems and Behavioral Neurobiology (3) NW</b><br/>Topics include information processing in sensory and motor systems, sensory-motor integration, learning, and memory. Using examples from the field of neuroethology, encourages students to work independently on problems taken from the recent neurobiological research literature. "}, {"course_id": "nbio402", "reg_prereqs": [], "numCID": 402, "choice_prereqs": [["nbio401"]], "course_info": "<p><b>NBIO 402 Diseases of the Nervous System (3) NW</b><br/>Introduces the basic mechanisms of mammalian nervous system function through the study of human neurological diseases that result from specific disruption of neuronal signaling. "}, {"course_id": "nbio401", "reg_prereqs": [], "numCID": 401, "choice_prereqs": [["nbio301"]], "course_info": "<p><b>NBIO 401 Systems Neurobiology (3) NW</b><br/>Introduces students to the anatomical and physiological organization of the major sensory, motor, and associative systems of the mammalian brain. Behavioral data used to stress functional integration of systems. Includes gross brain anatomy demonstration and computer tutorials. "}, {"course_id": "nbio450", "reg_prereqs": ["biol220"], "numCID": 450, "choice_prereqs": [], "course_info": "<p><b>NBIO 450 Current Research Literature in Neurobiology (2, max. 6) NW</b><br/>Weekly journal club in neurobiology. Students read and discuss original research articles in neurobiology, centered around a specific topic each quarter. "}, {"course_id": "nbio440", "reg_prereqs": ["nbio302"], "numCID": 440, "choice_prereqs": [], "course_info": "<p><b>NBIO 440 Topics in Current Neurobiology Research (2, max. 6) NW</b><br/>"}, {"course_id": "nbio499", "reg_prereqs": ["nbio302"], "numCID": 499, "choice_prereqs": [], "course_info": "<p><b>NBIO 499 Individual Research in Neurobiology (3-6, max. 18)</b><br/>Students carry out projects in laboratories of program faculty. "}, {"course_id": "nbio301", "reg_prereqs": [], "numCID": 301, "choice_prereqs": [["biol220"]], "course_info": "<p><b>NBIO 301 Introduction to Cellular and Molecular Neurobiology (5) NW</b><br/>Introduces students to the physiological and molecular properties of individual nerve cells and the synaptic connections between them, and to principles of nervous system development. Includes weekly laboratory sessions. "}, {"course_id": "nbio302", "reg_prereqs": ["nbio301"], "numCID": 302, "choice_prereqs": [], "course_info": "<p><b>NBIO 302 Introduction to Systems and Behavioral Neurobiology (3/5) NW</b><i> M. BOSMA, J. SISNEROS</i><br/>Introduces neuroethology, i.e., the mechanisms by which neurons and the synaptic connections among them produce sensory perceptions and complex behavioral outputs. Available with or without weekly laboratory sessions. "}, {"course_id": "nbio303", "reg_prereqs": ["math125"], "numCID": 303, "choice_prereqs": [], "course_info": "<p><b>NBIO 303 Neuronal Coding and Computation (1-3)</b><br/>Introduces computational neuroscience, focusing on concepts that are related to neuronal and synaptic biophysics. Works through mathematical concepts and methods to describe neuronal dynamics, and introduce methods to analyze and characterize neural coding. Uses Matlab as a programming language to implement models or neuronal dynamics to perform data analysis. "}, {"course_id": "nbio490", "reg_prereqs": [], "numCID": 490, "choice_prereqs": [], "course_info": "<p><b>NBIO 490 SEMINAR IN COMPUTATIONAL NEUROSCIENCE (1-3, max. 6) NW</b><br/>Supervised readings and group discussions in computational neuroscience. Credit/no-credit only.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/NBIO490\" target=\"_blank\">View course details in MyPlan: NBIO 490</a></p"}, {"course_id": "nbio496", "reg_prereqs": [], "numCID": 496, "choice_prereqs": [], "course_info": "<p><b>NBIO 496 Peer Teaching Facilitator in Neurobiology (5, max. 10)</b><i> M. KENNEDY</i><br/>For undergraduates assisting in Neurobiology courses as facilitators. Peer Facilitators assist with laboratories, attend lectures, and attend weekly course meetings, gaining direct course experience. Does not include independent teaching or grading. Credit/no-credit only. Offered: AW.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/NBIO496\" target=\"_blank\">View course details in MyPlan: NBIO 496</a></p"}], "links": [{"source": 9, "target": 6}, {"source": 9, "target": 7}, {"source": 8, "target": 9}]}