{"nodes": [{"course_info": "<p><b>PSYCH 449 ORGANIZATIONAL AND INDUSTRIAL PSYCHOLOGY (3) I&amp;S</b><br/>Examines research on human behavior in industrial and organizational environments. Topics include research methods, job analysis, the prediction of workplace performance, personnel selection and training, performance appraisal, group influences, job satisfaction, job motivation, leadership, and human factors. ", "course_name": "PSYCH 449", "choice_prereqs": [], "course_id": "psych449", "numCID": 449, "reg_prereqs": ["psych101"]}, {"course_info": "<p><b>PSYCH 448 Seminar in Psychology (1-15, max. 15)</b><br/>Selected research topics of contemporary interest. Quarterly listings of specific offerings are available at departmental advising office.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH448\" target=\"_blank\">View course details in MyPlan: PSYCH 448</a></p", "course_name": "PSYCH 448", "choice_prereqs": [], "course_id": "psych448", "numCID": 448, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 292 Applied Animal Behavior in Practice (3-5) NW</b><br/>Integrates animal behavior theory with real-world practice to resolve practical problem in human-animal interactions, including companion animals, captive animals, and livestock. Introduces the primary clinical literature in applied animal behavior.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH292\" target=\"_blank\">View course details in MyPlan: PSYCH 292</a></p", "course_name": "PSYCH 292", "choice_prereqs": [], "course_id": "psych292", "numCID": 292, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 291 Principles of Applied Animal Behavior (3-5) NW</b><br/>Further explores the basic principles of animal behavior, and related disciplines, with particular emphasis on application to human-animal interaction and issues. Introduces the primary literature in applied animal behavior.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH291\" target=\"_blank\">View course details in MyPlan: PSYCH 291</a></p", "course_name": "PSYCH 291", "choice_prereqs": [], "course_id": "psych291", "numCID": 291, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 443 Motivational Theories in Social Psychology (5) I&amp;S</b><br/>Theories of motivation in social psychology. Emphasis on how motivation and cognition mutually influence each other to produce behavior. Explores such topics as persuasion, goal pursuit, self-regulation, achievement, and social comparison. ", "course_name": "PSYCH 443", "choice_prereqs": [], "course_id": "psych443", "numCID": 443, "reg_prereqs": ["psych345"]}, {"course_info": "<p><b>PSYCH 441 Perceptual Processes (5) I&amp;S/NW</b><br/>Theory and findings in perception with a focus on visual perception in humans. Discrimination and constancy for simple judgments, segregation and identification of visual objects, and specific areas of investigation such as reading and computer vision. ", "course_name": "PSYCH 441", "choice_prereqs": [], "course_id": "psych441", "numCID": 441, "reg_prereqs": ["psych333"]}, {"course_info": "<p><b>PSYCH 447 Psychology of Language (4) VLPA/I&amp;S</b><br/>Introduction to the study of language, including language structure, speech perception, language acquisition, psychological processes underlying comprehension and production of language, the relation between brain and language, and the question of the species-specificity of human language. ", "course_name": "PSYCH 447", "choice_prereqs": [["psych209", "ling200", "ling201"]], "course_id": "psych447", "numCID": 447, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 446 Personality Assessment (3) I&amp;S</b><br/>Measurement of personality variables in personality research, social psychology, and clinical psychology. Theoretical conceptions underlying various clinical and experimental scales and an assessment of their construct validity and behavioral correlates. ", "course_name": "PSYCH 446", "choice_prereqs": [["psych317"]], "course_id": "psych446", "numCID": 446, "reg_prereqs": ["psych303", "psych315"]}, {"course_info": "<p><b>PSYCH 298 Graduate School Exploration for Psychology Majors (2)</b><br/>Provides an overview of graduate school options available in psychology, counseling, and research. Topics include researching programs, writing statements of purpose and resumes, standardized testing, letters of recommendation, and interviewing techniques. Credit/no-credit only.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH298\" target=\"_blank\">View course details in MyPlan: PSYCH 298</a></p", "course_name": "PSYCH 298", "choice_prereqs": [], "course_id": "psych298", "numCID": 298, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 299 Psychology Transfer Academic Community (2)</b><br/>Provides opportunity for transfer students new to or contemplating the psychology major to experience an in- depth orientation to the department, curriculum, and resources available to undergraduates. Students meet weekly to explore ways to effectively engage in the major and expand their understanding of the academic discipline. Credit/no-credit only.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH299\" target=\"_blank\">View course details in MyPlan: PSYCH 299</a></p", "course_name": "PSYCH 299", "choice_prereqs": [], "course_id": "psych299", "numCID": 299, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 357 Psychobiology of Women (5) NW, DIV</b><i> Kenney</i><br/>Physiological and psychological aspects of women's lives; determinants of biological sex; physiological and psychological events of puberty; menopause; sexuality; contraception, pregnancy, childbirth, and lactation; role of culture in determining psychological response to physiological events. ", "course_name": "PSYCH 357", "choice_prereqs": [], "course_id": "psych357", "numCID": 357, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 355 Cognitive Psychology (5) I&amp;S</b><br/>Current theory and research in perception, attention, memory and learning, attitudes, thinking and decision making, and language. For the student who wishes a survey or who intends additional work in any of the above content areas. ", "course_name": "PSYCH 355", "choice_prereqs": [["psych209"]], "course_id": "psych355", "numCID": 355, "reg_prereqs": ["psych202"]}, {"course_info": "<p><b>PSYCH 350 Honors Research Seminar in Psychology (2-, max. 4)</b><i> Bassok</i><br/>Presentations by professors and advanced students concerning the rationale, methodology, and progress of their research projects; assistance with research projects; preparation of junior paper. Four credits of PSYCH 350 required for all junior Honors candidates in conjunction with PSYCH 498 and PSYCH 499. Offered: AWSp.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH350\" target=\"_blank\">View course details in MyPlan: PSYCH 350</a></p", "course_name": "PSYCH 350", "choice_prereqs": [], "course_id": "psych350", "numCID": 350, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 210 The Diversity of Human Sexuality (5) I&amp;S, DIV</b><br/>Considers biological, psychological, and socio-cultural determinants of human sexuality and sexual behavior, and how their interaction leads to diverse expressions of sexuality, sexual bonding, gender orientation, reproductive strategies, and physical and psychological sexual development. Topics include cultural appraisal of sexuality, sexual health and reproduction (pregnancy, contraception, abortion), and sexual abuse and assault.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH210\" target=\"_blank\">View course details in MyPlan: PSYCH 210</a></p", "course_name": "PSYCH 210", "choice_prereqs": [], "course_id": "psych210", "numCID": 210, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 478 Cultural Psychology (4) I&amp;S</b><br/>Surveys cultural influences on cognitive, emotion, morality, self-concept, and mental health, from a multicultural perspective. ", "course_name": "PSYCH 478", "choice_prereqs": [], "course_id": "psych478", "numCID": 478, "reg_prereqs": ["psych202", "psych209"]}, {"course_info": "<p><b>PSYCH 479 Advanced Human Sexuality (5) I&amp;S</b><br/>Intensive reading on current issues relevant to the physiological, psychological, cultural aspects of human sexuality. ", "course_name": "PSYCH 479", "choice_prereqs": [["psych210"]], "course_id": "psych479", "numCID": 479, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 477 Psychology of Peace (5) I&amp;S</b><i> Barash</i><br/>Examination of the psychological aspects of peace in the modern world. Topics include theories of individual aggressiveness and violence, leadership personalities, crisis decision making, nuclear psychology, images of the enemy, and psychological opportunities and obstacles to the establishment of a peaceful society.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH477\" target=\"_blank\">View course details in MyPlan: PSYCH 477</a></p", "course_name": "PSYCH 477", "choice_prereqs": [], "course_id": "psych477", "numCID": 477, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 472 Human Factors Psychology (4) I&amp;S</b><br/>Considers human performance factors in the design of tools/equipment, tasks/jobs, and work and living environments. Emphasizes the importance of human perception, memory, attention, motor control, and social context for understanding ways to optimize the relationship between people and technology. ", "course_name": "PSYCH 472", "choice_prereqs": [], "course_id": "psych472", "numCID": 472, "reg_prereqs": ["psych202", "psych209"]}, {"course_info": "<p><b>PSYCH 470 Psychology and Music (5) VLPA/I&amp;S</b><br/>Introduction to the scientific study of musical behavior. An overview of current topics in the psychology of music from the areas of musical perception and cognition, musical development, music therapy, musical performance, and composition. Includes psychoacoustical and neuropsychological foundations, research methods, and some basic material in music theory. ", "course_name": "PSYCH 470", "choice_prereqs": [["psych202", "nbio302"]], "course_id": "psych470", "numCID": 470, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 471 Cognition In the Real World (4-5, max. 10) I&amp;S</b><br/>Examines cognitive issues in applied settings, such as the workplace and education. Topics include such issues as attention, expertise, problem solving, decision-making, human error, automation, navigation, and individual differences. ", "course_name": "PSYCH 471", "choice_prereqs": [["psych209"]], "course_id": "psych471", "numCID": 471, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 201 Psychology of Performance Enhancement (4) I&amp;S</b><br/>Applications of psychological theories, research, and intervention strategies to performance enhancement in variety of life settings. Self-regulation models and techniques; stress and emotional control; attention control and concentration; mental rehearsal; time management; goal-setting; memory enhancement; communication and interpersonal conflict resolution. Participation in various psychological training procedures. ", "course_name": "PSYCH 201", "choice_prereqs": [["psych101"]], "course_id": "psych201", "numCID": 201, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 200 Comparative Animal Behavior (3-5) NW</b><i> Barash, Beecher</i><br/>Research methods and findings of comparative animal behavior, their importance to an understanding of human behavior; rationale for study of behavioral differences/similarities between animal species, behavior viewed as part of adaptation of each species to its natural habitat. Not open for credit to students who have taken PSYCH 300.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH200\" target=\"_blank\">View course details in MyPlan: PSYCH 200</a></p", "course_name": "PSYCH 200", "choice_prereqs": [], "course_id": "psych200", "numCID": 200, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 203 Introduction to Personality and Individual Differences (4) I&amp;S</b><br/>Overview of the major theories, research findings, and applications in the scientific study of personality. Covers research methods and approaches to measuring personality variables. Not open for credit to students who have taken PSYCH 303. ", "course_name": "PSYCH 203", "choice_prereqs": [["psych101"]], "course_id": "psych203", "numCID": 203, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 202 Biopsychology (5) NW</b><br/>Examines the biological basis of behavior, the nervous system, how it works to control behavior and sense the world, and what happens when it malfunctions. Topics include learning and memory, development, sex, drugs, sleep, the senses, emotions, and mental disorders. ", "course_name": "PSYCH 202", "choice_prereqs": [["psych101"]], "course_id": "psych202", "numCID": 202, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 205 Behavior Disorders (5) I&amp;S</b><br/>Examines the bio-psycho-social origins of behavioral disorders. Topics include theories of etiology, developmental perspectives of behavior disorders, and assessment and diagnosis of the most common behavioral disorders. Note: not open for credit for students who have taken PSYCH 305. ", "course_name": "PSYCH 205", "choice_prereqs": [], "course_id": "psych205", "numCID": 205, "reg_prereqs": ["psych101"]}, {"course_info": "<p><b>PSYCH 206 Human Development (5) I&amp;S</b><br/>Theoretical perspectives and research methods in child development with an overview of historical and current works. Includes prenatal and biological development, the development of cognitive, linguistic, and social and emotional abilities. Not open for credit to students who have taken PSYCH 306. ", "course_name": "PSYCH 206", "choice_prereqs": [], "course_id": "psych206", "numCID": 206, "reg_prereqs": ["psych101"]}, {"course_info": "<p><b>PSYCH 209 Fundamentals of Psychological Research (5)</b><br/>Psychological research methodology and techniques. Topics include the logic of hypothesis testing, experimental design, research strategies and techniques, fundamentals of scientific writing, search and evaluation of research literature in psychology, and ethical issues in psychological research. Required for all psychology majors. ", "course_name": "PSYCH 209", "choice_prereqs": [["psych101"]], "course_id": "psych209", "numCID": 209, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 461 Asian American Psychology (5) I&amp;S</b><br/>Psychological research on Asian American individuals and the community, with emphasis on social psychological research. Topics include the model minority myth, stereotypes of unassimilation, gender and sexuality, and relationships with other groups. ", "course_name": "PSYCH 461", "choice_prereqs": [["psych303", "psych305", "psych306", "psych345", "psych355"]], "course_id": "psych461", "numCID": 461, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 460 Cognitive Neuroscience (4) NW</b><br/>Discussion of neural systems underlying cognitive behavior with particular focus on breakdown of cognition following brain damage. Topics include object and space perception, language, voluntary movement, attention, and memory. Examination of contributions from related areas of neuroimaging, visual perception, linguistics, physiology, and neuroscience. ", "course_name": "PSYCH 460", "choice_prereqs": [["psych333", "psych355", "psych421"]], "course_id": "psych460", "numCID": 460, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 463 Implicit and Unconscious Cognition (3) I&amp;S/NW</b><br/>Overview of method, theory, and findings concerning cognitive processes operating outside attentional focus or without introspective awareness. Considers relevance to basic phenomena of social, cognitive, and clinical psychology. ", "course_name": "PSYCH 463", "choice_prereqs": [["psych315", "psych317"], ["psych303", "psych305", "psych333", "psych345", "psych355"]], "course_id": "psych463", "numCID": 463, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 462 Human Memory (5) I&amp;S</b><br/>Research and theory in key areas of memory. Issues covered include information processing theory, the link between memory processes and their biological underpinnings, autobiographical memory, implicit memory, and the effect of emotion on memory. ", "course_name": "PSYCH 462", "choice_prereqs": [["psych209"]], "course_id": "psych462", "numCID": 462, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 465 Intelligence (5) I&amp;S</b><br/>Analysis of individual differences in cognition. Includes description/use of psychometric (\"intelligence test\") models, test scores' relationship to academic and non-academic performance, information processing and biological models of intelligence (including genetic models). Discussion of male-female and demographic group differences in cognition. ", "course_name": "PSYCH 465", "choice_prereqs": [["psych315", "psych317"]], "course_id": "psych465", "numCID": 465, "reg_prereqs": ["psych355"]}, {"course_info": "<p><b>PSYCH 466 Psychology of Judgment and Decision Making (5) I&amp;S</b><br/>Human information processing in judgment and decision making, especially the interface between cognitive theories and normative and prescriptive theories of decision making. ", "course_name": "PSYCH 466", "choice_prereqs": [["psych315", "psych317"], ["psych331", "psych355", "psych361"]], "course_id": "psych466", "numCID": 466, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 469 Psychology of Reasoning (4) I&amp;S</b><br/>Cognitive processes in human learning, problem solving, deductive and inductive reasoning. ", "course_name": "PSYCH 469", "choice_prereqs": [["psych355"]], "course_id": "psych469", "numCID": 469, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 250 Racism and Minority Groups (5) I&amp;S, DIV</b><br/>Overview of the causes, contexts, and consequences of racism and its effects upon minority groups and society. Emphasis on cultural history, political and socioeconomic structures that contribute to racism. Examination of current issues in race relations and cultural pluralism in the United States and selected international topics.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH250\" target=\"_blank\">View course details in MyPlan: PSYCH 250</a></p", "course_name": "PSYCH 250", "choice_prereqs": [], "course_id": "psych250", "numCID": 250, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 445 Theories of Social Psychology (5) I&amp;S</b><br/>Evaluation of the major theories of human social behavior supported by the empirical literature; theories of social cognition and thought; major theories of social interaction, group processes, and social learning. ", "course_name": "PSYCH 445", "choice_prereqs": [["psych345"]], "course_id": "psych445", "numCID": 445, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 380 Cross-Cultural Competence (4) I&amp;S</b><br/>Facilitates development of multicultural competence; focuses on mental health/social service needs of ethnic and linguistic minorities, and developing personal/interpersonal skills to reduce barriers, enhance effective service provision to cross cultural groups, sexual minorities, and disabled people. ", "course_name": "PSYCH 380", "choice_prereqs": [["psych305", "psych306"]], "course_id": "psych380", "numCID": 380, "reg_prereqs": ["psych250"]}, {"course_info": "<p><b>PSYCH 415 Personality Development of the Child (5) I&amp;S</b><br/>Socialization theory and research, infant attachment and social relationships, development of aggressive and altruistic behaviors, sex-role development, moral development, parent and adult influences. Applied issues in social development and policy. ", "course_name": "PSYCH 415", "choice_prereqs": [["psych206", "psych306"]], "course_id": "psych415", "numCID": 415, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 416 Animal Communication (4) NW</b><br/>Evolution and mechanisms of animal communication and related processes of perception, thinking, and social behavior. ", "course_name": "PSYCH 416", "choice_prereqs": [["biol180", "psych200", "psych300"]], "course_id": "psych416", "numCID": 416, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 417 Human Behavior as a Natural Science (5) I&amp;S/NW</b><br/>Evolution of human social behavior and the adaptive significance of communication systems from a sociobiological and anthropological perspective. ", "course_name": "PSYCH 417", "choice_prereqs": [["psych200", "psych300", "oa201", "biol180"]], "course_id": "psych417", "numCID": 417, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 410 Child and Adolescent Behavior Disorders (5) I&amp;S</b><br/>Introduction to psychopathology in children and adolescents, and an overview of principal modes of intervention. Particularly for students interested in advanced work in clinical psychology, social work, or special education. ", "course_name": "PSYCH 410", "choice_prereqs": [["psych306", "psych202", "psych206", "psych209"]], "course_id": "psych410", "numCID": 410, "reg_prereqs": ["psych305"]}, {"course_info": "<p><b>PSYCH 411 Perceptual Development (5) I&amp;S/NW</b><br/>Origins and development of perception in human infancy. Object, face, and speech perception; cross-modal relations between touch, vision, audition. ", "course_name": "PSYCH 411", "choice_prereqs": [["psych206", "psych306", "psych414"]], "course_id": "psych411", "numCID": 411, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 413 Adolescent Development (5) I&amp;S</b><br/>Provides an overview of physical, cognitive, psychosocial, and emotional development of adolescents with an emphasis on understanding the context in which young people grow up. Explores cultural, environmental, and social influences on development. ", "course_name": "PSYCH 413", "choice_prereqs": [["psych206", "psych306"]], "course_id": "psych413", "numCID": 413, "reg_prereqs": ["psych209"]}, {"course_info": "<p><b>PSYCH 418 Primate Social Behavior (5) NW</b><br/>Social behavior, ecology, and group structure of monkeys and apes from an evolutionary, sociobiological, and anthropological perspective. ", "course_name": "PSYCH 418", "choice_prereqs": [["psych200", "psych300", "oa201", "biol180"]], "course_id": "psych418", "numCID": 418, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 419 Behavioral Studies of Zoo Animals (5, max. 10) NW</b><br/>Observational studies of behavior of zoo animals to expand basic knowledge of animal behavior, conservation of endangered species, and research methodology with discussions and tours focusing on zoo philosophy and operations. Offered in cooperation with Woodland Park Zoo. ", "course_name": "PSYCH 419", "choice_prereqs": [["biol180", "psych200", "psych300"]], "course_id": "psych419", "numCID": 419, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 414 Cognitive Development (5) I&amp;S</b><br/>Key theoretical and research approaches to cognitive development from infancy through adolescence. Sensorimotor development, language development, imitation, number concepts, logical reasoning, memory, cognition in adolescents, intelligence, and the role of biology, environment, and experience. ", "course_name": "PSYCH 414", "choice_prereqs": [["psych306", "psych206", "psych209"]], "course_id": "psych414", "numCID": 414, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 260 Psychosocial Aspects of Nuclear War (3) I&amp;S</b><i> Barash</i><br/>Introduction to basic issues of nuclear war, including its effects, weaponry, and history of the arms race. Primary focus on the psychologic underpinnings of deterrence, relations between nations, and the personal and social forces operative in the arms race and peace movements.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH260\" target=\"_blank\">View course details in MyPlan: PSYCH 260</a></p", "course_name": "PSYCH 260", "choice_prereqs": [], "course_id": "psych260", "numCID": 260, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 300 Animal Behavior (5) NW</b><br/>Introduces important concepts and empirical findings in animal behavior. Emphasizes evolutionary and mechanistic approaches to understanding diversity and complexity of behavior. Topics include communication, mating, migration, and sociality. ", "course_name": "PSYCH 300", "choice_prereqs": [["biol118", "biol161", "biol180"]], "course_id": "psych300", "numCID": 300, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 303 Personality (5) I&amp;S</b><br/>Overview of major perspectives, scientific issues, applications, and research findings in the area of personality. Direct exposure to scientific literature, writing assignments, and research-based class experiences prepare students for advanced work in personality, social, abnormal, and developmental psychology. ", "course_name": "PSYCH 303", "choice_prereqs": [["psych209"]], "course_id": "psych303", "numCID": 303, "reg_prereqs": ["psych101", "psych202"]}, {"course_info": "<p><b>PSYCH 305 Abnormal Psychology (5) I&amp;S</b><br/>An overview of major categories of psychopathology, including description and classification, theoretical models, and recent research on etiology and treatment. ", "course_name": "PSYCH 305", "choice_prereqs": [], "course_id": "psych305", "numCID": 305, "reg_prereqs": ["psych202", "psych209"]}, {"course_info": "<p><b>PSYCH 306 Developmental Psychology (5) I&amp;S</b><br/>Overview of past and present theoretical and research-based approaches to biological, cognitive, and social development from the prenatal period to early adolescence. ", "course_name": "PSYCH 306", "choice_prereqs": [["psych209"]], "course_id": "psych306", "numCID": 306, "reg_prereqs": ["psych202"]}, {"course_info": "<p><b>PSYCH 407 History of Psychology (5) I&amp;S</b><br/>Historical and theoretical background of the basic assumptions of modern psychology, including such doctrines as behaviorism, determinism, and associationism and the scientists who developed them. ", "course_name": "PSYCH 407", "choice_prereqs": [], "course_id": "psych407", "numCID": 407, "reg_prereqs": ["psych209"]}, {"course_info": "<p><b>PSYCH 405 Advanced Personality: Theory and Research (5) I&amp;S</b><br/>Intensive survey of theoretical concepts and detailed review of experimental methods and experiments in the field of personality. ", "course_name": "PSYCH 405", "choice_prereqs": [], "course_id": "psych405", "numCID": 405, "reg_prereqs": ["psych303"]}, {"course_info": "<p><b>PSYCH 403 Motivation (5) I&amp;S/NW</b><br/>Theory and research on reinforcement, punishment, frustration, preference, instinctual mechanisms, and other factors controlling animal behavior. ", "course_name": "PSYCH 403", "choice_prereqs": [], "course_id": "psych403", "numCID": 403, "reg_prereqs": ["psych202"]}, {"course_info": "<p><b>PSYCH 402 Infant Behavior and Development (3/5) I&amp;S</b><br/>Psychological development in the first two years of life. Basic and advanced techniques for assessing psychological development in infancy. Classic theories of human infancy and examination of a wide range of new experiments about infant behavior and development. ", "course_name": "PSYCH 402", "choice_prereqs": [["psych206", "psych306", "psych414"]], "course_id": "psych402", "numCID": 402, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 400 Learning (5) I&amp;S/NW</b><br/>Experimental research and basic theories primarily in animal learning. ", "course_name": "PSYCH 400", "choice_prereqs": [], "course_id": "psych400", "numCID": 400, "reg_prereqs": ["psych202"]}, {"course_info": "<p><b>PSYCH 399 Foreign Study (3-5, max. 10)</b><br/>Upper division psychology courses for which there are no direct University of Washington equivalents taken through the UW Study Abroad program.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH399\" target=\"_blank\">View course details in MyPlan: PSYCH 399</a></p", "course_name": "PSYCH 399", "choice_prereqs": [], "course_id": "psych399", "numCID": 399, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 257 Psychology of Gender (5) I&amp;S, DIV</b><i> Kenney</i><br/>Major psychological theories of gender-role development; biological and environmental influences that determine and maintain gender differences in behavior; roles in children and adults; topics include aggression, cognitive abilities, achievement motivation, affiliation. ", "course_name": "PSYCH 257", "choice_prereqs": [], "course_id": "psych257", "numCID": 257, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 409 Sociobiology (5) NW</b><br/>Biological bases of social behavior, emphasizing evolution as a paradigm. Emphasizes how to think like an evolutionary biologist, especially with regard to interest conflict. Topics are individual versus group selection, kin selection, altruism, mating systems, sexual conflict, alternate reproductive strategies, and parent/offspring conflict. ", "course_name": "PSYCH 409", "choice_prereqs": [["biol180", "bbio180", "tesc120", "psych300", "psych200"]], "course_id": "psych409", "numCID": 409, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 408 Mechanisms of Animal Behavior (4) NW</b><i> Beecher, Brenowitz, Sisneros</i><br/>Comparative exploration of physiological and perceptual mechanisms that control behaviors necessary for survival and reproduction in animals. Model systems discussed include animal communication, mate choice, escape behavior, learning and memory, orientation, biological rhythms, foraging behavior. ", "course_name": "PSYCH 408", "choice_prereqs": [["psych202", "psych333", "biol300", "biol461"]], "course_id": "psych408", "numCID": 408, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 318 Statistical Inference in Psychological Research (5) QSR</b><br/>Hypothesis testing: probabilistic and statistical basis. Development and application of statistical inference techniques employed in psychological research: confidence intervals, t-test, ANOVA, and correlation and regression. Nature and control of experimental and inferential error in research. Required for majors for psychology BS degree. ", "course_name": "PSYCH 318", "choice_prereqs": [["psych317"]], "course_id": "psych318", "numCID": 318, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 317 Introduction to Probability and Statistics for Psychology (5) QSR</b><br/>Probability theory as a model for scientific inference. Probabilistic variables and experimental outcomes, conditional probability, binomial and related distributions, experiments as samples, statistics and sampling distributions, the normal distribution, confidence intervals, problems of estimation from experiments. ", "course_name": "PSYCH 317", "choice_prereqs": [["math124", "math134", "math144"]], "course_id": "psych317", "numCID": 317, "reg_prereqs": ["psych209"]}, {"course_info": "<p><b>PSYCH 315 Understanding Statistics in Psychology (5) QSR</b><br/>Statistics for psychological research. Elementary probability theory, hypothesis testing, and estimation. Satisfies the statistics requirement for majors registered in the psychology Bachelor of Arts degree program. ", "course_name": "PSYCH 315", "choice_prereqs": [["math111", "math112", "math120", "math124", "math144"]], "course_id": "psych315", "numCID": 315, "reg_prereqs": ["psych209"]}, {"course_info": "<p><b>PSYCH 498 Directed Reading in Psychology (1-3, max. 18)</b><br/>Readings in special interest areas under supervision of departmental faculty. Discussion of reading in conference with the instructor. An overall maximum of 18 credits in PSYCH 496, PSYCH 497, PSYCH 498, and PSYCH 499 may apply toward a baccalaureate degree.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH498\" target=\"_blank\">View course details in MyPlan: PSYCH 498</a></p", "course_name": "PSYCH 498", "choice_prereqs": [], "course_id": "psych498", "numCID": 498, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 499 Undergraduate Research (1-3, max. 18)</b><br/>Design and completion of individual research projects. An overall maximum of 18 credits in PSYCH 496, PSYCH 497, PSYCH 498, and PSYCH 499 may apply toward a baccalaureate degree.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH499\" target=\"_blank\">View course details in MyPlan: PSYCH 499</a></p", "course_name": "PSYCH 499", "choice_prereqs": [], "course_id": "psych499", "numCID": 499, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 494 Field Study in Animal Behavior (2-3, max. 9)</b><i> Kyes</i><br/>Field experience in areas relating to animal behavior through participation in seminar discussion and field exercises and training at foreign and domestic field study sites.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH494\" target=\"_blank\">View course details in MyPlan: PSYCH 494</a></p", "course_name": "PSYCH 494", "choice_prereqs": [], "course_id": "psych494", "numCID": 494, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 496 Undergraduate Teaching Experience in Psychology (2-3, max. 6)</b><br/>Students are trained as assistants in quiz sections or as supplemental tutors for undergraduate psychology courses. Designed especially for students planning graduate work or education certification. An overall maximum of 18 credits in PSYCH 496, PSYCH 497, PSYCH 498, and PSYCH 499 may apply toward a baccalaureate degree. Credit/no-credit only.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH496\" target=\"_blank\">View course details in MyPlan: PSYCH 496</a></p", "course_name": "PSYCH 496", "choice_prereqs": [], "course_id": "psych496", "numCID": 496, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 497 Undergraduate Fieldwork (2-5, max. 10)</b><br/>Individual consultation with faculty member and supervised practicum experience in a broad range of community settings and agencies dealing with psychological problems. An overall maximum of 18 credits in PSYCH 496, PSYCH 497, PSYCH 498, and PSYCH 499 may apply toward a baccalaureate degree.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH497\" target=\"_blank\">View course details in MyPlan: PSYCH 497</a></p", "course_name": "PSYCH 497", "choice_prereqs": [], "course_id": "psych497", "numCID": 497, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 490 Stress Management (3) I&amp;S/NW</b><br/>Nature of stress. Physiological responses to stress and relaxation. Techniques of stress management with training in relaxation, biofeedback, meditation, cognitive restructuring, exercise, nutrition, interpersonal communication skills, and time management. ", "course_name": "PSYCH 490", "choice_prereqs": [], "course_id": "psych490", "numCID": 490, "reg_prereqs": ["psych101"]}, {"course_info": "<p><b>PSYCH 491 Special Topics in Child Development, Learning, and Mental Health (1-5, max. 30) I&amp;S</b><br/>Selected topics of contemporary interest in child development, learning, and mental health.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH491\" target=\"_blank\">View course details in MyPlan: PSYCH 491</a></p", "course_name": "PSYCH 491", "choice_prereqs": [], "course_id": "psych491", "numCID": 491, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 438 Social Psychology of Sport (4) I&amp;S</b><br/>Reciprocal effects of interpersonal and group influence processes, e.g., social facilitation, behavior modification, observational learning, individual versus group performance, group cohesion, leadership, aggression. ", "course_name": "PSYCH 438", "choice_prereqs": [["psych209"]], "course_id": "psych438", "numCID": 438, "reg_prereqs": ["psych101", "psych202"]}, {"course_info": "<p><b>PSYCH 432 Visual Neuroscience (4) I&amp;S/NW</b><br/>Surveys current facts/theories about how our brains interpret the images formed by our eyes to create a presentation of the visual environment. Topics include retinal processing, 3-D vision; color, form, motion, and object perception; and visual illusions. ", "course_name": "PSYCH 432", "choice_prereqs": [["psych333", "psych355"]], "course_id": "psych432", "numCID": 432, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 433 Regulatory Behavior (4) NW</b><br/>Neural and endocrine mechanisms in the control of food and water intake and the regulation of body weight and fluid balance. ", "course_name": "PSYCH 433", "choice_prereqs": [["psych421", "psych427"]], "course_id": "psych433", "numCID": 433, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 430 Development of Brain Connections (4) NW</b><br/>Analysis of innate and environmental factors that play a role in the development of brain connections. Critical review of current literature on the various strategies used by neurons to find their appropriate targets. ", "course_name": "PSYCH 430", "choice_prereqs": [["psych202", "psych333", "psych421", "psych422", "psych423"]], "course_id": "psych430", "numCID": 430, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 431 Ecopsychology (5) I&amp;S</b><i> P. KAHN</i><br/>Explores psychology of the human relationship with nature. Critically examines how ecopsychology can impact urban sustainability, human health, environmental education, and the design of new technologies. Specific topics include evolutionary psychology; human-animal interaction; biophillia; children and nature; indigenous cultures; and ecotherapy. ", "course_name": "PSYCH 431", "choice_prereqs": [], "course_id": "psych431", "numCID": 431, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 436 Developmental Aspects of Sport Competition (4) I&amp;S</b><br/>Biophysical and psychosocial influences of sport participation on growth and development of children and youth. Competition readiness, injuries, stress, aggression, roles and responsibilities of parents and coaches. ", "course_name": "PSYCH 436", "choice_prereqs": [["psych209"]], "course_id": "psych436", "numCID": 436, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 437 Motor Development (4) NW</b><br/>Analysis of motor development from prenatal origins through adolescence with emphasis on relations between biophysical and psychosocial development of children and youth. ", "course_name": "PSYCH 437", "choice_prereqs": [["psych209"]], "course_id": "psych437", "numCID": 437, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 435 Human Color Vision (5) I&amp;S/NW</b><br/>Discusses how color does not exist in the physical environment but is instead a creation of our brains. Explores perceptual, physiological, developmental, evolutionary, genetic, and cultural aspects of human color vision, including its role in language, culture, and art. ", "course_name": "PSYCH 435", "choice_prereqs": [["psych209"]], "course_id": "psych435", "numCID": 435, "reg_prereqs": ["psych202"]}, {"course_info": "<p><b>PSYCH 245 Introduction to Social Psychology (5) I&amp;S</b><br/>Overview of major findings of social psychology, emphasizing the relevance for understanding the social behaviors of individuals and groups of individuals and their relationship to social context. Not open for credit to students who have taken PSYCH 345. ", "course_name": "PSYCH 245", "choice_prereqs": [["psych101"]], "course_id": "psych245", "numCID": 245, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 322 Introduction to Drugs and Behavior (3) NW</b><br/>Basic concepts of drug action emphasizing the behavioral consequences of the intake of a variety of drugs. ", "course_name": "PSYCH 322", "choice_prereqs": [["psych202"]], "course_id": "psych322", "numCID": 322, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 489 Clinical Psychology (3) I&amp;S</b><br/>Basic issues, methods, and research: professional issues, psychological assessment, and approaches to psychotherapy and behavioral change. ", "course_name": "PSYCH 489", "choice_prereqs": [], "course_id": "psych489", "numCID": 489, "reg_prereqs": ["psych305"]}, {"course_info": "<p><b>PSYCH 488 Stress and Coping (4) I&amp;S/NW</b><br/>Reviews theories and research concerning stress and its roles in behavior, personality, development, health, and interpersonal relationships. Coping analyzed as a factor in the way people respond to stressful circumstances. ", "course_name": "PSYCH 488", "choice_prereqs": [], "course_id": "psych488", "numCID": 488, "reg_prereqs": ["psych202", "psych209"]}, {"course_info": "<p><b>PSYCH 487 Advanced Psychobiology of Women (5) I&amp;S/NW</b><br/>Intensive reading on current issues relevant to women's psychology and physiology. ", "course_name": "PSYCH 487", "choice_prereqs": [["psych357", "gwss357"]], "course_id": "psych487", "numCID": 487, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 486 Animal Mind (4) NW</b><br/>Explores the cognitive capacities of animals. Focuses on the classical question, first clearly posed by Darwin, of how similar are the cognitive processes underlying behavior in humans and animals. Encourages a critical, skeptical examination of this new field. ", "course_name": "PSYCH 486", "choice_prereqs": [["psych200", "psych300"]], "course_id": "psych486", "numCID": 486, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 485 Primate Conservation Biology and Behavior (5) NW</b><br/>Examines the principles and concepts of conservation biology as they apply to the nonhuman primates with special attention to theoretical advances, conservation strategies, and management practices central to primate conservation. ", "course_name": "PSYCH 485", "choice_prereqs": [["psych200", "psych300", "oa201"]], "course_id": "psych485", "numCID": 485, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 483 Writing in Psychology (5)</b><br/>Helps students refine scientific writing skills. Students practice conducting focused literature searches and writing literature reviews, preparing empirical data for presentations, organizing and writing research reports, and writing about psychology for a lay audience. ", "course_name": "PSYCH 483", "choice_prereqs": [["psych300", "psych303", "psych305", "psych306", "psych333", "psych345", "psych355"]], "course_id": "psych483", "numCID": 483, "reg_prereqs": ["psych202", "psych209"]}, {"course_info": "<p><b>PSYCH 482 Advanced Research Methods for Behavioral Psychology (4) QSR</b><br/>Develops skills of collecting and analyzing behavioral research data, communicating the results orally and in writing, and expressing perspectives on issues of scientific method and practice. ", "course_name": "PSYCH 482", "choice_prereqs": [["psych315", "psych317"], ["psych330", "psych331", "psych332", "psych350"]], "course_id": "psych482", "numCID": 482, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 481 Seminar in Advanced Quantitative Methods (3)</b><br/>Examines the role of statistical methods in psychological research. Issues and controversies surrounding null hypothesis significance testing. Review of selected alternative statistical methods in psychology. ", "course_name": "PSYCH 481", "choice_prereqs": [["psych315", "psych318"]], "course_id": "psych481", "numCID": 481, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 480 Ideas of Human Nature (5) I&amp;S</b><br/>Reviews various approaches to the nature of human nature, including ideas from ancient philosophy, theories of the soul, empiricism, idealism, conditioning, social constructions, concepts of Freud, Marx, the existentialists, and neo-Darwinism. ", "course_name": "PSYCH 480", "choice_prereqs": [["psych101"]], "course_id": "psych480", "numCID": 480, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 429 Brain Anatomy for the Behavioral Scientist (1) NW</b><br/>Detailed review of the neuroanatomical features of the sheep brain with laboratory demonstrations. ", "course_name": "PSYCH 429", "choice_prereqs": [["psych421"]], "course_id": "psych429", "numCID": 429, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 428 Human Motor Control and Learning (5) I&amp;S/NW</b><br/>Current theory and research in human motor performance and skill acquisition. ", "course_name": "PSYCH 428", "choice_prereqs": [], "course_id": "psych428", "numCID": 428, "reg_prereqs": ["psych209", "psych202"]}, {"course_info": "<p><b>PSYCH 425 Surgical and Histological Techniques (5) NW</b><br/>Practicum in basic and advanced surgical and histological techniques used in psychophysiological experimentation. ", "course_name": "PSYCH 425", "choice_prereqs": [], "course_id": "psych425", "numCID": 425, "reg_prereqs": ["psych421"]}, {"course_info": "<p><b>PSYCH 427 Behavioral Endocrinology (5) NW</b><br/>The endocrine system and how its secretions influence and are influenced by behavior; relationships between the nervous and endocrine systems. ", "course_name": "PSYCH 427", "choice_prereqs": [], "course_id": "psych427", "numCID": 427, "reg_prereqs": ["psych421"]}, {"course_info": "<p><b>PSYCH 426 Neurobiology of Learning and Memory (4) NW</b><br/>Theory and research on how animals learn and remember, including basic concepts of brain plasticity, how brain areas and neurons adapt to changes in experiences throughout the lifespan, and cellular and structural substrates of a \"memory.\" ", "course_name": "PSYCH 426", "choice_prereqs": [["psych202", "psych322", "psych333", "psych421", "psych422", "psych423"]], "course_id": "psych426", "numCID": 426, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 421 Neural Basis of Behavior (5) NW</b><br/>Anatomical and physiological principles and resultant behavior involved in the integrative action of the nervous system. ", "course_name": "PSYCH 421", "choice_prereqs": [["psych202"]], "course_id": "psych421", "numCID": 421, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 420 Drugs and Behavior (3) NW</b><br/>Animal and clinical research on the behavioral consequences of drug intake. ", "course_name": "PSYCH 420", "choice_prereqs": [["psych322"]], "course_id": "psych420", "numCID": 420, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 423 Sensory Basis of Behavior (5) NW</b><br/>Study of sensory mechanisms as a way to understand behavior. Basic properties of neurons, anatomy, and physiology of sensory systems, with some emphasis on the visual system. ", "course_name": "PSYCH 423", "choice_prereqs": [["psych202", "psych333"]], "course_id": "psych423", "numCID": 423, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 331 Laboratory in Human Performance (5) I&amp;S</b><br/>Selected aspects of human cognition, perception, and performance. ", "course_name": "PSYCH 331", "choice_prereqs": [["psych315", "psych317"]], "course_id": "psych331", "numCID": 331, "reg_prereqs": ["psych209"]}, {"course_info": "<p><b>PSYCH 330 Laboratory in Animal Behavior (5) NW</b><br/>Experience with a variety of animal species and experimental procedures and instrumentation. ", "course_name": "PSYCH 330", "choice_prereqs": [["psych315", "psych317"], ["psych209"]], "course_id": "psych330", "numCID": 330, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 333 Sensory and Perceptual Processes (5) NW</b><br/>An overview of each of the major senses with emphasis on the structure and function of sensory systems and the relation of the underlying biology to perceptual processes and behavior. ", "course_name": "PSYCH 333", "choice_prereqs": [["psych209"]], "course_id": "psych333", "numCID": 333, "reg_prereqs": ["psych202"]}, {"course_info": "<p><b>PSYCH 332 Neurobehavioral Lab (5) NW</b><br/>Explores the neural mechanisms of behavior via neuropharmacological and neuroanatomical approaches. Includes the ethics and regulation of animal experimentation. ", "course_name": "PSYCH 332", "choice_prereqs": [["psych315", "psych317"]], "course_id": "psych332", "numCID": 332, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 334 Laboratory in Social Psychology (5) I&amp;S</b><br/>Methodology of laboratory and field research on social behavior; data analysis and report writing; research projects. ", "course_name": "PSYCH 334", "choice_prereqs": [["psych315", "psych317"], ["psych245", "psych345"]], "course_id": "psych334", "numCID": 334, "reg_prereqs": ["psych209"]}, {"course_info": "<p><b>PSYCH 458 Behavioral Genetics (4) NW</b><br/>Role of genetics in determining variation in human and animal behavior and in regulating behavioral development. Techniques for quantifying genetic variation, behavioral effects, and gene expression. ", "course_name": "PSYCH 458", "choice_prereqs": [["psych200", "psych300", "biol180"]], "course_id": "psych458", "numCID": 458, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 459 Evolutionary Psychology (4) I&amp;S/NW</b><br/>Explores human behavior from the perspective of biological evolution. Covers core issues such as cooperation, communication, aggression, mating, reproduction, and parental and family interactions, as well as specialized applications within psychology such as psychopathology. Encourages a critical, skeptical examination of this new field. ", "course_name": "PSYCH 459", "choice_prereqs": [["psych200", "psych300"]], "course_id": "psych459", "numCID": 459, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 450 Honors Research Seminar in Psychology (2-, max. 4)</b><i> Bassok</i><br/>Senior thesis research; preparation of senior thesis; oral presentation of research. Four credits of PSYCH 450 required for all senior Honors candidates in conjunction with PSYCH 498 and PSYCH 499. Offered: AWSp.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH450\" target=\"_blank\">View course details in MyPlan: PSYCH 450</a></p", "course_name": "PSYCH 450", "choice_prereqs": [], "course_id": "psych450", "numCID": 450, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 451 Health Psychology (5) I&amp;S/NW</b><br/>Overview of the psychological and behavioral factors in health and disease. Includes research on both psychological causes and treatments. Topics include stress, risky behaviors, patient-provider interactions, pain, behavioral/medical treatments, and lifestyle interventions. ", "course_name": "PSYCH 451", "choice_prereqs": [["psych303", "psych345"]], "course_id": "psych451", "numCID": 451, "reg_prereqs": ["psych202", "psych209"]}, {"course_info": "<p><b>PSYCH 452 Psychology of the Self-Concept (4) I&amp;S</b><br/>Examines psychological theory and research on the role of the self-concept in regulating behavior. Topics include the development of the self-concept; self-awareness; and self-esteem maintenance. ", "course_name": "PSYCH 452", "choice_prereqs": [["psych245", "psych345"]], "course_id": "psych452", "numCID": 452, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 101 Introduction to Psychology (5) I&amp;S</b><br/>Surveys major areas of psychological science. Core topics include human social behavior, personality, psychological disorders and treatment, learning, memory, human development, biological influences, and research methods. Related topics may include sensation, perception, states of consciousness, thinking, intelligence, language, motivation, emotion, stress and health, cross-cultural psychology, and applied psychology. Offered: AWSpS.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/PSYCH101\" target=\"_blank\">View course details in MyPlan: PSYCH 101</a></p", "course_name": "PSYCH 101", "choice_prereqs": [], "course_id": "psych101", "numCID": 101, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 454 Personality and Social Influence (4) I&amp;S</b><br/>Survey of various theories and research for analyzing person-situation interactions - how the qualities of persons and situations combine to generate thoughts, feelings, and behaviors of a person in a given social situation. ", "course_name": "PSYCH 454", "choice_prereqs": [["psych203", "psych245", "psych303", "psych345"]], "course_id": "psych454", "numCID": 454, "reg_prereqs": ["psych209"]}, {"course_info": "<p><b>PSYCH 456 Social and Moral Development (5) I&amp;S</b><br/>Theoretical approaches toward explaining children's social and moral development, including those that are nativistic, sociobiological, behavioristic, psychoanalytic, and constructivist. Use of theory to investigate applied problems related to parenting, education, peer relationships, authority, sexuality, culture, ecology, and technology. ", "course_name": "PSYCH 456", "choice_prereqs": [["psych206", "psych306"]], "course_id": "psych456", "numCID": 456, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 457 Language Development (5) VLPA/I&amp;S</b><br/>First-language acquisition and use by children. Emphasis on theoretical issues and research techniques. ", "course_name": "PSYCH 457", "choice_prereqs": [["psych206", "psych306", "ling200", "ling400"]], "course_id": "psych457", "numCID": 457, "reg_prereqs": []}, {"course_info": "<p><b>PSYCH 345 Social Psychology (5) I&amp;S</b><br/>The scientific study of how people's thoughts, feelings, and actions influence, and are influenced by, other people. ", "course_name": "PSYCH 345", "choice_prereqs": [["psych209"]], "course_id": "psych345", "numCID": 345, "reg_prereqs": ["psych202"]}], "links": [{"source": 107, "target": 0}, {"source": 111, "target": 4}, {"source": 99, "target": 5}, {"source": 48, "target": 7}, {"source": 62, "target": 7}, {"source": 23, "target": 11}, {"source": 23, "target": 14}, {"source": 26, "target": 14}, {"source": 23, "target": 17}, {"source": 26, "target": 17}, {"source": 107, "target": 24}, {"source": 107, "target": 25}, {"source": 11, "target": 31}, {"source": 34, "target": 36}, {"source": 49, "target": 40}, {"source": 26, "target": 42}, {"source": 107, "target": 48}, {"source": 23, "target": 48}, {"source": 23, "target": 49}, {"source": 26, "target": 49}, {"source": 23, "target": 50}, {"source": 26, "target": 51}, {"source": 48, "target": 52}, {"source": 23, "target": 53}, {"source": 23, "target": 55}, {"source": 26, "target": 61}, {"source": 26, "target": 62}, {"source": 107, "target": 68}, {"source": 107, "target": 70}, {"source": 23, "target": 70}, {"source": 23, "target": 77}, {"source": 49, "target": 80}, {"source": 23, "target": 81}, {"source": 26, "target": 81}, {"source": 23, "target": 85}, {"source": 26, "target": 85}, {"source": 26, "target": 90}, {"source": 23, "target": 90}, {"source": 94, "target": 91}, {"source": 94, "target": 92}, {"source": 26, "target": 97}, {"source": 23, "target": 99}, {"source": 26, "target": 101}, {"source": 23, "target": 105}, {"source": 26, "target": 105}, {"source": 26, "target": 108}, {"source": 23, "target": 111}]}