{"nodes": [{"course_info": "<p><b>STAT 480 Sampling Theory for Biologists (3) NW</b><i> J. SKALSKI</i><br/>Theory and applications of sampling finite populations including: simple random sampling, stratified random sampling, ratio estimates, regression estimates, systematic sampling, cluster sampling, sample size determinations, applications in fisheries and forestry. Other topics include sampling plant and animal populations, sampling distributions, estimation of parameters and statistical treatment of data. ", "course_name": "STAT 480", "choice_prereqs": [], "course_id": "stat480", "numCID": 480, "reg_prereqs": ["qsci482"], "is_prereq_for": []}, {"course_info": "<p><b>STAT 486 Experimental Design (4) NW</b><br/>Emphasizes data modeling using structured means resulting from choice of experimental and treatment design. Examines experimental designs, including crossed, nested designs; block; split-plot designs; and covariance analysis. Also covers multiple comparisons, efficiency, power, sample size, and pseudo-replication. ", "course_name": "STAT 486", "choice_prereqs": [], "course_id": "stat486", "numCID": 486, "reg_prereqs": ["qsci482"], "is_prereq_for": []}, {"course_info": "<p><b>STAT 425 Introduction to Nonparametric Statistics (3) NW</b><br/>Overview of nonparametric methods, such as rank tests, goodness of fit tests, 2 x 2 tables, nonparametric estimation. Useful for students with only a statistical methods course background. ", "course_name": "STAT 425", "choice_prereqs": [], "course_id": "stat425", "numCID": 425, "reg_prereqs": ["stat390", "math390"], "is_prereq_for": []}, {"course_info": "<p><b>STAT 391 Quantitative Introductory Statistics for Data Science (4)</b><br/>The basic concepts of statistics, machine learning and data science, as well as their computational aspects. Statistical models, likelihood, maximum likelihood and Bayesian estimation, regression, classification, clustering, principal component analysis, model validation, statistical testing. Practical implementation and visualization in data analysis. Assumes knowledge of basic probability, mathematical maturity, and ability to program. ", "course_name": "STAT 391", "choice_prereqs": [["cse312", "stat394"]], "course_id": "stat391", "numCID": 391, "reg_prereqs": ["stat395"], "is_prereq_for": []}, {"course_info": "<p><b>STAT 390 Statistical Methods in Engineering and Science (4) NW</b><br/>Concepts of probability and statistics. Conditional probability, independence, random variables, distribution functions. Descriptive statistics, transformations, sampling errors, confidence intervals, least squares and maximum likelihood. Exploratory data analysis and interactive computing. Students may receive credit for only one of STAT 390, STAT 481/ECON 481, and ECON 580. ", "course_name": "STAT 390", "choice_prereqs": [["math126", "math136"]], "course_id": "stat390", "numCID": 390, "reg_prereqs": [], "is_prereq_for": ["stat425"]}, {"course_info": "<p><b>STAT 395 Probability II (3) NW</b><br/>Random variables; expectation and variance; laws of large numbers; normal approximation and other limit theorems; multidimensional distributions and transformations. ", "course_name": "STAT 395", "choice_prereqs": [], "course_id": "stat395", "numCID": 395, "reg_prereqs": ["t/math394"], "is_prereq_for": ["stat391"]}, {"course_info": "<p><b>STAT 316 Design of Experiments and Regression Analysis (4) NW</b><i> L. BOYLE</i><br/>Introduction to the analysis of data from planned experiments. Analysis of variance for multiple factors and applications of orthogonal arrays and linear graphs for fractional factorial designs to product and process design optimization. Regression analysis with applications in engineering. ", "course_name": "STAT 316", "choice_prereqs": [], "course_id": "stat316", "numCID": 316, "reg_prereqs": ["de315"], "is_prereq_for": []}, {"course_info": "<p><b>STAT 342 Introduction to Probability and Mathematical Statistics III (4) NW</b><br/>Brief review of: sample spaces, random variables, probability. Distribution: binomial, normal, Poisson, geometric. Followed by: expectation, variance, central limit theorem. Basic concepts of estimation, testing, and confidence intervals. Maximum likelihood estimators and likelihood ratio tests, efficiency. Introduction to regression. ", "course_name": "STAT 342", "choice_prereqs": [], "course_id": "stat342", "numCID": 342, "reg_prereqs": ["stat341"], "is_prereq_for": []}, {"course_info": "<p><b>STAT 435 Introduction to Statistical Machine Learning (4)</b><i> D. WITTEN</i><br/>Introduces the theory and application of statistical machine learning. Topics may include supervised versus unsupervised learning; cross-validation; the bias-variance trade-off; regression and classification; regularization and shrinkage approaches; non-linear approaches; tree-based methods; and support vector machines. Includes applications in R. ", "course_name": "STAT 435", "choice_prereqs": [["stat341", "stat390", "math390", "stat391"]], "course_id": "stat435", "numCID": 435, "reg_prereqs": ["math308"], "is_prereq_for": []}, {"course_info": "<p><b>STAT 341 Introduction to Probability and Mathematical Statistics II (4) NW</b><br/>Brief review of: sample spaces, random variables, probability. Distribution: binomial, normal, Poisson, geometric. Followed by: expectation, variance, central limit theorem. Basic concepts of estimation, testing, and confidence intervals. Maximum likelihood estimators and likelihood ratio tests, efficiency. Introduction to regression. ", "course_name": "STAT 341", "choice_prereqs": [["stat340", "t/math394", "t/math395"], ["t/econ311", "t/math390"], ["math136", "math327"]], "course_id": "stat341", "numCID": 341, "reg_prereqs": [], "is_prereq_for": ["stat342"]}], "links": [{"source": 4, "target": 2}, {"source": 5, "target": 3}, {"source": 9, "target": 7}]}