{"nodes": [{"course_id": "stat221", "reg_prereqs": [], "numCID": 221, "choice_prereqs": [], "course_info": "<p><b>STAT 221 Statistical Concepts and Methods for the Social Sciences (5) NW, QSR</b><br/>Develops statistical literacy. Examines objectives and pitfalls of statistical studies; study designs, data analysis, inference; graphical and numerical summaries of numerical and categorical data; correlation and regression; and estimation, confidence intervals, and significance tests. Emphasizes social science examples and cases. (Students may receive credit for only one of STAT 220, STAT 221, STAT 311, STAT 221/CS&amp;SS 221/SOC 221, ECON 311.) "}, {"course_id": "stat220", "reg_prereqs": [], "numCID": 220, "choice_prereqs": [], "course_info": "<p><b>STAT 220 Principles of Statistical Reasoning (5) NW, QSR</b><br/>Introduces statistical reasoning. Focuses primarily on the what and why rather than the how. Helps students gain an understanding of the rationale behind many statistical methods, as well as an appreciation of the use and misuse of statistics. Encourages and requires critical thinking.   (Students may receive credit for only one of STAT 220, STAT 221/CS&amp;SS 221/SOC 221, STAT 311, and ECON 311.) Offered: AWSpS.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/STAT220\" target=\"_blank\">View course details in MyPlan: STAT 220</a></p"}, {"course_id": "stat320", "reg_prereqs": [], "numCID": 320, "choice_prereqs": [], "course_info": "<p><b>STAT 320 Evaluating Social Science Evidence (5) I&amp;S, QSR</b><br/>A critical introduction to the methods used to collect data in social science: surveys, archival research, experiments, and participant observation. Evaluates \"facts and findings\" by understanding the strengths and weaknesses of the methods that produce them. Case based. "}, {"course_id": "stat321", "reg_prereqs": [], "numCID": 321, "choice_prereqs": [], "course_info": "<p><b>STAT 321 Case-Based Social Statistics I (5) I&amp;S, QSR</b><br/>Introduction to statistical reasoning for social scientists. Built around cases representing in-depth investigations into the nature and content of statistical and social-science principles and practice. Hands-on approach: weekly data-analysis laboratory. Fundamental statistical topics: measurement, exploratory data analysis, probabilistic concepts, distributions, assessment of statistical evidence. "}, {"course_id": "stat322", "reg_prereqs": [], "numCID": 322, "choice_prereqs": [["soc321", "stat321"]], "course_info": "<p><b>STAT 322 Case-Based Social Statistics II (5) I&amp;S, QSR</b><br/>Continuation of CS&amp;SS 321/SOC 321/STAT 321. Progresses to questions of assessing the weight of evidence and more sophisticated models including regression-based methods. Built around cases investigating the nature and content of statistical principles and practice. Hands-on approach: weekly data analysis laboratory. "}, {"course_id": "stat302", "reg_prereqs": [], "numCID": 302, "choice_prereqs": [["stat311", "econ311", "stat390", "math390"]], "course_info": "<p><b>STAT 302 Statistical Software and Its Applications (3)</b><br/>Introduction to data structures and basics of implementing procedures in statistical computing packages, selected from but not limited to R, SAS, STATA, MATLAB, SPSS, and Minitab. Provides a foundation in computation components of data analysis. "}, {"course_id": "stat480", "reg_prereqs": ["qsci482"], "numCID": 480, "choice_prereqs": [], "course_info": "<p><b>STAT 480 Sampling Theory for Biologists (3) NW</b><i> J. SKALSKI</i><br/>Theory and applications of sampling finite populations including: simple random sampling, stratified random sampling, ratio estimates, regression estimates, systematic sampling, cluster sampling, sample size determinations, applications in fisheries and forestry. Other topics include sampling plant and animal populations, sampling distributions, estimation of parameters and statistical treatment of data. "}, {"course_id": "stat403", "reg_prereqs": [], "numCID": 403, "choice_prereqs": [["stat311", "econ311", "stat341", "stat390", "math390", "stat481", "econ481", "qsci381", "qsci482"]], "course_info": "<p><b>STAT 403 Introduction to Resampling Inference (4) NW</b><i> V. MININ</i><br/>Introduction to computer-intensive data analysis for experimental and observational studies in empirical sciences. Students design, program, carry out, and report applications of bootstrap resampling, rerandomization, and subsampling of cases. Experience programming in R is beneficial. Credit allowed for STAT 403 or STAT 503 but not both. "}, {"course_id": "stat486", "reg_prereqs": ["qsci482"], "numCID": 486, "choice_prereqs": [], "course_info": "<p><b>STAT 486 Experimental Design (4) NW</b><br/>Emphasizes data modeling using structured means resulting from choice of experimental and treatment design. Examines experimental designs, including crossed, nested designs; block; split-plot designs; and covariance analysis. Also covers multiple comparisons, efficiency, power, sample size, and pseudo-replication. "}, {"course_id": "stat427", "reg_prereqs": [], "numCID": 427, "choice_prereqs": [["stat342", "stat362", "stat421"]], "course_info": "<p><b>STAT 427 Introduction to Analysis of Categorical Data (4) NW</b><br/>Techniques for analysis of count data. Log-linear models, logistic regression, and analysis of ordered response categories. Illustrations from the behavioral and biological sciences. Computational procedures. "}, {"course_id": "stat425", "reg_prereqs": ["stat390", "math390"], "numCID": 425, "choice_prereqs": [], "course_info": "<p><b>STAT 425 Introduction to Nonparametric Statistics (3) NW</b><br/>Overview of nonparametric methods, such as rank tests, goodness of fit tests, 2 x 2 tables, nonparametric estimation. Useful for students with only a statistical methods course background. "}, {"course_id": "stat423", "reg_prereqs": [], "numCID": 423, "choice_prereqs": [["stat342", "stat421", "stat481", "econ481"]], "course_info": "<p><b>STAT 423 Applied Regression and Analysis of Variance (4) NW</b><br/>Regression analysis. Problems in interpreting regression coefficients. Estimation, including two-stage least squares. Guided regression: building linear models, selecting carriers. Regression residuals. Analysis of variance. Nonparametric regression. Factorial designs, response surface methods. "}, {"course_id": "stat421", "reg_prereqs": [], "numCID": 421, "choice_prereqs": [["stat342", "stat481", "econ481"]], "course_info": "<p><b>STAT 421 Applied Statistics and Experimental Design (4) NW</b><br/>Computer-aided data analyses using comparisons between batches, analysis of variance and regression. Evaluation of assumptions, data transformation, reliability of statistical measures (jackknife, bootstrap). Fisher-Gosset controversy. "}, {"course_id": "stat391", "reg_prereqs": ["stat395"], "numCID": 391, "choice_prereqs": [["cse312", "stat394"]], "course_info": "<p><b>STAT 391 Quantitative Introductory Statistics for Data Science (4)</b><br/>The basic concepts of statistics, machine learning and data science, as well as their computational aspects. Statistical models, likelihood, maximum likelihood and Bayesian estimation, regression, classification, clustering, principal component analysis, model validation, statistical testing. Practical implementation and visualization in data analysis. Assumes knowledge of basic probability, mathematical maturity, and ability to program. "}, {"course_id": "stat390", "reg_prereqs": [], "numCID": 390, "choice_prereqs": [["math126", "math136"]], "course_info": "<p><b>STAT 390 Statistical Methods in Engineering and Science (4) NW</b><br/>Concepts of probability and statistics. Conditional probability, independence, random variables, distribution functions. Descriptive statistics, transformations, sampling errors, confidence intervals, least squares and maximum likelihood. Exploratory data analysis and interactive computing. Students may receive credit for only one of STAT 390, STAT 481/ECON 481, and ECON 580. "}, {"course_id": "stat395", "reg_prereqs": ["t/math394"], "numCID": 395, "choice_prereqs": [], "course_info": "<p><b>STAT 395 Probability II (3) NW</b><br/>Random variables; expectation and variance; laws of large numbers; normal approximation and other limit theorems; multidimensional distributions and transformations. "}, {"course_id": "stat394", "reg_prereqs": [], "numCID": 394, "choice_prereqs": [["math126", "math136"]], "course_info": "<p><b>STAT 394 Probability I (3) NW</b><br/>Sample spaces; basic axioms of probability; combinatorial probability; conditional probability and independence; binomial, Poisson, and normal distributions. "}, {"course_id": "stat111", "reg_prereqs": [], "numCID": 111, "choice_prereqs": [], "course_info": "<p><b>STAT 111 Lectures in Applied Statistics (1) NW</b><br/>Weekly lectures illustrating the importance of statisticians in a variety of fields, including medicine and the biological, physical, and social sciences. Credit/no-credit only. "}, {"course_id": "stat396", "reg_prereqs": [], "numCID": 396, "choice_prereqs": [["math395", "stat395", "stat340", "stat341"]], "course_info": "<p><b>STAT 396 Probability III (3) NW</b><br/>Characteristic functions and generating functions; recurrent events and renewal theory; random walk. "}, {"course_id": "stat311", "reg_prereqs": [], "numCID": 311, "choice_prereqs": [["math111", "math120", "math124", "math127", "math144"]], "course_info": "<p><b>STAT 311 Elements of Statistical Methods (5) NW, QSR</b><br/>Elementary concepts of probability and sampling; binomial and normal distributions. Basic concepts of hypothesis testing, estimation, and confidence intervals; t-tests and chi-square tests. Linear regression theory and the analysis of variance. (Students may receive credit for only one of STAT 220, STAT 221, STAT 311, and ECON 311.) "}, {"course_id": "stat316", "reg_prereqs": ["de315"], "numCID": 316, "choice_prereqs": [], "course_info": "<p><b>STAT 316 Design of Experiments and Regression Analysis (4) NW</b><i> L. BOYLE</i><br/>Introduction to the analysis of data from planned experiments. Analysis of variance for multiple factors and applications of orthogonal arrays and linear graphs for fractional factorial designs to product and process design optimization. Regression analysis with applications in engineering. "}, {"course_id": "stat495", "reg_prereqs": [], "numCID": 495, "choice_prereqs": [], "course_info": "<p><b>STAT 495 Service Learning: K-12 Tutoring Experience (1-5, max. 5)</b><i> Morita</i><br/>Tutoring mathematics in local K-12 schools. Offered: AWSp.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/STAT495\" target=\"_blank\">View course details in MyPlan: STAT 495</a></p"}, {"course_id": "stat492", "reg_prereqs": [], "numCID": 492, "choice_prereqs": [["math394", "stat394"], ["math395", "stat395"]], "course_info": "<p><b>STAT 492 Stochastic Calculus for Option Pricing (3) NW</b><br/>Introductory stochastic calculus mathematical foundation for pricing options and derivatives. Basic stochastic analysis tools, including stochastic integrals, stochastic differential equations, Ito's formula, theorems of Girsanov and Feynman-Kac, Black-Scholes option pricing, American and exotic options, bond options. "}, {"course_id": "stat491", "reg_prereqs": [], "numCID": 491, "choice_prereqs": [["stat395", "stat340", "stat341", "stat396"]], "course_info": "<p><b>STAT 491 Introduction to Stochastic Processes (3) NW</b><br/>Random walks, Markov chains, branching processes, Poisson process, point processes, birth and death processes, queuing theory, stationary processes. "}, {"course_id": "stat498", "reg_prereqs": [], "numCID": 498, "choice_prereqs": [], "course_info": "<p><b>STAT 498 Special Topics (1-5, max. 15) NW</b><br/>Reading and lecture course intended for special needs of students.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/STAT498\" target=\"_blank\">View course details in MyPlan: STAT 498</a></p"}, {"course_id": "stat499", "reg_prereqs": [], "numCID": 499, "choice_prereqs": [], "course_info": "<p><b>STAT 499 Undergraduate Research (1-5, max. 15)</b><br/>Offered: AWSpS.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/STAT499\" target=\"_blank\">View course details in MyPlan: STAT 499</a></p"}, {"course_id": "stat342", "reg_prereqs": ["stat341"], "numCID": 342, "choice_prereqs": [], "course_info": "<p><b>STAT 342 Introduction to Probability and Mathematical Statistics III (4) NW</b><br/>Brief review of: sample spaces, random variables, probability. Distribution: binomial, normal, Poisson, geometric. Followed by: expectation, variance, central limit theorem. Basic concepts of estimation, testing, and confidence intervals. Maximum likelihood estimators and likelihood ratio tests, efficiency. Introduction to regression. "}, {"course_id": "stat435", "reg_prereqs": ["math308"], "numCID": 435, "choice_prereqs": [["stat341", "stat390", "math390", "stat391"]], "course_info": "<p><b>STAT 435 Introduction to Statistical Machine Learning (4)</b><i> D. WITTEN</i><br/>Introduces the theory and application of statistical machine learning. Topics may include supervised versus unsupervised learning; cross-validation; the bias-variance trade-off; regression and classification; regularization and shrinkage approaches; non-linear approaches; tree-based methods; and support vector machines. Includes applications in R. "}, {"course_id": "stat340", "reg_prereqs": [], "numCID": 340, "choice_prereqs": [["stat311", "econ311", "stat390", "math390"], ["math327", "math136"]], "course_info": "<p><b>STAT 340 Introduction to Probability and Mathematical Statistics I (4) QSR</b><br/>Covers the fundamentals of probability and mathematical statistics; axioms of probability, conditional and joint probability, random variables, univariate and multivariate distributions and densities, and moments; bionomial, negative binomial, geometric, Poisson, normal, exponential distributions, and central limit theorem; and basic estimation and hypothesis testing theory. "}, {"course_id": "stat341", "reg_prereqs": [], "numCID": 341, "choice_prereqs": [["stat340", "t/math394", "t/math395"], ["t/econ311", "t/math390"], ["math136", "math327"]], "course_info": "<p><b>STAT 341 Introduction to Probability and Mathematical Statistics II (4) NW</b><br/>Brief review of: sample spaces, random variables, probability. Distribution: binomial, normal, Poisson, geometric. Followed by: expectation, variance, central limit theorem. Basic concepts of estimation, testing, and confidence intervals. Maximum likelihood estimators and likelihood ratio tests, efficiency. Introduction to regression. "}, {"course_id": "stat428", "reg_prereqs": [], "numCID": 428, "choice_prereqs": [["stat342", "stat362", "stat421"]], "course_info": "<p><b>STAT 428 Multivariate Analysis for the Social Sciences (4) NW</b><br/>Multivariate techniques commonly used in the social and behavioral sciences. Linear models for dependence analysis (multivariate regression, MANOVA, and discriminant analysis) and for interdependence analysis (principal components and factor analysis). Techniques applied to social science data using computer statistical packages. "}, {"course_id": "stat100", "reg_prereqs": [], "numCID": 100, "choice_prereqs": [], "course_info": "<p><b>STAT 100 Numbers and Reason (5) QSR</b><i> Bookstein</i><br/>Surveys the standard ways in which \"arithmetic turns into understanding\" across examples from the natural and the social sciences. Main concepts include abduction (inference to the best explanation), consilience (numerical agreement across multiple measurement levels), bell curves, linear models, and the likelihood of hypothesis. Offered: A.<br/><a href=\"https://uwstudent.washington.edu/student/myplan/course/STAT100\" target=\"_blank\">View course details in MyPlan: STAT 100</a></p"}], "links": [{"source": 14, "target": 10}, {"source": 15, "target": 13}, {"source": 29, "target": 26}]}